[
    {
        "ID": 1,
        "DUA": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\n",
        "TRAN": "\"Our Lord! Give us in this world that which is good and in the Hereafter that which is good, and save us from the torment of the Fire!\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 2,
        "DUA": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
        "TRAN": "\"Our Lord! Pour forth on us patience and make us victorious over the disbelieving people.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 3,
        "DUA": "رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\n",
        "TRAN": "\"Our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us Forgiveness. Have mercy on us. You are our Maula (Patron, Supporter and Protector, etc.) and give us victory over the disbelieving people.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 4,
        "DUA": "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ\n",
        "TRAN": "\"Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 5,
        "DUA": "رَبَّنَا إِنَّنَا آمَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ النَّارِ\n",
        "TRAN": "\"Our Lord! We have indeed believed, so forgive us our sins and save us from the punishment of the Fire.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 6,
        "DUA": "رَبِّ هَبْ لِي مِن لَّدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاء\n",
        "TRAN": "\"O my Lord! Grant me from You, a good offspring. You are indeed the All-Hearer of invocation.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 7,
        "DUA": "رَبَّنَا آمَنَّا بِمَا أَنزَلْتَ وَاتَّبَعْنَا الرَّسُولَ فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
        "TRAN": "\"Our Lord! We believe in what You have sent down, and we follow the Messenger; so write us down among those who bear witness.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 8,
        "DUA": "ربَّنَا اغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ\n",
        "TRAN": "\"Our Lord! Forgive us our sins and our transgressions (in keeping our duties to You), establish our feet firmly, and give us victory over the disbelieving folk.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 9,
        "DUA": "رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ",
        "TRAN": "\"Our Lord! We have wronged ourselves. If You forgive us not, and bestow not upon us Your Mercy, we shall certainly be of the losers.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 10,
        "DUA": "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
        "TRAN": "\"Our Lord! Place us not with the people who are Zaalimoon (polytheists and wrong doers).\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 11,
        "DUA": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ\n",
        "TRAN": "\"Our Lord! pour out on us patience, and cause us to die as Muslims.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 12,
        "DUA": "حَسْبِيَ اللّهُ لا إِلَـهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
        "TRAN": "\"Allah is sufficient for me. Laa ilaaha illa Huwa (none has the right to be worshipped but He), in Him I put my trust and He is the Lord of the Mighty Throne.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 13,
        "DUA": "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ\n",
        "TRAN": "\"Our Lord! Make us not a trial for the folk who are Zaalimoon. And save us by Your Mercy from the disbelieving folk.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 14,
        "DUA": "رَبِّ إِنِّي أَعُوذُ بِكَ أَنْ أَسْأَلَكَ مَا لَيْسَ لِي بِهِ عِلْمٌ وَإِلاَّ تَغْفِرْ لِي وَتَرْحَمْنِي أَكُن مِّنَ الْخَاسِرِينَ\n",
        "TRAN": "\"O my Lord! I seek refuge with You from asking You that of which I have no knowledge. And unless You forgive me and have Mercy on me, I would indeed be one of the losers.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 15,
        "DUA": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء\n",
        "TRAN": "\"O my Lord! Make me one who performs As-Salaat (Iqaamat-as-Salaat), and (also) from my offspring, our Lord! And accept my invocation.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 16,
        "DUA": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ\n",
        "TRAN": "\"Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 17,
        "DUA": "رَّبِّ أَدْخِلْنِي مُدْخَلَ صِدْقٍ وَأَخْرِجْنِي مُخْرَجَ صِدْقٍ وَاجْعَل لِّي مِن لَّدُنكَ سُلْطَانًا نَّصِيرًا\n",
        "TRAN": "\"My Lord! Let my entry (to the city of Al-Madinah) be good, and likewise my exit (from the city of Makkah) be good. And grant me from You an authority to help me (or a firm sign or a proof).\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 18,
        "DUA": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
        "TRAN": "\"Our Lord! Bestow on us mercy from Yourself, and facilitate for us our affair in the right way!\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 19,
        "DUA": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي يَفْقَهُوا قَوْلِي\n",
        "TRAN": "\"O my Lord! Open for me my chest. And ease my task for me. And make loose the knot from my tongue, that they understand my speech.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 20,
        "DUA": "رَّبِّ زِدْنِي عِلْمًا\n",
        "TRAN": "\"My Lord! Increase me in knowledge.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 21,
        "DUA": "لا إِلَهَ إِلا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
        "TRAN": "\"None has the right to be worshipped but You (O Allah), Glorified (and Exalted) are You. Truly, I have been of the wrong-doers.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 22,
        "DUA": "رَبِّ لَا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ\n",
        "TRAN": "\"O My Lord! Leave me not single (childless), though You are the Best of the inheritors.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 23,
        "DUA": "رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ\n",
        "TRAN": "\"My Lord! I seek refuge with You from the whisperings (suggestions) of the Shayatin (devils). And I seek refuge with You, My Lord! lest they may attend (or come near) me.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 24,
        "DUA": "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ\n",
        "TRAN": "\"Our Lord! We believe, so forgive us, and have mercy on us, for You are the Best of all who show mercy!\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 25,
        "DUA": "رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ\n",
        "TRAN": "\"My Lord! Forgive and have mercy, for You are the Best of those who show mercy!\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 26,
        "DUA": "رَبَّنَا تَقَبَّلۡ مِنَّآ‌ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ\n",
        "TRAN": "Our Lord! Accept from us (this duty). Lo! Thou, only Thou, art the Hearer, the Knower.",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 27,
        "DUA": "رَبَّنَآ ءَامَنَّا فَٱكۡتُبۡنَا مَعَ ٱلشَّـٰهِدِينَ\n",
        "TRAN": "Our Lord, we believe. Inscribe us as among the witnesses.\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 28,
        "DUA": "رَبُّنَا‌ ؕ وَسِعَ رَبُّنَا كُلَّ شَىۡءٍ عِلۡمًا‌ؕ عَلَى اللّٰهِ تَوَكَّلۡنَا‌ ؕ رَبَّنَا افۡتَحۡ بَيۡنَنَا وَبَيۡنَ قَوۡمِنَا بِالۡحَـقِّ وَاَنۡتَ خَيۡرُ الۡفٰتِحِيۡنَ\n",
        "TRAN": "Our Lord comprehendeth all things in knowledge. In Allah do we put our trust. Our Lord! Decide with truth between us and our folk, for Thou art the best of those who make decision.\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 29,
        "DUA": "رَبَّنَاۤ اِنَّكَ تَعۡلَمُ مَا نُخۡفِىۡ وَمَا نُعۡلِنُ‌ ؕ وَمَا يَخۡفٰى عَلَى اللّٰهِ مِنۡ شَىۡءٍ فِى الۡاَرۡضِ وَلَا فِى السَّمَآءِ‏\n",
        "TRAN": "Our Lord! Lo! Thou knowest that which we hide and that which we proclaim. Nothing in the earth or in the heaven is hidden from Allah.",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 30,
        "DUA": "رَبَّنَاۤ اِنَّـنَا نَخَافُ اَنۡ يَّفۡرُطَ عَلَيۡنَاۤ اَوۡ اَنۡ يَّطۡغٰى\n",
        "TRAN": "Our Lord! Lo! we fear that he may be beforehand with us or that he may play the tyrant.\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 31,
        "DUA": "رَبَّنَا ٱصۡرِفۡ عَنَّا عَذَابَ جَهَنَّمَ‌ۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا (﻿٦٥﻿) إِنَّهَا سَآءَتۡ مُسۡتَقَرًّ۬ا وَمُقَامً۬ا\n",
        "TRAN": "Our Lord! Avert from us the doom of hell; lo! the doom thereof is anguish; Lo! it is wretched as abode and station;\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 32,
        "DUA": "رَبَّنَا هَبۡ لَـنَا مِنۡ اَزۡوَاجِنَا وَذُرِّيّٰتِنَا قُرَّةَ اَعۡيُنٍ وَّاجۡعَلۡنَا لِلۡمُتَّقِيۡنَ اِمَامًا\n",
        "TRAN": "\"Our Lord! Grant unto us wives and offspring who will be the comfort of our eyes and give us (the grace) to lead the righteous.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 33,
        "DUA": "الۡحَمۡدُ لِلّٰهِ الَّذِىۡۤ اَذۡهَبَ عَـنَّا الۡحَزَنَ ؕ اِنَّ رَبَّنَا لَـغَفُوۡرٌ شَكُوۡرُ ۙ‏",
        "TRAN": "Praise be to Allah Who has removed from us (all) sorrow: for Our Lord is indeed Oft-Forgiving, Ready to appreciate (service):\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 34,
        "DUA": "رَبَّنَا وَسِعۡتَ كُلَّ شَىۡءٍ رَّحۡمَةً وَّعِلۡمًا فَاغۡفِرۡ لِلَّذِيۡنَ تَابُوۡا وَاتَّبَعُوۡا سَبِيۡلَكَ وَقِهِمۡ عَذَابَ الۡجَحِيۡمِ\n",
        "TRAN": "Our Lord! Thy reach is over all things in Mercy, and Knowledge. Forgive, then, those who turn in repentance, and follow Thy Path: and preserve them from the Penalty of the Blazing Fire!\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 35,
        "DUA": "رَبَّنَا اغۡفِرۡ لَـنَا وَلِاِخۡوَانِنَا الَّذِيۡنَ سَبَقُوۡنَا بِالۡاِيۡمَانِ وَلَا تَجۡعَلۡ فِىۡ قُلُوۡبِنَا غِلًّا لِّلَّذِيۡنَ اٰمَنُوۡا رَبَّنَاۤ اِنَّكَ رَءُوۡفٌ رَّحِيۡمٌ\n",
        "TRAN": "\"Our Lord! Forgive us, and our brethren who came before us into the Faith and leave not in our hearts, rancour (or sense of injury) against those who have believed Our Lord! Thou art indeed Full of Kindness, Most Merciful.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 36,
        "DUA": "رَبَّنَا عَلَيۡكَ تَوَكَّلۡنَا وَاِلَيۡكَ اَنَـبۡنَا وَاِلَيۡكَ الۡمَصِيۡرُ\n",
        "TRAN": "Our Lord! in Thee do we trust, and to Thee do we turn in repentance: to Thee is (our) final Goal.\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 37,
        "DUA": "رَبَّنَا لَا تَجۡعَلۡنَا فِتۡنَةً لِّلَّذِيۡنَ كَفَرُوۡا وَاغۡفِرۡ لَـنَا رَبَّنَا‌ ۚ اِنَّكَ اَنۡتَ الۡعَزِيۡزُ الۡحَكِيۡمُ‏\n",
        "TRAN": "\"Our Lord! Make us not a (test and) trial for the Unbelievers, but forgive us, our Lord! For Thou art the Exalted in Might, the Wise.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 38,
        "DUA": "رَبَّنَاۤ اَ تۡمِمۡ لَـنَا نُوۡرَنَا وَاغۡفِرۡ لَـنَا‌ ۚ اِنَّكَ عَلٰى كُلِّ شَىۡءٍ قَدِيۡرٌ\n",
        "TRAN": "\"Our Lord! perfect our Light for us, and grant us Forgiveness; for Thou has power over all things.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 39,
        "DUA": "رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا",
        "TRAN": "“Our Lord, do not condemn us if we forget or make a mistake.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 40,
        "DUA": "فَاللَّهُ خَيْرٌ حَافِظًا وَهُوَ أَرْحَمُ الرَّاحِمِينَ.",
        "TRAN": "\"Allah is the Best Protector, and He is the Most Merciful of the merciful.”",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 41,
        "DUA": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ.",
        "TRAN": "\"Our Lord, pour upon us patience and let us die as Muslims [in submission to You].\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 42,
        "DUA": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي.",
        "TRAN": null,
        "REF": "رواه مسلم"
    },
    {
        "ID": 43,
        "DUA": "اللَّهُمَّ أَصْلِحْ لي دِينِي الذي هو عِصْمَةُ أَمْرِي، وَأَصْلِحْ لي دُنْيَايَ الَّتي فِيهَا معاشِي، وَأَصْلِحْ لي آخِرَتي الَّتي فِيهَا معادِي، وَاجْعَلِ الحَيَاةَ زِيَادَةً لي في كُلِّ خَيْرٍ، وَاجْعَلِ المَوْتَ رَاحَةً لي مِن كُلِّ شَرٍّ.",
        "TRAN": "O Allah, make my religion easy for me by virtue of which my affairs are protected, set right for me my world where my life exists, make good for me my Hereafter which is my resort to which I have to return, and make my life prone to perform all types of good, and make death a comfort for me from every evil.\"",
        "REF": "رواه مسلم"
    },
    {
        "ID": 44,
        "DUA": "اللَّهُمَّّ آتنا في الدنيا حسنة، وفي الآخرة حسنة وقنا عذاب النار.",
        "TRAN": "\" Our Lord, grant us the good in this world and the good in the Hereafter and save us from the torment of Hell Fire.\"",
        "REF": "رواه البخاري ومسلم"
    },
    {
        "ID": 45,
        "DUA": "وَاكْتُبْ لَنَا فِي هَٰذِهِ الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ إِنَّا هُدْنَا إِلَيْكَ.",
        "TRAN": "And decree for us in this world [that which is] good and [also] in the Hereafter; indeed, we have turned back to You.\" ",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 46,
        "DUA": "إِنِّي وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَاوَاتِ وَالْأَرْضَ حَنِيفًا وَمَا أَنَا مِنَ الْمُشْرِكِينَ.",
        "TRAN": "Indeed, I have turned my face toward He who created the heavens and the earth, inclining toward truth, and I am not of those who associate others with Allah.\"\n",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 47,
        "DUA": "رَبِّ نَجِّنِي مِنَ الْقَوْمِ الظَّالِمِينَ.",
        "TRAN": "\"My Lord, save me from the wrongdoing people\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 48,
        "DUA": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ.",
        "TRAN": "O Allah, I seek refuge in you from grief and sadness, from weakness and from laziness, from miserliness and from cowardice, from being overcome by debt and overpowered by men (i.e. others).",
        "REF": "رواه البخاري"
    },
    {
        "ID": 49,
        "DUA": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِنْ ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاءِ.",
        "TRAN": "\"My Lord, make me an establisher of prayer, and [many] from my descendants. Our Lord, and accept my supplication.\"",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 50,
        "DUA": "حَسْبِيَ اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ.",
        "TRAN": "Allah is sufficient for me. There is none worthy of worship but Him.\nI have placed my trust in Him, He is Lord of the Majestic Throne.",
        "REF": "أدعية قرآنية"
    },
    {
        "ID": 51,
        "DUA": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِلَّذِينَ كَفَرُوا وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ.",
        "TRAN": "Our Lord, do not make us a test for the unbelievers, and forgive us, our Lord. Surely You are Most Mighty, Most Wise.”",
        "REF": "أدعية قرآنية"
    }
]