[
    {
        "ID": 1,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال : ما من داء إلا في الحبة السوداء منه شفاء إلا السام .",
        "REF": "صحيح مسلم رقم 2215",
        "TRANSLATION": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\n\nThere is no disease for which Nigella seed does not provide remedy.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 2,
        "HADITH": "عن أبي هريرة رضي الله عنه قال : قال رسول الله ﷺ : من تطهر في بيته ثم مشى إلى بيت من بيوت الله ليقضي فريضة من فرائض الله كانت خطوتاه إحداهما تحط خطيئة والأخرى ترفع درجة .",
        "REF": "صحيح مسلم  666",
        "TRANSLATION": "Abu Huraira reported:\n\nThe Messenger of Allah (may peace be' upon him) said: He who purified himself in his house, and then he walked to one of the houses of Allah for the sake of performing a Fard (obligatory act) out of the Fara'id (obligatory acts) of Allah, both his steps (would be significant) as one of them would obliterate his sin and the second one would raise his status.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 3,
        "HADITH": "عن الأغر المزني رضي الله عنه ان رسول الله ﷺ قال: يَا أَيُّهَا النَّاسُ تُوبُوا إلى اللهِ، فإنِّي أَتُوبُ في اليَومِ إلَيْهِ مِئَةَ مَرَّةٍ.",
        "REF": "صحيح مسلم 2702",
        "TRANSLATION": "Allah's Messenger (ﷺ) said:\n\"O people, repent to Allah, for I verily repent to Him one hundred times a day.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 4,
        "HADITH": "عن أبي هريرة رضي الله عنه - عن النبي صلى الله عليه وسلم قال : لا تسبوا الدهر فإن الله هو الدهر .",
        "REF": "صحيح مسلم رقم 2246 ",
        "TRANSLATION": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:\n\nDo not curse Time, for it is Allah Who is Time.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 5,
        "HADITH": "قال رسول الله صلى الله عليه وسلم: إذا قضى أحدكم الصلاة في مسجده فليجعل لبيته نصيباً من صلاته فإن الله جاعلٌ في بيته من صلاته خيراً .",
        "REF": "رواه  مسلم  رقم 778",
        "TRANSLATION": "Jabir reported God’s Messenger as saying, “When one of you performs the prayer in his mosque he should leave a portion of his prayer for his house, for God blesses his house because of his prayer.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 6,
        "HADITH": "عن العباس بن عبدالمطلب رضي الله عنه ، أنه سَمِعَ رسول الله صلى الله عليه وسلم يقول : ذَاقَ طَعْمَ الْإيمَانِ ، مَنْ رَضِيَ بِاللّٰه رَبٍّا ، وَبِالْإِسْلامَ دِينًا ، وَبِمُحَمَّدٍ صلى اللّٰه عليه وسلم رَسُولًا .",
        "REF": "صحيح مسلم رقم 34",
        "TRANSLATION": "It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:\n\nHe has found the taste of faith (iman) who is content with Allah as his Lord, with Islam as his religion (code of life) and with Muhammad (ﷺ) as his Prophet.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 7,
        "HADITH": "قال رسول الله ﷺ: أقرب ما يكون العبد من ربه وهو ساجد ، فأكثروا الدعاء",
        "REF": "صحيح مسلم 482",
        "TRANSLATION": "Abu Huraira reported:\n\nThe Messenger of Allah (ﷺ) said: The nearest a servant comes to his Lord is when he is prostrating himself, so make supplication (in this state).",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 8,
        "HADITH": "قال  رسول ﷲ ﷺ : إن العبد ليتكلم بالكلمة من رضوان الله لا يلقي لها بالاً يرفعه الله بها درجات، وإن العبد ليتكلم بالكلمة من سخط الله لا يلقي لها بالاً يهوي بها في جهنم .",
        "REF": "رواه البخاري ",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Prophet (ﷺ) said, \"A man utters a word pleasing to Allah without considering it of any significance for which Allah exalts his ranks (in Jannah); another one speaks a word displeasing to Allah without considering it of any importance, and for this reason he will sink down into Hell.\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 9,
        "HADITH": "قال رسول الله ﷺ : إياكم والظن ؛ فإن الظن أكذب الحديث، ولا تحسسوا ، ولا تجسسوا، ولا تناجشوا ، ولا تحاسدوا، ولا تباغضوا، ولا تدابروا ، وكونوا عباد الله إخوانا . ",
        "REF": "رواه البخاري ",
        "TRANSLATION": "Narrated Abu Huraira:\n\nAllah's Messenger (ﷺ) said, \"Beware of suspicion, for suspicion is the worst of false tales. and do not look for the others' faults, and do not do spying on one another, and do not practice Najsh, and do not be jealous of one another and do not hate one another, and do not desert (stop talking to) one another. And O, Allah's worshipers! Be brothers!\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 10,
        "HADITH": "قَالَ رَسُولُ اَللَّهِ ‏- صلى الله عليه وسلم ‏-( أَثْقَلُ اَلصَّلَاةِ عَلَى اَلْمُنَافِقِينَ: صَلَاةُ اَلْعِشَاءِ, وَصَلَاةُ اَلْفَجْرِ, وَلَوْ يَعْلَمُونَ مَا فِيهِمَا لَأَتَوْهُمَا وَلَوْ حَبْوًا )",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Narrated [Abu Hurairah (RA)]:\nAllah's Messenger (ﷺ) said: \"The most burdensome prayers for hypocrites are the 'Isha' and the Fajr prayers and if they knew what (rewards) these (prayers) contain, they would have come to them (in the mosques), even though they had to crawl on their knees.\"",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 11,
        "HADITH": "قال رسول ﷲ ﷺ: يا معاذ ، أتدري ما حق الله على العباد ؟ قال : اللهُ ورسوله أعلم، قال : أن يعبدوه ولا يشركوا به شيئًا، أتدري ما حقهم عليه ؟ قال : اللهُ ورسوله أعلم، قال : أن لا يعذبهم .",
        "REF": " أخرجه البخاري ومسلم",
        "TRANSLATION": "Narrated Mu`adh bin Jabal:\n\nThe Prophet (ﷺ) said, \"O Mu`adh! Do you know what Allah's Right upon His slaves is?\" I said, \"Allah and His Apostle know best.\" The Prophet (ﷺ) said, \"To worship Him (Allah) Alone and to join none in worship with Him (Allah). Do you know what their right upon Him is?\" I replied, \"Allah and His Apostle know best.\" The Prophet (ﷺ) said, \"Not to punish them (if they do so).",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 12,
        "HADITH": "قال رسول الله ﷺ : من سن في الإسلام سنة حسنة، فله أجرها وأجر من عمل بها بعده من غير أن ينقص من أجورهم شيء، ومن سن في الإسلام سنة سيئة كان عليه وزرها ووزر من عمل بها من بعده من غير أن ينقص من أوزارهم شيء .",
        "REF": "رواه مسلم ",
        "TRANSLATION": " Allah's Messenger (ﷺ) said:\n\nHe who introduced some good practice in Islam which was followed after him (by people) he would be assured of reward like one who followed it, without their rewards being diminished in any respect. And he who introduced some evil practice in Islam which had been followed subsequently (by others), he would be required to bear the burden like that of one who followed this (evil practice) without their's being diminished in any respect.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 13,
        "HADITH": "قال رسول الله ﷺ : من حفظ عشر آيات من أول سورة الكهف عصم من الدجال .",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abud-Darda' (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said: \"Whoever commits to memory the first ten Ayat of the Surat Al-Kahf, will be protected from (the trial of) Ad-Dajjal (Antichrist).\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 14,
        "HADITH": "قال رسول الله ﷺ : إنَّ اللهَ كتب كتابًا قبل أن يخلُقَ الخلقَ إنَّ رحمتي سبَقَتْ غضبي ، فهو مكتوبٌ عندَه فوقَ العرشِ .",
        "REF": "صحيح البخاري",
        "TRANSLATION": "Narrated Abu Hurairah (ra):\nI heard Allah's Messenger (ﷺ) saying: \"Before Allah created the creations, He wrote a Book (wherein He has written): \"My Mercy has preceded my Anger.' And that is written with Him over the Throne.\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 15,
        "HADITH": "قال رسول ﷲ ﷺ : يخرج من النار من قال لا إله إلا الله وفي قلبه وزن شعيرة من خير .",
        "REF": " رواه البخاري ومسلم ",
        "TRANSLATION": "Narrated Anas:\n\nThe Prophet (ﷺ) said, \"Whoever said \"None has the right to be worshipped but Allah and has in his heart good (faith) equal to the weight of a barley grain will be taken out of Hell.",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 16,
        "HADITH": "قال رسول الله صلى الله عليه وسلم‏:‏ ‏ \"‏ إذا دخل أحدكم المسجد فلا يجلس حتى يصلي ركعتين‏\"‏‏.‏ ",
        "REF": "رواه البخاري ",
        "TRANSLATION": "Abu Qatadah (May Allah be pleased with him)reported:\nThe Messenger of Allah (ﷺ) said, \"When anyone of you enters the mosque, he should perform two Rak'ah (of voluntary prayer) before sitting.",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 17,
        "HADITH": "قال رسول الله ﷺ : اتقوا الظلم ؛ فإن الظلم ظلمات يوم القيامة، واتقوا الشح ؛ فإن الشح أهلك من كان قبلكم ؛ حملهم على أن سفكوا دماءهم، واستحلوا محارمهم .",
        "REF": "رواه مسلم ",
        "TRANSLATION": "Jabir bin 'Abdullah (May Allah be pleased with him) reported:\nMessenger of Allah (ﷺ) said, \"Beware of oppression, for oppression will be darkness on the Day of Resurrection; and beware of stinginess because it destroyed those who were before you. It incited them to shed their blood and deem unlawful as lawful.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 18,
        "HADITH": "قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاء.",
        "REF": " رواه البخاري ومسلم ",
        "TRANSLATION": "Abdallah b. Mas'ud reported God’s Messenger as saying, “Young man, those of you who can support a wife should marry, for it keeps you from looking at strange women and preserves you from immorality; but those who cannot should devote themselves to fasting, for it is a means of suppressing sexual desire.”** Waja' has been translated freely above. It means castration.",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 19,
        "HADITH": "قال رسول الله ﷺ: أنا وَكافلُ اليتيمِ في الجنَّةِ هَكَذا . وأشارَبالسَّبَّابةِ والوُسطى ، وفرَّجَ بينَهما شيئًا .",
        "REF": "صحيح البخاري ",
        "TRANSLATION": "Allah's Messenger (ﷺ) said, \"I and the one who looks after an orphan will be like this in Paradise,\" showing his middle and index fingers and separating them.",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 20,
        "HADITH": "قال رسول الله ﷺ : \"‏ إِنَّ فِي الْجُمُعَةِ لَسَاعَةً لاَ يُوَافِقُهَا مُسْلِمٌ قَائِمٌ يُصَلِّي يَسْأَلُ اللَّهَ خَيْرًا إِلاَّ أَعْطَاهُ إِيَّاهُ.\" وَقَالَ بِيَدِهِ يُقَلِّلُهَا يُزَهِّدُهَا.",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Huraira reported Abu'l-Qasim (the kunya of the Holy Prophet) (ﷺ) as saying:\n\nThere is a time on Friday at which no Muslim would stand and pray and beg Allah for what Is good but He would give it to him; and he pointed with his hand that (this time) is short and narrow.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 21,
        "HADITH": "قال رسول الله ﷺ : اجعلوا في بيوتكم من صلاتكم ولا تتخذوها قبورا .",
        "REF": "صحيح البخاري",
        "TRANSLATION": "The Prophet (ﷺ) had said, \"Offer some of your prayers (Nawafil) at home, and do not take your houses as graves.\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 22,
        "HADITH": "عن عبد الله بن عمرو ، أن رجلا سأل رسول الله صلى الله عليه وسلم ، أي الإسلام خير ؟ قال :  تطعم الطعام ، وتقرأ السلام على من عرفت ومن لم تعرف  .",
        "REF": "صحيح البخاري",
        "TRANSLATION": "Narrated 'Abdullah bin 'Amr:\n\nA person asked Allah's Messenger (ﷺ) . \"What (sort of) deeds in or (what qualities of) Islam are good?\" He replied, \"To feed (the poor) and greet those whom you know and those whom you don't know.\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 23,
        "HADITH": "قال رسول الله ﷺ : إذا أمَّن القارئُ فأمِّنوا ، فإنَّ الملائكةَ تُؤمِّنُ ، فمن وافق تأمينُه تأمينَ الملائكةِ  غُفِر له ما تقدَّم من ذنبِه .",
        "REF": "صحيح البخاري",
        "TRANSLATION": "It was narrated from Abu Hurairah that:\nThe Prophet (ﷺ) said: \"When the reciter says Amin, then say: \"Amin\" too, for the angels say Amin and if a person's Amin coincides with the Amin of the angels, Allah will forgive his previous sins\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 24,
        "HADITH": "قال رسول الله ﷺ : من سرَّهُ أن يُنجيهِ اللهُ من كُرَبِ يومِ القيامةِ فلينفِّسْ عن معسرٍ ، أو يضعَ  عنهُ .",
        "REF": " صحيح مسلم",
        "TRANSLATION": "Abu Qatada reported God's Messenger as saying, “If anyone would like God to save him from the anxieties of the day of resurrection, he should grant a respite to one who is in straitened circumstances, or remit his debt.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 25,
        "HADITH": "قال رسول الله ﷺ : إن العبد ليتكلم بالكلمة ما يتبين ما فيها، يهوي بها في النار أبعد ما بين المشرق والمغرب . ",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\n\nThe servant speaks words that he does not understand its repercussions but he sinks down in Hell-Fire farther than the distance between the east and the west.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 26,
        "HADITH": "قال رسول الله ﷺ: لا تسبوا الأموات فإنهم قد أفضوا إلى ما قدموا .",
        "REF": " صحيح البخاري",
        "TRANSLATION": "Narrated `Aisha:\n\nThe Prophet (ﷺ) said, \"Do not abuse the dead, for they have reached the result of what they have done.\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 28,
        "HADITH": "قال رسول الله ﷺ :التثاؤب من الشيطان ، فإذا تثاءب أحدكم فليكظم ما استطاع ",
        "REF": "صحيح مسلم",
        "TRANSLATION": "Narrated Abu Hurairah (RA):\nThe Prophet (ﷺ) said: \"Yawning is caused by the devil, so when one of you yawns he must repress it as much as he can.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 30,
        "HADITH": "قال رسول الله ﷺ : من تصبح كل يوم سبع تمرات عجوة، لم يضره في ذلك اليوم سم ولا سحر .",
        "REF": "رواه البخاري ",
        "TRANSLATION": "Narrated Sa`d:\n\nAllah's Messenger (ﷺ) said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or magic on the day he eats them.\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 31,
        "HADITH": "قال رسول الله ﷺ : الملائكة تصلي على أحدكم ما دام في مصلاه ما لم يحدث : اللهم اغفر له، اللهم ارحمه . لا يزال أحدكم في صلاة ما دامت الصلاة تحبسه لا يمنعه أن ينقلب إلى أهله إلا الصلاة.",
        "REF": "رواه البخاري",
        "TRANSLATION": "Narrated Abu Huraira:\n\nAllah's Messenger (ﷺ) said, \"The angels keep on asking for Allah's Blessing and Forgiveness for anyone of you as long as he is at his Musalla (praying place) and does not do Hadath (passes wind). The angels say, 'O Allah! Forgive him and be Merciful to him.' Each one of you is in the prayer as long as he is waiting for the prayer and nothing but the prayer detains him from going to his family.\"",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 32,
        "HADITH": "قال رسول الله ﷺ: إن الله عز وجل يبسط يده بالليل ليتوب مسيء النهار ، ويبسط يده بالنهار ليتوب مسيء الليل ، حتى تطلع الشمس من مغربها ",
        "REF": "رواه مسلم ",
        "TRANSLATION": "Abu Musa reported Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Glorious, Stretches out His Hand during the night so that the people may repent for the fault committed from dawn till dusk and He stretches out His Hand during the day so that the people may repent for the fault committed from dusk to dawn. (He would accept repentance) before the sun rises in the west (before the Day of Resurrection). ",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 33,
        "HADITH": "عن النبي صلى الله عليه وسلم ، قال : الشفاء في ثلاثة : في شرطة محجم ، أو شربة عسل ، أو كية بنار ، وأنا أنهى أمتي عن الكي .",
        "REF": "صحيح البخاري",
        "TRANSLATION": "Narrated Ibn `Abbas:\n\nThe Prophet (ﷺ) said, \"Healing is in three things: cupping, a gulp of honey or cauterization, (branding with fire) but I forbid my followers to use cauterization (branding with fire).",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 34,
        "HADITH": "قال رسول الله صلى الله عليه وسلم :  \"‏ مِنْ أَشْرَاطِ السَّاعَةِ أَنْ يُرْفَعَ الْعِلْمُ وَيَثْبُتَ الْجَهْلُ وَيُشْرَبَ الْخَمْرُ وَيَظْهَرَ الزِّنَا ‏\"‏ .",
        "REF": "رواه مسلم ",
        "TRANSLATION": "Anas b. Malik reported Allah's Messenger (ﷺ) as saying:\n\nIt is from the conditions of the Last Hour that knowledge would be taken away and ignorance would prevail (upon the world), the liquor would be drunk, and adultery would become rampant.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 35,
        "HADITH": "قال رسول الله ﷺ : إذا سمعتم الإقامة فامشوا إلى الصلاة وعليكم بالسكينة والوقار، ولا تسرعوا، فما أدركتم فصلوا، وما فاتكم فأتموا .",
        "REF": "رواه البخاري ",
        "TRANSLATION": "Narrated Abu Huraira:\n\nThe Prophet (ﷺ) said, \"When you hear the Iqama, proceed to offer the prayer with calmness and solemnity and do not make haste. And pray whatever you are able to pray and complete whatever you have missed.",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 36,
        "HADITH": "قال رسول الله ﷺ : من قال حين يصبح وحين يمسي : سبحان الله وبحمده. مائة مرة - لم يأت أحد يوم القيامة بأفضل مما جاء به، إلا أحد قال مثل ما قال، أو زاد عليه . ",
        "REF": "رواه مسلم ",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"He who recites in the morning and in the evening the statement: 'Subhan-Allahi wa bihamdihi (Allah is free from imperfection and I begin with praising Him)' one hundred times, will not be surpassed on the Day of Resurrection by anyone with better deeds than one who utters the same words or utters more of these words.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 37,
        "HADITH": "عن أبي هريرة رضي الله عنه : أن رجلا قال للنبي ﷺ : أوصني ؟ قال : لا تغضب . فردد مرارا، قال :  لا تغضب .",
        "REF": "رواه البخاري ",
        "TRANSLATION": "Abu Hurairah (RAA) narrated, ‘A man said, “O Messenger of Allah, advise me.” The Messenger of Allah (ﷺ) said:\n“Do not get angry.” The man repeated that several times and he replied, “Do not get angry.” Related by Al-Bukhari.",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 38,
        "HADITH": "قال رسول الله ﷺ: أفضَلُ الصِّيامِ بعد رمضان ، شَهْرُ اللهِ المُحَرَّم.",
        "REF": "رواه مسلم ",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"The best month for observing Saum (fasting) after Ramadan is Muharram, and the best Salat after the prescribed Salat is Salat at night.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 39,
        "HADITH": "قال رسول الله ﷺ : من اغتسل ثم أتى الجمعة فصلى ما قدر له، ثم أنصت حتى يفرغ من خطبته، ثم يصلي معه ؛ غفر له ما بينه وبين الجمعة الأخرى وفضل ثلاثة أيام .",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu-Huraira reported Allah's Apostle (ﷺ) as saying:\n\nHe who took a bath and then came for Jumu'a prayer and then prayed what was fixed for him, then kept silence till the Imam finished the sermon, and then prayed along with him, his sins between that time and the next Friday would be forgiven, and even of three days more.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 40,
        "HADITH": "قال رسول الله ﷺ : من صلى العشاء في جماعة، فكأنما قام نصف الليل، ومن صلى الصبح في جماعة، فكأنما صلى الليل كله . ",
        "REF": " رواه مسلم ",
        "TRANSLATION": "Uthman bin 'Affan (May Allah be pleased with him) reported:\nI heard the Messenger of Allah (ﷺ) saying: \"One who performs 'Isha' prayer in congregation, is as if he has performed Salat for half of the night. And one who performs the Fajr prayer in congregation, is as if he has performed Salat the whole night.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 41,
        "HADITH": "قال رسول الله ﷺ : لا صوم في يومين الفطر والاضحى .",
        "REF": " صحيح البخاري",
        "TRANSLATION": "The Messenger of Allah (ﷺ) said, \"No fasting is permissible on two days: `Id-ul-Fitr and `Id-ul-Adha\".",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 42,
        "HADITH": "قال رسول الله صلى الله عليه وسلم : إذا فرغ أحدكم من التشهد الآخِر، فليتعوذ بالله من أربع :  من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شر المسيح الدجال. ",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira reported God’s Messenger as saying, “When one of you finishes the last tashahhud he should seek refuge in God Irom four things:\nthe punishment in jahannam, the punishment in the grave, the trial of life and death, and the evil of the antichrist.”",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 43,
        "HADITH": "عن أبي موسى الأشعري رضي الله عنه أن رسول الله ﷺ قال: (من قاتل لتكون كلمةُ الله هي العليا، فهو في سبيل الله)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Jabir (May Allah be pleased with him) said:\nThe Prophet (ﷺ) said, \"Every one will be raised in the condition in which he dies\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 44,
        "HADITH": "عن سهل بن حَنيف رضي الله عنه قال: قال رسول الله ﷺ: (من سأل الله تعالى الشهادة بصدق بلَّغه الله منازل الشهداء وإن مات على فراشه)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Sahl b. Hunaif reported God’s Messenger as saying, “If anyone asks God for martyrdom with a genuine purpose God will bring him to the dwellings of the martyrs, even if he dies on his bed.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 45,
        "HADITH": "عن أبي هريرة رضي الله عنه عن رسول الله ﷺ قال: (لا تقوم الساعة حتى تقاتلوا اليهود، حتى يقول الحجر وراءه اليهودي: يا مسلم، هذا يهودي ورائي فاقتله)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Narrated Abu Huraira:\n\nAllah's Messenger (ﷺ) said, \"The Hour will not be established until you fight with the Jews, and the stone behind which a Jew will be hiding will say. \"O Muslim! There is a Jew hiding behind me, so kill him.\"",
        "REF_TRANSLATION": "[Sahih al-Bukhari 2926]"
    },
    {
        "ID": 46,
        "HADITH": "عن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: (بدأ الإسلام غريبا، وسيعود كما بدأ غريبا، فطوبى للغرباء)",
        "REF": "رواه مسلم",
        "TRANSLATION": "It is narrated on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said: Islam initiated as something strange, and it would revert to its (old position) of being strange. so good tidings for the stranger.",
        "REF_TRANSLATION": "[Sahih Muslim 145]"
    },
    {
        "ID": 47,
        "HADITH": " عن المغيرة بن شعبة رضي الله عنه عن النبي ﷺ قال: (لا يزال طائفة من أمتي ظاهرين، حتى يأتيهم أمر الله وهم ظاهرون)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Narrated Al-Mughira bin Shu`ba:\nThe Prophet (ﷺ) said, \"A group of my follower swill remain predominant (victorious) till Allah's Order (the Hour) comes upon them while they are still predominant (victorious).",
        "REF_TRANSLATION": "[Sahih al-Bukhari 7311]"
    },
    {
        "ID": 48,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (إذا مات الإنسان انقطع عمله إلا من ثلاث: صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"When a man dies, his deeds come to an end, except for three: A continuous charity, knowledge by which people derive benefit, pious son who prays for him.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 49,
        "HADITH": " عن أنس رضي الله عنه عن النبي ﷺ أنه قال: (يتبع الميت ثلاثة فيرجع اثنان ويبقى معه واحد، يتبعه أهله وماله وعمله، فيرجع أهله وماله، ويبقى عمله)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "Narrated Anas bin Malik:\n\nAllah's Messenger (ﷺ) said, \"When carried to his grave, a dead person is followed by three, two of which return (after his burial) and one remains with him: his relative, his property, and his deeds follow him; relatives and his property go back while his deeds remain with him.\"",
        "REF_TRANSLATION": "[Sahih al-Bukhari 6514]"
    },
    {
        "ID": 50,
        "HADITH": "عن جابر رضي الله عنه قال: سمعت رسول الله ﷺ يقول: (يُبعث كل عبد على ما مات عليه)",
        "REF": " رواه مسلم",
        "TRANSLATION": "Jabir (May Allah be pleased with him) said:\nThe Prophet (ﷺ) said, \"Every one will be raised in the condition in which he dies\".",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 51,
        "HADITH": "عن أبي هريرة رضي الله عنه أن النبي ﷺ قال: (خير يوم طلعت عليه الشمس يوم الجمعة، فيه خلق آدم، وفيه أدخل الجنة، وفيه أخرج منها، ولا تقوم الساعة إلا في يوم الجمعة)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Huraira reported God's Messenger as saying, “The best day on which the sun has risen is Friday; on it Adam was created, on it he was brought into paradise, on it he was expelled from it, and the last hour will take place on no day other than Friday.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 52,
        "HADITH": "عن أنس بن مالك رضي الله عنه عن النبي ﷺ قال: (سووا صفوفكم، فإن تسوية الصفوف من إقامة الصلاة)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "He reported God’s Messenger as saying, “Straighten your rows, for the straightening of the rows is part of the iqama for prayer.\"",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 53,
        "HADITH": "عن أبي هريرة رضي الله عنه قال: سمعت رسول الله ﷺ يقول: (إذا أقيمت الصلاة، فلا تأتوها تسعون، وأتوها تمشون، عليكم السكينة، فما أدركتم فصلوا، وما فاتكم فأتموا)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira reported God’s Messenger as saying, \"When the iqama has been pronounced for prayer, do not go running to it, but go walking in tranquility, and pray what you are in time for and complete what you have missed.”",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 54,
        "HADITH": " عن ابن عمر رضي الله عنهما أن رسول الله ﷺ قال: (اجعلوا آخر صلاتكم بالليل وتراً)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Ibn ‘Umar reported the Prophet as saying, \"Make the last of your prayer at night a witr.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 55,
        "HADITH": "عن أبي هريرة رضي الله عنه قال: أوصاني خليلي ﷺ بثلاث: (صيام ثلاثة أيام من كل شهر، وركعتي الضحى، وأن أوتر قبل أن أنام)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira said, ‘‘Prophet (ﷺ)  instructed me to observe three practices:\nto fast three days every month, to pray two rak'as in the forenoon, and to observe a witr before going to sleep.”",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 56,
        "HADITH": "عن عائشة رضي الله عنها عن النبي ﷺ قال: (ركعتا الفجر خير من الدنيا وما فيها)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Aishah (May Allah be pleased with her) reported:\nThe Prophet (ﷺ) said, \"The two Rak'ah before the dawn (Fajr) prayer are better than this world and all it contains.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 57,
        "HADITH": "عن أم المؤمنين أم حبيبة رملة بنت أبي سفيان، رضي الله عنهما، قالت سمعت رسول الله صلى الله عليه وسلم، يقول‏:‏( ما من عبد مسلم يصلي لله تعالى كل يوم ثنتي عشرة ركعة تطوعًا غير الفريضة، إلا بنى الله له بيتًا في الجنة أو‏:‏ إلا بني له بيت في الجنة)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Umm Habibah (May Allah be pleased with her) the Mother of the Believers reported:\nI heard the Messenger of Allah (ﷺ) saying, \"A house will be built in Jannah for every Muslim who offers twelve Rak'ah of optional Salat other than the obligatory Salat in a day and a night (to seek the Pleasure of Allah).\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 58,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (الملائكة تصلي على أحدكم ما دام في مصلاه الذي صلى فيه ما لم يُحدث، تقول: اللهم اغفر له، اللهم ارحمه)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"The angels supplicate in favour of one of you so long as he remains in the place where he has performed Salat (prayer) in a state of Wudu'. They (the angels) say: 'O Allah! Forgive him, O Allah! Have mercy on him.\"'",
        "REF_TRANSLATION": "[Al- Bukhari]"
    },
    {
        "ID": 59,
        "HADITH": "عن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: (إذا فرغ أحدكم من التشهد الآخِر، فليتعوذ بالله من أربع: من عذاب جهنم، ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شر المسيح الدجال)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira reported God’s Messenger as saying, “When one of you finishes the last tashahhud he should seek refuge in God Irom four things:\nthe punishment in jahannam, the punishment in the grave, the trial of life and death, and the evil of the antichrist.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 60,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (أقرب ما يكون العبد من ربه وهو ساجد فأكثروا الدعاء)",
        "REF": " رواه مسلم",
        "TRANSLATION": "Abu Huraira reported God’s Messenger as saying, “The nearest a servant comes to his Lord is when he is prostrating himself, so make supplication often.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 61,
        "HADITH": "عن أنس بن مالك رضي الله عنه عن النبي ﷺ قال: (اعتدلوا في السجود، ولا يبسط أحدكم ذراعيه انبساط الكلب)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "Anas reported God’s Messenger as saying, “Adopt a moderate position when prostrating yourselves, and see that none of you stretches out his forearms [on the ground] like a dog.”",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 62,
        "HADITH": "عن عبادة بن الصامت رضي الله عنه أن رسول الله ﷺ قال: (لا صلاة لمن لم يقرأ بفاتحة الكتاب) ",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "‘Ubada b. as-Samit reported God’s Messenger as saying, “He who does not recite Fatihat al-Kitab* is not credited with having observed prayer.”",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 63,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (ألا أدلكم على ما يمحو الله به الخطايا، ويرفع به الدرجات؟) قالوا بلى يا رسول الله قال: (إسباغ الوضوء على المكاره، وكثرة الخطا إلى المساجد، وانتظار الصلاة بعد الصلاة، فذلكم الرباط)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Huraira reported God’s messenger as saying, “Shall I not guide you to something for which God blots out sins and raises men's ranks?” When his hearers expressed their desire that he should tell them, he said, “Performing complete ablution although circumstances make it difficult, travelling far to mosques, and looking expectantly to the next time of prayer after prayers have been said. That is the defence of the frontier.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 64,
        "HADITH": "عن أبي قتادة رضي الله عنه أن رسول الله ﷺ قال: (إذا دخل أحدكم المسجد فليركع ركعتين قبل أن يجلس)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Qatada reported God’s Messenger as saying, “When one of you enters the mosque he should pray two rak'as before sitting down.”",
        "REF_TRANSLATION": " [al-Bukhari and Muslim]"
    },
    {
        "ID": 65,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (من غدا إلى المسجد أو راح أعد الله له في الجنة نُزُلاً كلما غدا أو راح)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Prophet (ﷺ) said, \"He who goes to the mosque at dawn or dusk (for Salat), Allah prepares a hospitable abode for him in Jannah, every time when he walks to it or comes back from it\".",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]"
    },
    {
        "ID": 66,
        "HADITH": "عن عثمان بن عفان رضي الله عنه قال: قال رسول الله ﷺ: (من صلى العشاء في جماعة فكأنما قام نصف الليل، ومن صلى الصبح في جماعة فكأنما قام الليل كله)",
        "REF": "رواه مسلم",
        "TRANSLATION": "‘Uthman reported God’s Messenger as saying, \"If anyone prays the evening prayer in company, it is as though he had remained awake in prayer half the night; but if anyone prays the Morning Prayer in company, it is as though he had prayed the whole night.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 67,
        "HADITH": "عن عبدالله بن مسعود رضي الله عنه قال: سألت النبي ﷺ: أي العمل أحب إلى الله؟ قال: (الصلاة على وقتها)، قال: ثم أي؟ قال: (بر الوالدين) قال: ثم أي؟ قال: (الجهاد في سبيل الله)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Ibn Mas'ud said:\nI asked the Prophet which action is dearest to God and he replied, “Prayer at its proper time.” I asked what came next, and he replied that it was kindness to parents. I asked what came next and he replied that it was jihad in God's path. He said, “He told me of them, and if I had asked for more he would have told me more.”",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]"
    },
    {
        "ID": 68,
        "HADITH": "عن أنس بن مالك رضي الله عنه أن رسول الله ﷺ قال: (من نسي صلاة فليصلها إذا ذكرها، لا كفارة لها إلا ذلك)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Anas reported God's Messenger as saying, “If anyone forgets a stated prayer or oversleeps, expiation is made by observing it when he remembers it.”",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]"
    },
    {
        "ID": 69,
        "HADITH": "عن أبي سعيد الخدري رضي الله عنه قال: قال رسول الله ﷺ: (إذا سمعتم المؤذن فقولوا مثل ما يقول)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Narrated Abu Sa'id al-Khudri (RA):\nAllah's Messenger (ﷺ) said: \"When you hear the Adhan repeat what the Mu'adhdhin (the call-maker) says.\"",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]"
    },
    {
        "ID": 70,
        "HADITH": " عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال:(التثاؤب من الشيطان فإذا تثاءب أحدكم فليرده ما استطاع)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Narrated Abu Hurairah (RA):\nThe Prophet (ﷺ) said: \"Yawning is caused by the devil, so when one of you yawns he must repress it as much as he can.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 71,
        "HADITH": "عَنِ ابْنِ عُمَرَ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: \" خَالِفُوا الْمُشْرِكِينَ: أَوْفِرُوا اللِّحَى وَأَحْفُوا الشَّوَارِبَ \". ",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Ibn ‘Umar reported God’s messenger as saying, \"Do the opposite of what the polytheists do ; let the beard grow long and clip the moustache.”",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]"
    },
    {
        "ID": 72,
        "HADITH": "عن أبي هريرة رضي الله عنه عن رسول الله ﷺ أنه قال: (الفطرة خمس: الاختتان، والاستحداد، وقص الشارب، وتقليم الأظفار، ونتف الإبط)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira reported:\n\nFive are the acts of fitra: circumcision, removing the pubes, clipping the moustache, cutting the nails, plucking the hair under the armpits.",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 73,
        "HADITH": "عن أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال‏:‏ ‏ \"‏لولا أن أشق على أمتي - أو على الناس- لأمرتهم بالسواك مع كل صلاة‏\"‏.",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"Had I not thought it difficult for my Ummah, I would have commanded them to use the Miswak (tooth-stick) before every Salat.\"",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 74,
        "HADITH": "عن عبدالله بن عمر رضي الله عنهما, أن رسول الله ﷺ قال: (إذا أكل أحدكم فليأكل بيمينه، وإذا شرب فليشرب بيمينه، فإن الشيطان يأكل بشماله، ويشرب بشماله)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Ibn Umar narrated that the Messenger of Allah (ﷺ) said:\n“When one of you eats he should eat with his right hand, and when he drinks he should drink with his right hand, for the devil eats and drinks with his left hand.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 75,
        "HADITH": "عن عائشة رضي الله عنها قالت:( كان النبي ﷺ يحب التيمن ما استطاع في شأنه كله في طهوره وترجله وتنعله)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "‘A'isha said that the Prophet liked to begin with the right as much as possible in all his affairs, in his purification, combing his hair, and putting on his sandals.",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 76,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (إذا استيقظ أحدكم من نومه، فلا يغمس يده في الإناء حتى يغسلها ثلاثا، فإنه لا يدري أين باتت يده)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira reported God's messenger as saying, “When one of you awakes from sleep he must not dip his hand in the vessel till he has washed it three times, for he does not know where his hand was during the night.”",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 77,
        "HADITH": " عن أبي موسى رضي الله عنه قال: قال رسول الله ﷺ: (مَثَلُ الذي يذكر ربه والذي لا يذكر ربه مَثَلُ الحي والميت)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "Abu Musa reported God’s messenger as saying, “He who remembers his Lord and he who does not are like the living and the dead.”",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 78,
        "HADITH": " عن أبي هريرة وأبي سعيد الخدري رضي الله عنهما عن النبي ﷺ قال: (لا يقعد قوم يذكرون الله عز وجل إلا حفتهم الملائكة، وغشيتهم الرحمة، ونزلت عليهم السكينة، وذكرهم الله فيمن عنده)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Hurairah and Abu Sa'id Al-Khudri (May Allah be pleased with them) reported:\nThe Messenger of Allah (ﷺ) said, \"When a group of people assemble for the remembrance of Allah, the angels surround them (with their wings), (Allah's) mercy envelops them, Sakinah, or tranquillity descends upon them and Allah makes a mention of them before those who are near Him.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 79,
        "HADITH": "عن عائشة رضي الله عنها عن النبي ﷺ قال: (أحب العمل إلى الله ما داوم عليه صاحبه وإن قلّ)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "A'isha (Allah be pleased with her) reported:\n\nThe Messenger of Allah (ﷺ) said: The deed liked most by Allah is one to which the doer adheres constantly even if it is small.",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 80,
        "HADITH": "عن ابن عباس رضي الله عنهما قال: قال رسول الله ﷺ: (نعمتان مغبون فيهما كثير من الناس: الصحة والفراغ)",
        "REF": "رواه البخاري",
        "TRANSLATION": "Ibn Abbas (May Allah be pleased with him) reported:\nMessenger of Allah (ﷺ) said, \"There are two blessings in which many people incur loss. (They are) health and free time (for doing good)\".",
        "REF_TRANSLATION": "[Al-Bukhari]"
    },
    {
        "ID": 81,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (ما نقصت صدقة من مال، وما زاد الله عبداً بعفوٍ إلا عزاً، وما تواضع أحد لله إلا رفعه الله)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nMessenger of Allah (ﷺ) said, \"Wealth does not diminish by giving Sadaqah (charity). Allah augments the honour of one who forgives; and one who serves another seeking the pleasure of Allah, Allah will exalt him in ranks.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 82,
        "HADITH": "عن أبي هريرة رضي الله عنه قال:( ما عاب النبي ﷺ طعاماً قطُّ، إن اشتهاه أكله وإن كرهه تركه)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira said that the Prophet never expressed disapproval of food; if he desired it he ate it and if he disliked it he left it alone.",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 83,
        "HADITH": "عن المستورد بن شداد رضي الله عنه قال: قال رسول الله ﷺ: (والله ما الدنيا في الآخرة إلا مثل ما يجعل أحدكم إصبعه في اليم، فلينظر بم تَرجِع؟)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Al-Mustaurad bin Shaddad (May allah be pleased with him) reported:\nMessenger of Allah (ﷺ) said, \"This world (i.e., its pleasures and duration) in comparison with the Hereafter is (similar to the amount of water) one gets when he puts his finger in the sea. Let him then see what it returns with\".",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 84,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (بادروا بالأعمال فتنا كقطع الليل المظلم، يصبح الرجل مؤمنا ويمسي كافرا، أو يمسي مؤمنا ويصبح كافرا، يبيع دينه بعرَضٍ من الدنيا)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nMessenger of Allah (ﷺ) said, \"Be prompt in doing good deeds (before you are overtaken) by turbulence which would be like a part of the dark night. A man would be a believer in the morning and turn to disbelief in the evening, or he would be a believer in the evening and turn disbeliever in the morning, and would sell his Faith for worldly goods.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 85,
        "HADITH": "عن أسامة بن زيد بن حارثة رضي الله عنهما قال: قال رسول الله ﷺ: (ما تركت بعدي فتنةً هي أضر على الرجال من النساء)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "Usamah bin Zaid (May Allah be pleased with them) reported:\nThe Prophet (ﷺ) said, \"I am not leaving behind me a more harmful trial for men than women\".",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 86,
        "HADITH": "عن أبي هريرة رضي الله عنه عن النبي ﷺ قال: (تُنكح المرأة لأربع: لمالها، ولحسبها، ولجمالها، ولدينها، فاظفر بذات الدين تَرِبَت يداك)",
        "REF": " رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira reported God’s Messenger as saying, “A woman may be married for four reasons, for her property, her rank, her beauty and her religion; so get the one who is religious and prosper.”** Taribat yadaka literally, \"may your hands cleave to the dust\". It is explained as being used to encourage one to action, and so it has been translated above by \"prosper.”",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 87,
        "HADITH": "عن عبدالله بن عمرو رضي الله عنهما أن رسول الله ﷺ قال: (الدنيا متاع، وخير متاع الدنيا المرأة الصالحة)",
        "REF": "رواه مسلم",
        "TRANSLATION": "‘Abdallah b. ‘Amr reported God’s Messenger as saying, “The whole world is to be enjoyed, but the best thing in the world is a good woman.”",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 88,
        "HADITH": "عن ابن عمر رضي الله عنهما أن رسول الله ﷺ قال: (أبرُّ البر أن يصل الرجلُ ودَّ أبيه)",
        "REF": "رواه مسلم",
        "TRANSLATION": "The Prophet (ﷺ) said, \"The finest act of goodness is that a person should treat kindly the loved ones of his father\".",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 89,
        "HADITH": "عن أنس رضي الله عنه عن النبي ﷺ أنه قال: (من أحب أن يُبسط له في رزقه، ويُنسأ له في أثره؛ فليصل رحمه)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Anas (May Allah be pleased with him) reported:\nMessenger of Allah (ﷺ) said, \"He who desires ample provisions and his life be prolonged, should maintain good ties with his blood relations\".",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 90,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (حق المسلم على المسلم خمس: ردُّ السلام وعيادة المريض، واتباع الجنائز، وإجابة الدعوة، وتشميت العاطس)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Abu Huraira reported God’s messenger as saying, “A Muslim has five duties towards another Muslim:\nto return a salutation, visit the sick, follow funerals, accept an invitation and say ‘God have mercy on you’ when one sneezes.”",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 91,
        "HADITH": "عن النعمان بن بشير رضي الله عنه قال: قال رسول الله ﷺ: (ترى المؤمنين في تراحمهم وتوادهم وتعاطفهم، كمثل الجسد، إذا اشتكى عضوا تداعى له سائر جسده بالسهر والحمى)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Narrated An-Nu`man bin Bashir:\n\nAllah's Messenger (ﷺ) said, \"You see the believers as regards their being merciful among themselves and showing love among themselves and being kind, resembling one body, so that, if any part of the body is not well then the whole body shares the sleeplessness (insomnia) and fever with it.\"",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 92,
        "HADITH": "عن أبي الدّرداء رضي الله عنه قال: قال رسول الله ﷺ: (ما من مسلم يدعو لأخيه بظهر الغيب إلا قال الملَك: ولك بمثل)",
        "REF": " رواه مسلم",
        "TRANSLATION": "Abud-Darda' (May Allah be pleased with him) reported:\nI heard the Messenger of Allah (ﷺ) saying, \"Whenever a Muslim supplicates for his (Muslim) brother in his absence, the angels say: 'May the same be for you too'.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 93,
        "HADITH": "عن أبي هريرة رضي الله عنه قال: قال رسول الله ﷺ: (المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدَر الله وما شاء فعل، فإن لو تفتح عمل الشيطان)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) reported:\nMessenger of Allah (ﷺ) said, \"A strong believer is better and dearer to Allah than a weak one, and both are good. Adhere to that which is beneficial for you. Keep asking Allah for help and do not refrain from it. If you are afflicted in any way, do not say: 'If I had taken this or that step, it would have resulted into such and such,' but say only: 'Allah so determined and did as He willed.' The word 'if' opens the gates of satanic thoughts\".",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 94,
        "HADITH": "عَنْ أَنَسِ بْنِ مَالِكٍ ‏- رضى الله عنه ‏- ( أَنَّ اَلنَّبِيَّ ‏- صلى الله عليه وسلم ‏-حَمِدَ اَللَّهَ , وَأَثْنَى عَلَيْهِ , وَقَالَ : \" لَكِنِّي أَنَا أُصَلِّي وَأَنَامُ , وَأَصُومُ وَأُفْطِرُ , وَأَتَزَوَّجُ اَلنِّسَاءَ , فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي)",
        "REF": "رواه البخاري ومسلم",
        "TRANSLATION": "Narrated Anas bin Malik (RA):\nThe Prophet (ﷺ) praised Allah, extolled Him and said, \"Yet I pray and sleep; I fast and break my fast; and I marry women. He who is displeased with my Sunnah (practices) is not my followed.\"",
        "REF_TRANSLATION": "[Al-Bukhari and Muslim]."
    },
    {
        "ID": 95,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (الصلوات الخمس، والجمعة إلى الجمعة، ورمضان إلى رمضان، مكفرات ما بينهن إذا اجتنبت الكبائر)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him)reported:\nThe Prophet (ﷺ) said, \"The five daily (prescribed) Salat, and Friday (prayer) to the next Friday (prayer), and the fasting of Ramadan to the next Ramadan, is expiation of the sins committed in between them, so long as major sins are avoided.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 96,
        "HADITH": "عن أبي هريرة رضي الله عنه أن رسول الله ﷺ قال: (أتدرون ما الغيبة؟) قالوا: الله ورسوله أعلم. قال: (ذكرك أخاك بما يكره) قيل: أرأيت إن كان في أخي ما أقول؟ قال: (إن كان فيه ما تقول فقد اغتبته، وإن لم يكن فيه ما تقول فقد بهته)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Abu Hurairah (May Allah be pleased with him) said:\nThe Messenger of Allah (ﷺ) said, \"Do you know what is backbiting?\" The Companions said: \"Allah and His Messenger know better.\" Thereupon he said, \"Backbiting is talking about your (Muslim) brother in a manner which he dislikes.\" It was said to him: \"What if my (Muslim) brother is as I say.\" He said, \"If he is actually as you say, then that is backbiting; but if that is not in him, that is slandering.\"",
        "REF_TRANSLATION": "[Muslim]"
    },
    {
        "ID": 97,
        "HADITH": "عن جابر بن عبدالله الأنصاري رضي الله عنهما قال: \" لعن رسول الله ﷺ آكل الربا، ومؤكله، وكاتبه، وشاهديه\"، وقال: (هم سواء)",
        "REF": "رواه مسلم",
        "TRANSLATION": "Jabir said that God's Messenger cursed the one who accepted usury, the one who paid it, the one who recorded it, and the two witnesses to it, saying they were all alike.",
        "REF_TRANSLATION": "[Muslim]"
    }
]