[
    {
        "name": "الله",
        "subItemName_1": "Allah",
        "subItemDescriptionAR": "",
        "subItemDescriptionEN": "Allah is the deity worthy of being worshiped out of love, hope, and fear. This name encompasses all the meanings of the beautiful names and attributes of the Almighty Lord.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الأحد ",
        "subItemName_1": "Al-Ahad",
        "subItemDescriptionAR": "The Sole One",
        "subItemDescriptionEN": "Allah is incomparable, unequaled, and indivisible. Al-Ahad is the One who was, is, and will ever remain alone. No one can ever be equal to Him in the essence of all His beautiful attributes.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الآخر ",
        "subItemName_1": "Al-Akhir",
        "subItemDescriptionAR": "The Infinite Last One",
        "subItemDescriptionEN": "Allah is The One whose existence will extend past the end of this universe. He will be the last, just as He is the first.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الأعلى ",
        "subItemName_1": "Al-A‘la",
        "subItemDescriptionAR": "The Most High",
        "subItemDescriptionEN": "Al-A‘la is a name that denotes the affirmation of all meanings of highness for Allah Almighty from every aspect: highness in His essence, highness in His status, and highness in His power.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الأكرم",
        "subItemName_1": "Al-Akram",
        "subItemDescriptionAR": "The Most Generous",
        "subItemDescriptionEN": "Allah is The One Who gives generously, and all goodness lies in His hand and comes from Him.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الأول",
        "subItemName_1": "Al-Awwal",
        "subItemDescriptionAR": "The Very First",
        "subItemDescriptionEN": "Allah is The One whose existence is without beginning. He is truly the first, and nothing was before Him.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "البارئ",
        "subItemName_1": "Al-Bari",
        "subItemDescriptionAR": "The Evolver \/ The Maker",
        "subItemDescriptionEN": "Allah is The one who decreed things to exist out of nothing in a specific manner. Creates shape from nothing that has no model or similarity. He manifests His creations in perfect harmony and in perfect proportions without any faults.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الباسط",
        "subItemName_1": "Al-Basit",
        "subItemDescriptionAR": "The Extender",
        "subItemDescriptionEN": "Allah is Al-Baasit, The One who amplifies all abundance. He is the one who makes the way wide open. He expands and widens the hearts and our souls and gives us sustenance in His Generosity and Mercy. He gives plentifully to whoever He wills and reaches out a helping hand to all mankind.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الباطن",
        "subItemName_1": "Al-Baatin",
        "subItemDescriptionAR": "The Imperceptible",
        "subItemDescriptionEN": "The One who is hidden or secret. Allah is unseen but His existence is known through signs. Allah immanent operating within all of creation. The one who is the secret inner companion.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "البديع",
        "subItemName_1": "Al-Badi",
        "subItemDescriptionAR": "The Unique One",
        "subItemDescriptionEN": "Allah is The One who created and formed the universe without any mold or preceding example. With His will, He invents all that exists without any prior material. His creation is made without any similarity to anything else that has ever existed.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "البصير",
        "subItemName_1": "Al-Baseer",
        "subItemDescriptionAR": "The All-Seeing",
        "subItemDescriptionEN": "Allah sees everything, even if it's insignificant, like a black ant on a black stone when it's pitch black at night. There is nothing hidden from His sight. He has knowledge of all things, both in Heaven and on Earth. He does not miss any detail. His sight encompasses all, not just the superficial. He sees what's truly within.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "البَرّ ",
        "subItemName_1": "Al-Barr",
        "subItemDescriptionAR": "The Fountain-Head of Truth",
        "subItemDescriptionEN": "Allah is The One who is the great benefactor, the most righteous, and the source of goodness. He is ample in kindness and desires good for people bestowing them with health, wealth, and happiness. He is ever merciful and compassionate. He is The One who covered them with His sustenance and specified whoever He willed among them by His support, protection, and special mercy.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "التوّاب",
        "subItemName_1": "At-Tawwab",
        "subItemDescriptionAR": "The Ever-Acceptor of Repentance",
        "subItemDescriptionEN": "Allah is The One who beckons for our return. He repeatedly turns mankind towards repentance should they journey temporarily on the wrong path. Allah is lenient and restores grace to those who repent and forgives those who seek forgiveness.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الجبار",
        "subItemName_1": "Al-Jabbar",
        "subItemDescriptionAR": "The All Compelling",
        "subItemDescriptionEN": "Allah implements His decree without any opposition. There is no one that prevails over Him.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الجليل",
        "subItemName_1": "Al-Jaleel",
        "subItemDescriptionAR": "The Majestic One",
        "subItemDescriptionEN": "Allah is The great one and above all in dignity and rank. He is majestic and the source of all attributes of greatness. To Him, all honor and sincere devotion are due.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحسيب",
        "subItemName_1": "Al-Haseeb",
        "subItemDescriptionAR": "The Reckoning One",
        "subItemDescriptionEN": "Allah is The One who takes account of all actions and reckons them on the day of judgment. There is nothing that goes unnoticed, however small. Allah is the one who will take account of everything and will hold each person accountable. He will give whatever is sufficient and necessary in every situation.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحافظ",
        "subItemName_1": "Al-Haafidh",
        "subItemDescriptionAR": "",
        "subItemDescriptionEN": "Allaah, Al-Hafeedh is the One Who guards the heavens and the earth and all what is therein. He (Ta’ala) keeps them from vanishing for as long as He decreed.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحفيظ",
        "subItemName_1": "Al-Hafiz",
        "subItemDescriptionAR": "The Guarding One",
        "subItemDescriptionEN": "Allah is The Guardian and protector of everything. He preserves all creations and remembers all that has ever been and all that is. He is the protector of The Qur'an and vowed to safeguard it from being changed or perverted, as was the case with previous scriptures.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحق",
        "subItemName_1": "Al-Haqq",
        "subItemDescriptionAR": "The Embodiment of Truth",
        "subItemDescriptionEN": "Allah is The one who is the embodiment of truth, the absolute. Since He is the sole and true God, He has every right to be worshipped. His essence is unavoidable and unchanged.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحكم",
        "subItemName_1": "Al-Hakam",
        "subItemDescriptionAR": "The Impartial Judge",
        "subItemDescriptionEN": "Allah is The Giver of Justice. His judgment, once rendered, cannot be thwarted. He always delivers justly in every situation and never makes a mistake. He is the best of judges.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحكيم",
        "subItemName_1": "Al-Hakeem",
        "subItemDescriptionAR": "The Wise One",
        "subItemDescriptionEN": "Allah is The Most judicious and the all-wise. He possesses the ability to determine right from wrong and is free from error and misunderstanding. His designs in nature and life are perfect and accurate. He is the only one qualified to judge the worth of all things.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحليم",
        "subItemName_1": "Al-Haleem",
        "subItemDescriptionAR": "The Clement One",
        "subItemDescriptionEN": "Allah is Al-Haleem (also spelt Al-Halim), the most serene, kind and gentle. He does not punish people for every sin. He tolerates and is most gracious and merciful. He is ever calm and deliberate, never acting hastily, even with the wrongdoers. He gives us the opportunity to learn and be kind.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحميد",
        "subItemName_1": "Al-Hameed",
        "subItemDescriptionAR": "The Sole-Laudable One",
        "subItemDescriptionEN": "Allah is The one worthy of praise. He qualifies as the praiseworthy one because of all His attributes and because He has given us what we have. He is the only one deserving in every manner of praise, and He should be exalted. ",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الحي",
        "subItemName_1": "Al-Hayy",
        "subItemDescriptionAR": "The Eternally Living One",
        "subItemDescriptionEN": "Allah is The One who is undying and will be forever. He is perfect and not subject to death or sickness. He is eternally whole and absolute, whom all life arises from.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الخالق",
        "subItemName_1": "Al-Khaliq",
        "subItemDescriptionAR": "The Creator",
        "subItemDescriptionEN": "Allah is The one who creates things from nothing with no precedents. He creates what He pleases and in a perfect manner. He is the only one who determines when, how, and what to create and does so from nothing.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الخبير",
        "subItemName_1": "Al-Khabir",
        "subItemDescriptionAR": "The All-Aware One",
        "subItemDescriptionEN": "Allah is Al-Khabeer. The Knower of reality, The One whose knowledge is comprehensive, knowing the qualities and meanings of all things. He knows and understands the most hidden secrets. He is All-Aware and All-Acquainted. The One who knows the truth in every situation.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الخلاّق ",
        "subItemName_1": "Al-Khallaq",
        "subItemDescriptionAR": "Absolute Creator",
        "subItemDescriptionEN": "Allah is The Creator of all and is All-Knowing.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الديّان ",
        "subItemName_1": "Ad-Dayyān",
        "subItemDescriptionAR": "The Recompenser",
        "subItemDescriptionEN": "Allah is The One Who recompenses His servants according to their deeds and holds them accountable for them.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "ذو الجلال والإكرام",
        "subItemName_1": "Dhul-Jalaali-Wal-Ikram",
        "subItemDescriptionAR": "The Possessor of Majesty and Honour",
        "subItemDescriptionEN": "Allah is The One who is glorious and majestic. He is the possessor of all glory and honor. He is The One who deserves to be Exalted and not denied.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الرؤوف ",
        "subItemName_1": "Ar-Rauf",
        "subItemDescriptionAR": "The Benign One",
        "subItemDescriptionEN": "Allah is The One who is extremely compassionate. He is The One whose mercy will endow whoever he willed among His creatures. Whatever Allah decrees is done with perfect judgment, and He is never harsh or unjust in his rulings.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الرّازق ",
        "subItemName_1": "Ar-Razzaq",
        "subItemDescriptionAR": "The Total Provider",
        "subItemDescriptionEN": "Allah is The One who creates all means of nourishment and gives them their livelihood. He is the provider of growth for all things good for the body, the soul, and the mind.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الرب",
        "subItemName_1": "Ar-Rabb",
        "subItemDescriptionAR": "The Lord",
        "subItemDescriptionEN": "Allah is the Master, the Owner, the Reformer, and the One Who fosters His servants by managing their affairs and bestowing favors upon them.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الرحمن ",
        "subItemName_1": "Ar-Rahman",
        "subItemDescriptionAR": "The Beneficent",
        "subItemDescriptionEN": "Allah is The One who blesses all His creation with prosperity and devoid from disparity. He is most merciful, kind, and loving towards all creation. His Rahma is all inclusive and embraces all.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الرحيم ",
        "subItemName_1": "Ar-Raheem",
        "subItemDescriptionAR": "The Merciful",
        "subItemDescriptionEN": "The name Ar-Raheem comes from the same root as Ar-Rahman which refers to Allah’s attribute of being Merciful. Although similarly related the meanings are different. Ar-Rahman can be understood to refer to Allah as the origination\/source of all mercy, whereas Ar-Raheem refers to its sustaining\/infiniteness.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الرزاق ",
        "subItemName_1": "Ar-Razzaq",
        "subItemDescriptionAR": "The Total Provider",
        "subItemDescriptionEN": "Allah is Ar-Razzaq The Provider, The Sustainer for all His creatures. He is The One who creates all means of nourishment and gives them their livelihood. He is the provider of growth for all things good for the body, the soul, and the mind.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الرقيب",
        "subItemName_1": "Ar-Raqib",
        "subItemDescriptionAR": "The Watchful One",
        "subItemDescriptionEN": "Allah is The one who sees what's hidden. He is the vigilant witness and acts as a guardian protecting His creation. It also relates to the attribute of knowledge. He is the one who sees the truth in everything. He knows the secrets of every soul, and on the day of recompense, Allah will reward it for what it's earned.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "السبوح",
        "subItemName_1": "As-Subbūh",
        "subItemDescriptionAR": "The All-Glorious",
        "subItemDescriptionEN": "Allah is the One far exalted above deficiencies and defects and Who is extolled and glorified by all those in the heavens and the earth.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "السلام",
        "subItemName_1": "As-Salam",
        "subItemDescriptionAR": "The Giver of Peace",
        "subItemDescriptionEN": "Allah is The One who grants peace and security to all His creation. Allah is above and beyond all weaknesses and inflictions. The source of peace and security for mankind. Breaking away from As-Salam brings disturbance and destruction to oneself. It is because He is free of any defect that the one who is with Him experiences tranquility.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "السميع ",
        "subItemName_1": "As-Sami",
        "subItemDescriptionAR": "The All-Hearer",
        "subItemDescriptionEN": "Allah is The perpetual hearer. He pays attention to every supplication, listening to all who reach out to Him. Whether we speak loudly or in secrecy, Allah  hears it all.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الشافي ",
        "subItemName_1": "Ash-Shāfi",
        "subItemDescriptionAR": "The Healer",
        "subItemDescriptionEN": "Allah is the One Who cures His servants from the illnesses of their bodies, the doubts of their hearts, and the vain desires of their selves.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الشاكر ",
        "subItemName_1": "Ash-Shākir",
        "subItemDescriptionAR": "The Appreciative",
        "subItemDescriptionEN": "Allah is The One Who praises those who obey Him and rewards them beyond what is due to them.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الشكور ",
        "subItemName_1": "Ash-Shakur",
        "subItemDescriptionAR": "The Acknowledging One",
        "subItemDescriptionEN": "Allah is The Most Grateful, the rewarder of good deeds, and is most appreciative. He notices the smallest of our acts of righteousness and rewards us for them in this life or the next. He is bountiful in giving and bestows great rewards for the smallest amount of good.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الشهيد ",
        "subItemName_1": "Ash-Shaheed",
        "subItemDescriptionAR": "The All Observing Witness",
        "subItemDescriptionEN": "Allah is The one who is omnipresent and all-observing. There is nothing that we do that goes unnoticed, as He is ever-present and sees everything. His knowledge comprehends all, and He will be the ultimate witness on the day of judgment.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الصمد ",
        "subItemName_1": "As-Samad",
        "subItemDescriptionAR": "The Supreme Provider",
        "subItemDescriptionEN": "Allah is The one whom refuge is sought in times of adversity. He is eternal, whole and complete. There is no emptiness.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الظاهر ",
        "subItemName_1": "Az-Zaahir",
        "subItemDescriptionAR": "The Perceptible",
        "subItemDescriptionEN": "Allah is The One who is evident and conspicuous. He made himself evident without being visible. The very essence and attributes are shown through all His creations.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "العزيز ",
        "subItemName_1": "Al-Aziz",
        "subItemDescriptionAR": "The Mighty One",
        "subItemDescriptionEN": "Al-Aziz is The one who is most powerful and strong. He is the conqueror that is never conquered and never harmed. This is because His strength, glory, and power are overwhelming, and cannot be overcome or resisted. He is the only one with complete mastery over all creation.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "العظيم ",
        "subItemName_1": "Al-Azeem",
        "subItemDescriptionAR": "The Magnificent One",
        "subItemDescriptionEN": "Allah is The Supreme Glory and The Greatest. His reality is too great to be fully understood under the human mind's capacity. He is infinitely greater than His creation. It is said, His throne (symbolic of His knowledge and authority) extends over the heavens and the earth, and their care burdens Him not. He is the One deserving the attributes of Exaltment, Glory, Extolement, and Purity from all imperfection.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "العفو ",
        "subItemName_1": "Al-Afuw",
        "subItemDescriptionAR": "The Supreme Pardoner",
        "subItemDescriptionEN": "Allah is The One who pardons sins and leaves no trace of any fault. The difference between forgiving and effacing is there will be no trace or record of the offense being committed. It will be as if it had never happened.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "العلي ",
        "subItemName_1": "Al-Aliyy",
        "subItemDescriptionAR": "The Sublime One",
        "subItemDescriptionEN": "The most exalted and all high. He exceeds all others, and there is nothing higher. He is the one whose rank and station are the highest. He is above all that has or will ever be.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "العليم ",
        "subItemName_1": "Al-Alim",
        "subItemDescriptionAR": "The All-Knowing One",
        "subItemDescriptionEN": "Allah is The one whose knowledge is comprehensive and extends to all that is seen and unseen, apparent and hidden, present and future, near and far. His knowledge precedes, and He is intuitively aware of all things, even before they happen. He is the knower of all details, and nothing goes unnoticed or unrecorded. Indeed, He is the Omniscient One.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الغفّار ",
        "subItemName_1": "Al-Ghaffar",
        "subItemDescriptionAR": "The Great Forgiver",
        "subItemDescriptionEN": "He sees our sins and disobedience, yet He still forgives and accepts the repentance of the sincere. He shows never-ending compassion and forgiveness, no matter how big or small the sin. He is the most forgiving and loves to forgive.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الغفور ",
        "subItemName_1": "Al-Ghafoor",
        "subItemDescriptionAR": "The All-Forgiving",
        "subItemDescriptionEN": "Allah is The One who completely forgives our sins and faults. His forgiveness is unlimited, and He is all compassionate. He is most high; His forgiveness extends to all who turn to him in humility and seek repentance.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الغني ",
        "subItemName_1": "Al-Ghanyy",
        "subItemDescriptionAR": "The Self-Sufficient",
        "subItemDescriptionEN": "Allah is The One Who is needed by all and Who does not need anyone.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الفتّاح ",
        "subItemName_1": "Al-Fattah",
        "subItemDescriptionAR": "The Opener",
        "subItemDescriptionEN": "Allah is Al-Fattah, the revealer, and the granter of success. He opens or locks His doors of mercy to whom He pleases. Through His guidance, whatever is unclear becomes clear. Allah has the best judgment and holds the keys to victory and",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القابض",
        "subItemName_1": "Al-Qabid",
        "subItemDescriptionAR": "The Restricting One",
        "subItemDescriptionEN": "Allah is Al-Qabid meaning whatever He wills comes to be. He is the one who enriches and makes poor. Al-Qabid decides to withhold something or to make it scarce. He is the taker of all souls at the time of death, and He stretches His hand out to the believers so that they may turn to him and repent. He is the one who constricts sustenance, our lives, and our hearts.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القادر ",
        "subItemName_1": "Al-Qadir",
        "subItemDescriptionAR": "The All-Powerful",
        "subItemDescriptionEN": "Allah is The most powerful with the ability to measure out everything. Whenever He decrees a thing, it is. Nothing can interrupt or disturb the will of Allah. He is the most capable without any limitations.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القاهر",
        "subItemName_1": "Al-Qāhir",
        "subItemDescriptionAR": "The Vanquisher",
        "subItemDescriptionEN": "Allah is The One to Whom all beings submit and before Whose power and will all beings stand humbly.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القدوس ",
        "subItemName_1": "Al-Quddus",
        "subItemDescriptionAR": "The Most Sacred \/ The Most Holy",
        "subItemDescriptionEN": "Allah is so far removed from any imperfection and does not suffer from any shortcomings. The mere mention of being free from defects borders on insult as it implies the possibility of imperfection. He transcends all that we perceive as perfection, and all sublime attributes belong to Him.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القدير",
        "subItemName_1": "Al-Qadīr",
        "subItemDescriptionAR": "The Omnipotent",
        "subItemDescriptionEN": "Allah is The One Who possesses complete power and does not suffer any incapability or fatigue.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القريب ",
        "subItemName_1": "Al-Qarīb",
        "subItemDescriptionAR": "The Near",
        "subItemDescriptionEN": "Allah is The One Who is near His obedient servants with reward; near those who supplicate Him with the answer; and near the rest of His servants with knowledge. This does not contradict His being high above.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القهار ",
        "subItemName_1": "Al-Qahhar",
        "subItemDescriptionAR": "The All-Prevailing One",
        "subItemDescriptionEN": "Allah is The one who prevails over all creation. The universe runs according to the laws laid down by Allah. He is dominant, the master of all, and is victorious over all opposition. He has the perfect Power and is not unable over anything.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القوي ",
        "subItemName_1": "Al-Qawiyy",
        "subItemDescriptionAR": "The Strong One",
        "subItemDescriptionEN": "Allah is The one who commands all power and whose strength is unparalleled to anything else. His strength is truly unlimited and inexhaustible. Man's strength does not compare to that of Allah the Almighty.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "القيّوم ",
        "subItemName_1": "Al-Qayyum",
        "subItemDescriptionAR": "The Self-Subsisting One",
        "subItemDescriptionEN": "Allah is Al-Qayyum, His essence\/nature is to exist being utterly free from dependence on anything or anyone. Al-Qayyum is the one through whom all things arise. He is Ever-Living and Self-Sustaining. Everything else in existence depends on Al-Qayyum.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الكافي ",
        "subItemName_1": "Al-Kāfi",
        "subItemDescriptionAR": "The All-Sufficient",
        "subItemDescriptionEN": "Allah is The One Who fulfills all the needs of His servants and Who is sufficient for them beyond need for anyone else.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الكبير ",
        "subItemName_1": "Al-Kabeer",
        "subItemDescriptionAR": "The Great One)",
        "subItemDescriptionEN": "Allah is Al-Kabeer means the perfection of greatness. The heart of the believer knows Allah is the essence of perfection and nothing is comparable to him. His greatness is beyond measure, and His being is unimaginable to the human mind.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الكريم ",
        "subItemName_1": "Al-Karim",
        "subItemDescriptionAR": "The Bountiful One",
        "subItemDescriptionEN": "Allah is The one who is the most generous, bountiful and esteemed. He is The One whose kindness knows no bounds and continually gives precious gifts to whomever He wills. He is gracious in giving and forgiving.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "اللطيف",
        "subItemName_1": "Al-Lateef",
        "subItemDescriptionAR": "The Knower of Subtleties",
        "subItemDescriptionEN": "Allah is Al-Lateef. The most gentle and gracious to people and cares for them, although they may be oblivious to his acts. His nature is kind, affectionate, and understanding of the subtle details of individual circumstances. His actions are so subtle that they can not be observable or understood. He does things for you that you will never know.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المبديء المعيد",
        "subItemName_1": "Al-Mubdi, Al-Muid",
        "subItemDescriptionAR": "The Originator, The Restorer",
        "subItemDescriptionEN": "Allah is Al-Mubdi, the originator of all creation. He is the beginner of all things, and nothing could have existed without His willing it to be. He is The One who initiates all things.\\n Allah is Al-Mu'id, He is the restorer, the one who refashions a thing. He is the One who will restore us back to life on the day of resurrection.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المقدم والمؤخر",
        "subItemName_1": "Al-Muqaddim, Al-Muakhkhir",
        "subItemDescriptionAR": "The Expediting One, The Delayer",
        "subItemDescriptionEN": "Allah is Al-Muqaddim, The One who promotes or brings forward. This includes promoting His servants to higher ranks.\\n Allah is Al-Mu'akhkhir, The One who wisely delays or holds back. By His will, he can detain unbelievers and hold them back on the day of judgment.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المؤمن ",
        "subItemName_1": "Al-Mumin",
        "subItemDescriptionAR": "The Infuser of Faith",
        "subItemDescriptionEN": "Allah is  The one who witnessed for Himself that no one is God but Him. And He is the one who sent down Messengers and revealed His books as clear proofs.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المبين ",
        "subItemName_1": "Al-Mubīn",
        "subItemDescriptionAR": "The Evident",
        "subItemDescriptionEN": "Allah is The One Who is evident in His Oneness and that He has no partner, and Who clarifies the truth to His servants.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المتعالي ",
        "subItemName_1": "Al-Mutaali",
        "subItemDescriptionAR": "The Extremely Exalted One",
        "subItemDescriptionEN": "Allah is The highest One, and exalted above all creation. He is far beyond any imagination or thought, and the human mind is too narrow to understand his true greatness.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المتكبر ",
        "subItemName_1": "Al-Mutakabbir",
        "subItemDescriptionAR": "The Dominant One",
        "subItemDescriptionEN": "Allah is Exalted far above all creation, The One who is clear from the attributes of the creatures and from resembling them. He has rights, privileges, and qualities that others do not have. He is tremendous and manifests this greatness in all things and many ways.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المتين ",
        "subItemName_1": "Al-Matin",
        "subItemDescriptionAR": "The Firm One",
        "subItemDescriptionEN": "Allah is Al-Matin means His power is steadfast. It is the same as it was yesterday and will remain tomorrow. He is ever-constant and firm.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المجيب ",
        "subItemName_1": "Al-Mujeeb",
        "subItemDescriptionAR": "The Responding One",
        "subItemDescriptionEN": "Allah is The one very close to His believers and readily available to hear and answer the supplications of those who ask. He is the responder to all needs, invitations, and prayers.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المجيد ",
        "subItemName_1": "Al-Majeed",
        "subItemDescriptionAR": "The Glorious One",
        "subItemDescriptionEN": "Allah is The one who is the most glorious, honorable, dignified, noble, and generous. It is another name that covers several attributes. He is the only one deserving all praise and honor because He is all-glorious.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المحصي ",
        "subItemName_1": "Al-Muhsi",
        "subItemDescriptionAR": "The All-Enumerating One",
        "subItemDescriptionEN": "The One who considers all things in the universe and knows the details of every moment or change. He comprehends everything and possesses all knowledge. Allah knows every deed, and written details are recorded by His angels.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المحيط ",
        "subItemName_1": "Al-Muhīt",
        "subItemDescriptionAR": "The All-Encompassing",
        "subItemDescriptionEN": "Al-Muhīt is a name that denotes the exaltedness of Allah above His creation and that He encompasses everything in terms of knowledge, power, and subjugation.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المصوِّر ",
        "subItemName_1": "Al-Musawwir",
        "subItemDescriptionAR": "The Flawless Shaper",
        "subItemDescriptionEN": "Allah brings into existence whatever He wills and in whatever manner He wills it. He says, kun faya kun, “Be! and it is\". He is the fashioner of every creation and has given it a special form whereby it is distinguished.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المعطي ",
        "subItemName_1": "Al-Mu‘ti",
        "subItemDescriptionAR": "The Giver",
        "subItemDescriptionEN": "Allah is The only One Who gives, and no one can withhold what He has given or give what He has withheld.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المقتدر ",
        "subItemName_1": "Al-Muqtadir",
        "subItemDescriptionAR": "The All Authoritative One",
        "subItemDescriptionEN": "Allah is Al-Muqtadir, the all-powerful who delivers a suitable measure of all things. He has absolute strength, power, and mastery. Nothing is beyond his power.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المقيت ",
        "subItemName_1": "Al-Muqeet",
        "subItemDescriptionAR": "The Sustaining One",
        "subItemDescriptionEN": "Allah gives strength and nourishment to His creations and maintains all that exists. He oversees, guards, and preserves all. To Allah  we owe the satisfaction of all needs, but He is alone and independent of needs.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المَلِك ",
        "subItemName_1": "Al-Malik",
        "subItemDescriptionAR": "The King",
        "subItemDescriptionEN": "Allah is The one who reigns dominion over the heavens and the earth and everything that resides within them. There is nothing above Him, and He is alone.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المنّان ",
        "subItemName_1": "Al-Mannān",
        "subItemDescriptionAR": "The Bestower of Favors",
        "subItemDescriptionEN": "Allah  is the One Who bestows great favors and gives blessings to His servants before they ask for them.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المهيمن ",
        "subItemName_1": "Al-Muhaymin",
        "subItemDescriptionAR": "The Guardian",
        "subItemDescriptionEN": "Allah is Al Muhaymin, meaning the one who ensures well being and protection over His creation. He is also the ever watchful. Nothing that can be hidden from Him, He is the knower of all the secrets we conceal.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "المولى ",
        "subItemName_1": "Al-Mawla",
        "subItemDescriptionAR": "The Protector",
        "subItemDescriptionEN": "(The Protector) of all creation is their Master, Owner, Creator, and True Deity worthy of worship; and Al-Mawla of the believing servants is the One Who loves them, guides and supports them, and leads them to their religious and worldly interests.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "النصير ",
        "subItemName_1": "An-Nasīr",
        "subItemDescriptionAR": "The Helper",
        "subItemDescriptionEN": "Allah is the One Who helps and supports His believing servants.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الهادي",
        "subItemName_1": "AL-HAADI",
        "subItemDescriptionAR": "The Guide",
        "subItemDescriptionEN": "Allah is the One Who guides His servants to all beneficial things and leads them away from harmful ones, and Who leads whomever He wills to guidance.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الواحد ",
        "subItemName_1": "Al-Wahid",
        "subItemDescriptionAR": "The Only One",
        "subItemDescriptionEN": "The One and only God. There is no alternative. He is the sole originator from which all has arisen. He has no partners or relationships. None is equal to Him.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الوارث ",
        "subItemName_1": "Al-Warith",
        "subItemDescriptionAR": "The Eternal Inheritor",
        "subItemDescriptionEN": "The One who remains after all has past. He is everlasting, and to whom all possessions will be returned.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الواسع",
        "subItemName_1": "Al-Wasi",
        "subItemDescriptionAR": "The All-Pervading One",
        "subItemDescriptionEN": "Allah is The one who’s knowledge, mercy, and provision are vast. He is of limitless capacity and abundance and gives without expecting anything in return. Allah embraces all things and His wisdom and mercy are boundless.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الودود ",
        "subItemName_1": "Al-Wadud",
        "subItemDescriptionAR": "The Loving One",
        "subItemDescriptionEN": "Allah is The most loving and affectionate. He is faithful to his servants and shows them the purest love. He is the singular source of all love and kindness. The One who loves His believing servants, and His believing servants adore Him.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الوكيل",
        "subItemName_1": "Al-Wakeel",
        "subItemDescriptionAR": "The Universal Trustee",
        "subItemDescriptionEN": "Allah is The one and only who can be trusted with all our affairs. He is the supreme trustee, guardian, and administrator. A believer understands the rewards of his efforts come from Allah, and therefore He entrusts his faith fully in Him.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الولي",
        "subItemName_1": "Al-Waliy",
        "subItemDescriptionAR": "The Protecting Associate",
        "subItemDescriptionEN": "Allah is The true protector. He is supportive and loves His servants, protecting them from evil. Allah   wants victory for us and will guide mankind towards the path of righteousness.",
        "SuraName": null,
        "AyaNumber": null
    },
    {
        "name": "الوهاب ",
        "subItemName_1": "Al-Wahhab",
        "subItemDescriptionAR": "The Supreme Bestower",
        "subItemDescriptionEN": "Allah is The great giver whose blessings are freely and perpetually given. He gives with no purpose and expects nothing in return. Allah is truly the most liberal giver, He gives to the deserving and undeserving, to the good and the evil.",
        "SuraName": null,
        "AyaNumber": null
    }
]