const items = [
    {
        name: "أذكار الاستيقاظ من النوم",
        subItems: [
            {
                name: "أذكار الاستيقاظ من النوم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "الْحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ",
                subItemDescription: "البخاري مع الفتح 11/ 113 ومسلم 4/ 2083",
            },
            {
                name: "أذكار الاستيقاظ من النوم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفرْ لِي",
                subItemDescription: "الترمذي 5/ 473 وانظر صحيح الترمذي3/144",
            },
            {
                name: "أذكار الاستيقاظ من النوم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لي بِذِكْرِهِ",
                subItemDescription:
                    "رواه البخاري مع الفتح 3/ 144 وغيرها واللفظ لابن ماجه انظر صحيح ابن ماجه 2/ 335",
            },
            {
                name: "أذكار الاستيقاظ من النوم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ لَأٓيَٰتٖ لِّأُوْلِي ٱلۡأَلۡبَٰبِ ﴿١٩٠﴾ ٱلَّذِينَ يَذۡكُرُونَ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِهِمۡ وَيَتَفَكَّرُونَ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ رَبَّنَا مَا خَلَقۡتَ هَٰذَا بَٰطِلٗا سُبۡحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ ﴿١٩١﴾ رَبَّنَآ إِنَّكَ مَن تُدۡخِلِ ٱلنَّارَ فَقَدۡ أَخۡزَيۡتَهُۥۖ وَمَا لِلظَّٰلِمِينَ مِنۡ أَنصَارٖ ﴿١٩٢﴾ رَّبَّنَآ إِنَّنَا سَمِعۡنَا مُنَادِيٗا يُنَادِي لِلۡإِيمَٰنِ أَنۡ ءَامِنُواْ بِرَبِّكُمۡ فَـَٔامَنَّاۚ رَبَّنَا فَٱغۡفِرۡ لَنَا ذُنُوبَنَا وَكَفِّرۡ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلۡأَبۡرَارِ ﴿١٩٣﴾ رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخۡزِنَا يَوۡمَ ٱلۡقِيَٰمَةِۖ إِنَّكَ لَا تُخۡلِفُ ٱلۡمِيعَادَ ﴿١٩٤﴾ فَٱسۡتَجَابَ لَهُمۡ رَبُّهُمۡ أَنِّي لَآ أُضِيعُ عَمَلَ عَٰمِلٖ مِّنكُم مِّن ذَكَرٍ أَوۡ أُنثَىٰۖ بَعۡضُكُم مِّنۢ بَعۡضٖۖ فَٱلَّذِينَ هَاجَرُواْ وَأُخۡرِجُواْ مِن دِيَٰرِهِمۡ وَأُوذُواْ فِي سَبِيلِي وَقَٰتَلُواْ وَقُتِلُواْ لَأُكَفِّرَنَّ عَنۡهُمۡ سَيِّـَٔاتِهِمۡ وَلَأُدۡخِلَنَّهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ ثَوَابٗا مِّنۡ عِندِ ٱللَّهِۚ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلثَّوَابِ ﴿١٩٥﴾ لَا يَغُرَّنَّكَ تَقَلُّبُ ٱلَّذِينَ كَفَرُواْ فِي ٱلۡبِلَٰدِ ﴿١٩٦﴾ مَتَٰعٞ قَلِيلٞ ثُمَّ مَأۡوَىٰهُمۡ جَهَنَّمُۖ وَبِئۡسَ ٱلۡمِهَادُ ﴿١٩٧﴾ لَٰكِنِ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ لَهُمۡ جَنَّٰتٞ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَا نُزُلٗا مِّنۡ عِندِ ٱللَّهِۗ وَمَا عِندَ ٱللَّهِ خَيۡرٞ لِّلۡأَبۡرَارِ ﴿١٩٨﴾ وَإِنَّ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ لَمَن يُؤۡمِنُ بِٱللَّهِ وَمَآ أُنزِلَ إِلَيۡكُمۡ وَمَآ أُنزِلَ إِلَيۡهِمۡ خَٰشِعِينَ لِلَّهِ لَا يَشۡتَرُونَ بِـَٔايَٰتِ ٱللَّهِ ثَمَنٗا قَلِيلًاۚ أُوْلَٰٓئِكَ لَهُمۡ أَجۡرُهُمۡ عِندَ رَبِّهِمۡۗ إِنَّ ٱللَّهَ سَرِيعُ ٱلۡحِسَابِ ﴿١٩٩﴾ يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱصۡبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ ﴿٢٠٠﴾",
                subItemDescription:
                    "الآيات من سورة آل عمران ،190 - 200 ، البخاري مع الفتح 8/ 238 ومسلم 1/ 530",
            },
        ],
    },
    {
        name: "دعاء لبس الثوب",
        subItems: [
            {
                name: "دعاء لبس الثوب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "الْحَمْدُ للَّهِ الَّذِي كَسَانِي هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّة",
                subItemDescription:
                    "أخرجه أهل السنن إلا النسائي انظر إرواء الغليل 7/ 47",
            },
        ],
    },
    {
        name: "دعاء لبس الثوب الجديد",
        subItems: [
            {
                name: "دعاء لبس الثوب الجديد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
                subItemDescription:
                    "أبو داود والترمذي والبغوي وانظر مختصر شمائل الترمذي للألباني ص 47",
            },
        ],
    },
    {
        name: "الدعاء لمن لبس ثوباً جديداً",
        subItems: [
            {
                name: "الدعاء لمن لبس ثوباً جديداً",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "تُبْلِي وَيُخْلِفُ اللَّهُ تَعَالَى",
                subItemDescription: "أخرجه أبو داود 4/ 41 ، وانظر صحيح أبي داود2/ 760",
            },
            {
                name: "الدعاء لمن لبس ثوباً جديداً",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "اِلْبَسْ جَدِيداً وَعِشْ حَمِيداً وَمُتْ شَهِيداً",
                subItemDescription:
                    "ابن ماجه 2/ 1178 والبغوي 12/ 41 وانظر صحيح ابن ماجة2/ 275",
            },
        ],
    },
    {
        name: "ما يقول إذا وضع الثوب",
        subItems: [
            {
                name: "ما يقول إذا وضع الثوب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "بِسْمِ اللَّهِ",
                subItemDescription:
                    "الترمذي 2/505 وغيره وانظر الإرواء برقم 49 صحيح الجامع3/ 203",
            },
        ],
    },
    {
        name: "دعاء دخول الخلاء",
        subItems: [
            {
                name: "دعاء دخول الخلاء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "[بِسْمِ اللَّهِ] اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبائِث",
                subItemDescription:
                    "أخرجه البخاري 1/ 45ومسلم1/283وزيادة بسم الله في أوله متفق عليه، أخرجها سعيد بن منصور أنظر فتح الباري 1/244",
            },
        ],
    },
    {
        name: "دعاء الخروج من الخلاء ",
        subItems: [
            {
                name: "دعاء الخروج من الخلاء ",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "غُفْرَانَكَ",
                subItemDescription:
                    "أخرجه أصحاب السنن إلا النسائي أخرجه في عمل اليوم والليلة انظر تخريج زاد المعاد 2/ 387",
            },
        ],
    },
    {
        name: "الذكر قبل الوضوء",
        subItems: [
            {
                name: "الذكر قبل الوضوء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "بِسْمِ اللَّهِ",
                subItemDescription:
                    "أبو داود وابن ماجه وأحمد وانظر إرواء الغليل 1/ 122",
            },
        ],
    },
    {
        name: "الذكر بعد الفراغ من الوضوء",
        subItems: [
            {
                name: "الذكر بعد الفراغ من الوضوء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
                subItemDescription: "رواه مسلم1/ 209",
            },
            {
                name: "الذكر بعد الفراغ من الوضوء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
                subItemDescription: "الترمذي 1/ 78 وانظر صحيح الترمذي1/ 18",
            },
            {
                name: "الذكر بعد الفراغ من الوضوء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ",
                subItemDescription:
                    "النسائي في عمل اليوم والليلة ص173 وانظر إرواء الغليل 1/ 135 و2/ 94",
            },
        ],
    },
    {
        name: "الذكر عند الخروج من المنزل",
        subItems: [
            {
                name: "الذكر عند الخروج من المنزل",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَاَ حَوْلَ وَلَا قُوَّةَ إِلاَّ بِاللَّهِ",
                subItemDescription:
                    "أبو داود 4/ 325 والترمذي 5/ 490 وانظر صحيح الترمذي3/ 151",
            },
            {
                name: "الذكر عند الخروج من المنزل",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضَلَّ، أَوْ أَزِلَّ، أَوْ أُزَلَّ، أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
                subItemDescription:
                    "أهل السنن وانظر صحيح الترمذي 3/ 152 وصحيح ابن ماجه 2/ 336",
            },
        ],
    },
    {
        name: "الذكر عند دخول المنزل",
        subItems: [
            {
                name: "الذكر عند دخول المنزل",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا، ثُمَّ لِيُسَلِّمْ عَلَى أَهْلِهِ",
                subItemDescription:
                    'أخرجه أبو داود 4/ 325 ، وحسن إسناده العلامة ابن باز في تحفة الأخيار ص28 ، وفي الصحيح " إذا دخل الرجل بيته فذكر بيته فذكر الله عند دخوله وعند طعامه قال الشيطان لا مبيت لكم ولا عشاء " مسلم برقم 2018',
            },
        ],
    },
    {
        name: "دعاء الذهاب إلى المسجد",
        subItems: [
            {
                name: "دعاء الذهاب إلى المسجد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوراً، وَفِي لِسَانِي نُوراً، وَفِي سَمْعِي نُوراً، وَفِي بَصَرِي نُوراً، وَمِنْ فَوْقِي نُوراً، وَمِنْ تَحْتِي نُوراً، وَعَنْ يَمِينِي نُوراً، وَعَنْ شِمَالِي نُوراً، وَمِنْ أَمَامِي نُوراً، وَمِنْ خَلْفِي نُوراً، وَاجْعَلْ فِي نَفْسِي نُوراً، وَأَعْظِمْ لِي نُوراً، وَعَظِّم لِي نُوراً، وَاجْعَلْ لِي نُوراً، وَاجْعَلْنِي نُوراً، اللَّهُمَّ أَعْطِنِي نُوراً، وَاجْعَلْ فِي عَصَبِي نُوراً، وَفِي لَحْمِي نُوراً، وَفِي دَمِي نُوراً، وَفِي شَعْرِي نُوراً، وَفِي بَشَرِي نُوراً[1][اللَّهُمَّ اجْعَلْ لِي نُوراً فِي قَبْرِي... وَنُوراً فِي عِظَامِي][2]، [وَزِدْنِي نُوراً، وَزِدْنِي نُوراً، وَزِدْنِي نُوراً][3]، [وَهَبْ لِي نُوراً عَلَى نُورٍ][4]",
                subItemDescription:
                    "جميع هذه الخصال في البخاري 11/ 116 برقم 6316 ومسلم 1/ 526، 529 ، 530 برقم 763[1]\nالترمذي برقم 3419، 5/483[2]\nأخرجه البخاري في الأدب المفرد برقم 695 ، ص 258 وصحح إسناده الألباني في صحيح الأدب المفرد برقم 536[3]\nذكره ابن حجر في فتح الباري وعزاه إلى ابن أبي عاصم في كتاب الدعاء،انظر الفتح11/118وقال:فاجتمع من اختلاف الروايات خمس وعشرون خصلة[4]",
            },
        ],
    },
    {
        name: "دعاء دخول المسجد",
        subItems: [
            {
                name: "دعاء دخول المسجد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "يَبْدَأُ بِرِجْلِهِ الْيُمْنَى",
                subItemDescription: "",
            },
            {
                name: "دعاء دخول المسجد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أعُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ[1]، [بِسْمِ اللَّهِ، وَالصَّلَاةُ][2] [وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ][3] ، اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ[4]",
                subItemDescription:
                    'أبو داود وانظر صحيح الجامع برقم 4591[1]\nرواه ابن السني برقم 88 وحسنه الألبان[2]ي\nأبو داود 1/ 126 وانظر صحيح الجامع 1/ 528[3]\nرواه مسلم1/ 494. وفي سنن ابن ماجه من حديث فاطمة رضي الله عنها " اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك " وصححه الألباني لشواهده انظر صحيح ابن ماجه 1/ 128 و129[4]',
            },
        ],
    },
    {
        name: "دعاء الخروج من المسجد",
        subItems: [
            {
                name: "دعاء الخروج من المسجد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "يَبْدَأُ بِرِجْلِهِ الْيُسْرَى",
                subItemDescription: "",
            },
            {
                name: "دعاء الخروج من المسجد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ",
                subItemDescription:
                    "انظر تخريج روايات الحديث السابق رقم 20 وزيادة (( اللهم اعصمني من الشيطان الرجيم )) لابن ماجه . انظر صحيح ابن ماجه 1/ 288",
            },
        ],
    },
    {
        name: "أذكار الآذان",
        subItems: [
            {
                name: "أذكار الآذان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إِلاَّ فِي حَيَّ عَلَى الصَّلَاةِ وَحَيَّ عَلَى الْفَلَاحِ فَيقُولُ: لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّه",
                subItemDescription: "البخاري 1/ 152 ومسلم 1/ 288",
            },
            {
                name: "أذكار الآذان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَأَنَا أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيتُ بِاللَّهِ رَبَّاً، وَبِمُحَمَّدٍ رَسُولاً، وَبِالْإِسْلاَمِ دِينَاً",
                subItemDescription:
                    "يَقُولُ ذَلِكَ عَقِبَ تَشَهُّدِ الْمُؤَذِّنِ ابن خزيمة 1/ 220\n مسلم 1/290",
            },
            {
                name: "أذكار الآذان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "يُصَلِّي عَلَى النَّبِيِّ ﷺ بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ الْمُؤَذِّنِ",
                subItemDescription: "مسلم 1/ 288",
            },
            {
                name: "أذكار الآذان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلاَةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامَاً مَحمُوداً الَّذِي وَعَدْتَهُ، إِنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
                subItemDescription:
                    "البخاري 1/ 152 وما بين المعكوفين للبيهقي 1/ 410 وحسن إسناده العلامة عبد العزيز بن باز في تحفة الأخيار ص 38",
            },
            {
                name: "أذكار الآذان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "يَدْعُو لِنَفسِهِ بَيْنَ الْأَذَانِ وَالْإِقَامَةِ فَإِنَّ الدُّعَاءَ حِينَئِذٍ لاَ يُرَدُّ",
                subItemDescription: "الترمذي وأبو داود وأحمد وانظر إرواء الغليل 1/ 262",
            },
        ],
    },
    {
        name: "دعاء الاستفتاح",
        subItems: [
            {
                name: "دعاء الاستفتاح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْني مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْماءِ وَالْبَرَدِ",
                subItemDescription: "البخاري 1/ 181 ومسلم 1/ 419",
            },
            {
                name: "دعاء الاستفتاح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ",
                subItemDescription:
                    "أخرجه أصحاب السنن الأربعة وانظر صحيح الترمذي 1/77 وصحيح ابن ماجه 1/ 135",
            },
            {
                name: "دعاء الاستفتاح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفَاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاَتِي، وَنُسُكِي، وَمَحْيَايَ، وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ المَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبي جَمِيعَاً إِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ. وَاهْدِنِي لِأَحْسَنِ الأَخْلاقِ لاَ يَهْدِي لِأَحْسَنِها إِلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالخَيْرُ كُلُّهُ بِيَـــــــدَيْكَ، وَالشَّـــــرُّ لَيْسَ إِلَيْــــــكَ، أَنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتوبُ إِلَيْكَ",
                subItemDescription: "رواه مسلم1/ 534",
            },
            {
                name: "دعاء الاستفتاح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ رَبَّ جِبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيلَ، فَاطِرَ السَّمَوَاتِ وَالأَرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ. اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقي",
                subItemDescription: "رواه مسلم1/ 534",
            },
            {
                name: "دعاء الاستفتاح",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName:
                    "اللَّهُ أَكْبَرُ كَبِيرَاً، اللَّهُ أَكْبَرُ كَبِيراً، اللَّهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَالْحَمْدُ لِلَّهِ كَثيراً، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً",
                subItemDescription:
                    "أخرجه أبو داود 1/ 203 وابن ماجه 1/ 265 وأحمد 4/85 وأخرجه مسلم عن ابن عمر رضي الله عنهماا بنحوه وفيه قصة 1/ 420",
            },
            {
                name: "دعاء الاستفتاح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ",
                subItemDescription:
                    "أخرجه أبو داود 1/ 203 وابن ماجه 1/ 265 وأحمد 4/85 وأخرجه مسلم عن ابن عمر رضي الله عنهماا بنحوه وفيه قصة 1/ 420",
            },
            {
                name: "دعاء الاستفتاح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لَكَ الْحَمْدُ، أَنْتَ نُورُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ قَيِّمُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ رَبُّ السَّمَواتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَالأَرْضِ وَمَنْ فِيهِنَّ، وَلَكَ الْحَمْدُ أَنْتَ مَلِكُ السَّمَوَاتِ وَالأَرْضِ، وَلَكَ الْحَمْدُ، أَنْتَ الْحَقُّ، وَوَعْدُكَ الْحَقُّ، وَقَوْلُكَ الْحَقُّ، وَلِقاؤُكَ الْحَقُّ، وَالْجَنَّةُ حَقٌّ، وَالنَّارُ حَقٌّ، وَالنَّبِيُّونَ حَقٌّ، وَمحَمَّدٌ ﷺ حَقٌّ، وَالسّاعَةُ حَقٌّ، اللَّهُمَّ لَكَ أَسْلَمتُ، وَعَلَيْكَ تَوَكَّلْتُ، وَبِكَ آمَنْتُ، وَإِلَيْكَ أَنَبْتُ، وَبِكَ خاصَمْتُ، وَإِلَيْكَ حاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ المُقَدِّمُ، وَأَنْتَ المُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ إِلَهِي لاَ إِلَهَ إِلاَّ أَنْتَ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
                subItemDescription:
                    "البخاري مع الفتح 3/3 و11/116 و 13/ 371 423، 465 ومسلم مختصراً بنحوه 1/ 532",
            },
        ],
    },
    {
        name: "دعاء الركوع",
        subItems: [
            {
                name: "دعاء الركوع",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "سُبْحانَ رَبِّيَ الْعَظِيمِ",
                subItemDescription: "أخرجه أهل السنن وأحمد وانظر صحيح الترمذي 1/83",
            },
            {
                name: "دعاء الركوع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي",
                subItemDescription: "البخاري 1/199ومسلم 1/ 350",
            },
            {
                name: "دعاء الركوع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلاَئِكَةِ وَالرُّوحِ",
                subItemDescription: "مسلم1/ 353 وأبو داود 1/230",
            },
            {
                name: "دعاء الركوع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي، وَبَصَرِي، وَمُخِّي، وَعَــــظْمِي، وَعَصَبِي، وَمَا استَقَلَّتْ بِهِ قَدَمِي",
                subItemDescription: "مسلم 1/534والأربعة إلا ابن ماجه",
            },
            {
                name: "دعاء الركوع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ",
                subItemDescription: "أبو داود 1/ 230 والنسائي وأحمد وإسناده حسن",
            },
        ],
    },
    {
        name: "دعاء الرفع من الركوع",
        subItems: [
            {
                name: "دعاء الرفع من الركوع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ",
                subItemDescription: "البخاري مع الفتح 2/ 282",
            },
            {
                name: "دعاء الرفع من الركوع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "رَبَّنَا وَلَكَ الْحَمْدُ، حَمْداً كَثيراً طَيِّباً مُبارَكاً فِيهِ",
                subItemDescription: "البخاري مع الفتح 2/ 282",
            },
            {
                name: "دعاء الرفع من الركوع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ، وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيءٍ بَعْدُ. أَهلَ الثَّناءِ وَالْمَجْدِ، أَحَقُّ مَا قَالَ الْعَبْدُ، وَكُلُّنَا لَكَ عَبْدٌ. اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الجَدِّ مِنْكَ الجَدُّ",
                subItemDescription: "مسلم 1/ 346",
            },
        ],
    },
    {
        name: "دعاء السجود",
        subItems: [
            {
                name: "دعاء السجود",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "سُبْحَانَ رَبِّيَ الأَعْلَى",
                subItemDescription: "أخرجه أهل السنن وأحمد وانظر صحيح الترمذي 1/83",
            },
            {
                name: "دعاء السجود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ، اللَّهُمَّ اغْفِرْ لِي",
                subItemDescription: "البخاري ومسلم وتقدم تخريجه برقم 34",
            },
            {
                name: "دعاء السجود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "سُبوحٌ، قُدُّوسٌ، رَبُّ الْمَلَائِكَةِ وَالرُّوحِ",
                subItemDescription: "مسلم 1/ 533وتقدم برقم 35",
            },
            {
                name: "دعاء السجود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لَكَ سَجَدْتُ وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسنُ الْخَالِقينَ",
                subItemDescription: "مسلم1/ 534 وغيره",
            },
            {
                name: "دعاء السجود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ",
                subItemDescription:
                    "أبو داود 1/ 230 والنسائي وأحمد وإسناده وصححه الألباني في صحيح أبي داود 166",
            },
            {
                name: "دعاء السجود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ: دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَّتَهُ وَسِرَّهُ",
                subItemDescription: "مسلم1/ 350",
            },
            {
                name: "دعاء السجود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                subItemDescription: "مسلم1/ 352",
            },
        ],
    },
    {
        name: "دعاء الجلسة بين السجدتين",
        subItems: [
            {
                name: "دعاء الجلسة بين السجدتين",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
                subItemDescription: "أبو داود 1/ 231وانظر صحيح ابن ماجة1/ 148",
            },
            {
                name: "دعاء الجلسة بين السجدتين",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
                subItemDescription:
                    "أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 1/90 وصحيح ابن ماجه 1/ 148",
            },
        ],
    },
    {
        name: "دعاء سجود التلاوة",
        subItems: [
            {
                name: "دعاء سجود التلاوة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سَجَدَ وَجْهِيَ لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ بِحَوْلِهِ وَقُوَّتِهِ، ﴿فَتَبارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ﴾",
                subItemDescription:
                    "الترمذي 2/474 وأحمد 6/30 والحاكم وصححه ووافقه الذهبي 1/ 220 والزيادة ل",
            },
            {
                name: "دعاء سجود التلاوة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
                subItemDescription: "الترمذي 2/473 والحاكم وصححه ووافقه الذهبي 1/ 219",
            },
        ],
    },
    {
        name: "التشهد",
        subItems: [
            {
                name: "التشهد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَواتُ، وَالطَّيِّباتُ، السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ. أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسولُهُ",
                subItemDescription: "البخاري مع الفتح 1/13 ومسلم 1/ 301",
            },
        ],
    },
    {
        name: "الصلاة على النبي بعد التشهد",
        subItems: [
            {
                name: "الصلاة على النبي بعد التشهد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ، وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيتَ عَلَى إِبْرَاهِيمَ، وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
                subItemDescription: "البخاري مع الفتح 6/ 408",
            },
            {
                name: "الصلاة على النبي بعد التشهد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ، كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ. وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْواجِهِ وَذُرِّيَّتِهِ، كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ. إِنَّكَ حَمِيدٌ مَجِيدٌ",
                subItemDescription: "البخاري مع الفتح 6/ 407ومسلم 1/ 306 واللفظ له",
            },
        ],
    },
    {
        name: "الدعاء بعد التشهد الأخير وقبل السلام",
        subItems: [
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُــمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
                subItemDescription: "البخاري 2/ 102 ومسلم 1/ 412 واللفظ لمسلم",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
                subItemDescription: "البخاري 1/ 202 ومسلم 1/ 412",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفورُ الرَّحيمُ",
                subItemDescription: "البخاري 8/168 ومسلم 4/ 2078",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ",
                subItemDescription: "مسلم 1/ 534",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبادَتِكَ",
                subItemDescription:
                    "أبو داود 2/ 86والنسائي 3/ 53 وصححه الألباني في صحيح أبو داود 1/ 284",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ",
                subItemDescription: "البخاري 6/35",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
                subItemDescription: "أبو داود وانظر صحيح ابن ماجه 2/ 328",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأَسْــــأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِي غَيرِ ضَرَّاءَ مُضِرَّةٍ، وَلاَ فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
                subItemDescription:
                    "النسائي 4/54،55وأحمد 4/364 وصححه الألباني في صحيح النسائي 1/ 281",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يولَدْ، وَلَمْ يَكنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِّيمُ",
                subItemDescription:
                    "أخرجه النسائي بلفظه 3/52وأحمد 4/338 وصححه الألباني في صحيح النسائي 1/ 280",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلاَلِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ",
                subItemDescription: "رواه أهل السنن وانظر صحيح ابن ماجه 2/ 329",
            },
            {
                name: "الدعاء بعد التشهد الأخير وقبل السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لاَ إِلَهَ إِلاَّ أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
                subItemDescription:
                    "أبو داود2/62والترمذي 5/ 515 وابن ماجه 2/ 1267 وأحمد 5/360 وانظر صحيح ابن ماجه 2/ 329 وصحيح الترمذي 3/ 163",
            },
        ],
    },
    {
        name: "الأذكار بعد الصلاة",
        subItems: [
            {
                name: "الأذكار بعد الصلاة",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "أَسْتَغْفِرُ اللَّهَ",
                subItemDescription: "مسلم1/ 414",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ أَنْتَ السَّلاَمُ، وَمِنْكَ السَّلاَمُ، تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالْإِكْرَامِ",
                subItemDescription: "مسلم1/ 414",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
                subItemDescription: "البخاري 1 /255 ومسلم 1 / 414",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
                subItemDescription: "البخاري 1 /255 ومسلم 1 / 415",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، لاَ إِلَهَ إِلاَّ اللَّهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ, لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الكَافِرُونَ",
                subItemDescription: "مسلم 1/ 415",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "33 مرة",
                count: 33,
                subItemName: "سُبْحَانَ اللَّهِ",
                subItemDescription:
                    "مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "33 مرة",
                count: 33,
                subItemName: "وَالْحَمْدُ لِلَّهِ",
                subItemDescription:
                    "مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "33 مرة",
                count: 33,
                subItemName: "وَاللَّهُ أَكْبَرُ",
                subItemDescription:
                    "مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                subItemDescription:
                    "مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName:
                    "بسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ* اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾\nبسم الله الرحمن الرحيم\n﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾ ",
                subItemDescription:
                    "وبعد صلاة المغرب والفجر ثلاث مرات\nأبو داود2 /86 والنسائي 3/ 68 وانظر صحيح الترمذي 2/8 والسور الثلاث يقال لها المعوذات وانظر فتح الباري 9 / 62",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                subItemDescription:
                    "من قرأها دبر كل صلاة لم يمنعه من دخول الجنة إلا أن يموت . والنسائي في عمل اليوم والليلة برقم 100 ، وابن السني برقم 121 وصححه الجامع 5/339 وسلسلة الأحاديث الصحيحة 2/697 برقم 972",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "عشر مرات",
                count: 10,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                subItemDescription:
                    " عَشْرَ مَرّاتٍ بَعْدَ صَلاةِ الْمَغْرِبِ وَالصُّبْحِ\nرواه الترمذي 5/515 وأحمد 4/ 227 وانظر تخريجه في زاد المعاد 1/300",
            },
            {
                name: "الأذكار بعد الصلاة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
                subItemDescription:
                    "بَعْدَ السّلامِ مِنْ صَلاَةِ الفَجْرِ\nابن ماجه وغيره وانظر صحيح ابن ماجة1/ 152 ومجمع الزوائد 10/111",
            },
        ],
    },
    {
        name: "دعاء صلاة الاستخارة",
        subItems: [
            {
                name: "دعاء صلاة الاستخارة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "قَالَ جَابرُ بْنُ عَبْدِ اللَّهِ رَضِيَ اللَّهُ عَنْهُمَا: كَانَ رسُولُ اللَّهِ ﷺ يُعَلِّمُنَا الْاسْتِخَارَةَ فِي الْأُمُورِ كُلِّهَا كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ، يَقُولُ: (إِذَا هَمَّ أَحَدُكُمْ بِالْأَمْرِ فَلْيَرْكَعْ رَكْعَتَيْنِ مِنْ غَيْرِ الْفَرِيضَةِ، ثُمَّ لْيَقُلْ: اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ العَظِيمِ؛ فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ، وَتَعْلَمُ وَلاَ أَعْلَمُ، وَأَنْتَ عَلاَّمُ الغُيُوبِ، اللَّهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ - وَيُسَمِّي حَاجَتَهُ - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الْأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أَوْ قَالَ: عَاجِلِهِ وَآجِلِهِ – فَاصْرِفْهُ عَنِّي وَاصْرِفْنِي عَنْهُ وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ)[1]\n\وَمَا نَدِمَ مَنِ اسْتَخَارَ الْخَالِقَ، وَشَاوَرَ الْمَخْلُوقِينَ الْمُؤْمِنِينَ وَتَثَبَّتَ فِي أَمْرِهِ، فَقَدْ قَالَ اللَّه تعالى: ﴿وَشاوِرْهُمْ فِي الْأَمْرِ فَإِذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللَّهِ﴾[2]",
                subItemDescription: "البخاري7/ 162[1]\nسورة آل عمران ، آية : 159[2]",
            },
        ],
    },
    {
        name: "أذكار الصباح",
        description: "البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.",
        title: "الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.",
        subItems: [
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ\n ﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾",
            subItemDescription: "سورة البقرة ، آية 255 ",
          },
          {
            name: "أذكار الصباح",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "بسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾. \nبسم الله الرحمن الرحيم \n ﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾",
            subItemDescription:
              "من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء . أبو داود 4/ 322 والترمذي 5/ 567وانظر صحيح الترمذي 3/ 182",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
            subItemDescription: "مسلم 4/ 2088",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا ، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ",
            subItemDescription: "الترمذي 5/ 466 وانظر صحيح الترمذي 3/ 142",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ",
            subItemDescription:
              "من قالها موقناً بها حين يمسي فمات من ليلته دخل الجنة ، وكذلك إذا أصبح أخرجه البخاري 7/150",
          },
          {
            name: "أذكار الصباح",
            repTime: "أربع مرات",
            count: 4,
            subItemName:
              "اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
            subItemDescription:
              "من قالها حين يصبح وحين يمسي أربع مرات أعتقه الله من النار . أخرجه أبو داود 4/ 317 والبخاري في الأدب المفرد برقم 1201 والنسائي في عمل اليوم والليلة برقم 9، وابن السني برقم 70 وحسن سماحة الشيخ ابن باز إسناد النسائي وأبي داود في تحفة الأخيار ص 23",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
            subItemDescription:
              "من قالها حين يصبح فقد أدي شكر يومه ، ومن قالها حين يمسى فقد أدى شكر ليلته . أخرجه أبو داود 4/318 ، والنسائي في عمل اليوم والليلة برقم 7وابن السني برقم 41 وابن حبان (( موارد)) رقم 2361وحسن ابن باز إسناده في تحفة الأخيار ص24",
          },
          {
            name: "أذكار الصباح",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
            subItemDescription:
              "أبو داود 4/ 324، وأحمد 5/ 42 والنسائي في عمل اليوم والليلة برقم 22وابن السني برقم 69والبخاري في الأدب المفرد وحسن العلامة ابن باز في تحفة الأخيار ص26",
          },
          {
            name: "أذكار الصباح",
            repTime: "سبع مرات",
            count: 7,
            subItemName:
              "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
            subItemDescription:
              " من قالها حين يصبح ويمسي سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة .أخرجه ابن السني برقم 71مرفوعاً وأبو موقوف 4/321،وصحح إسناده شعيب وعبد القادر الأرناؤوط . انظر زاد المعاد 2/ 376",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
            subItemDescription: "أبو داود وابن ماجه وانظر صحيح ابن ماجه 2/332",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
            subItemDescription: "الترمذي وأبو داود .انظر :صحيح الترمذي3/ 142",
          },
          {
            name: "أذكار الصباح",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
            subItemDescription:
              "من قالها ثلاثاً إذا أصبح وثلاثاً إذا أمسى لم يضره شيء أخرجه أبو داود 4/ 323 والترمذي 5/ 465 وابن ماجه وأحمد . انظر : صحيح ابن ماجه 2/332 وحسن إسناده العلامة ابن باز في تحفة الأخيار ص39",
          },
          {
            name: "أذكار الصباح",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيّاً",
            subItemDescription:
              " من قالها ثلاثاً حين يصبح وحين يمسي كان حقاً على الله أن يرضيه يوم القيامة . أحمد 4/ 337 والنسائي في عمل اليوم والليلة برقم 4 وابن السني برقم 68 وأبو داود 4/418 والترمذي 5/465 وحسنه ابن باز في تحفة الأخيار ص 39",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
            subItemDescription:
              "الحاكم وصححه ووافقه الذهبي 1/ 545 وانظر صحيح الترغيب والترهيب 1/273",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُـمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ:فَتْحَهُ، وَنَصْرَهُ، وَنورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ",
            subItemDescription:
              " أبو داود 4/ 322 وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد 2/ 273",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أَصْبَحْنا عَلَى فِطْرَةِ الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صلى الله عليه وسلم، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ",
            subItemDescription:
              " أحمد 3/ 406و 407 وابن السني في عمل اليوم والليلة برقم 34 وانظر : صحيح الجامع 4/ 209",
          },
          {
            name: "أذكار الصباح",
            repTime: "مائة مرة",
            count: 100,
            subItemName: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
            subItemDescription:
              "من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد رواه مسلم4 / 2071",
          },
          {
            name: "أذكار الصباح",
            repTime: "عشر مرات",
            count: 10,
            subItemName:
              "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
            subItemDescription:
              "النسائي في عمل اليوم والليلة برقم 24 وانظر :صحيح الترغيب والترهيب 1/272 ،وتحفة الأخيار لابن باز ص44وانظر فضلها في ص146 ،حديث رقم 255",
          },
          {
            name: "أذكار الصباح",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ",
            subItemDescription: "مسلم 4/2090",
          },
          {
            name: "أذكار الصباح",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً",
            subItemDescription:
              "أخرجه ابن السني في عمل اليوم والليلة برقم 54وابن ماجه برقم 925وحسن إسناده عبد القادر وشعيب الأرناؤوط في تحقيق زاد المعاد 2/375",
          },
          {
            name: "أذكار الصباح",
            repTime: "مائة مرة",
            count: 100,
            subItemName: "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
            subItemDescription: "البخاري مع الفتح 11/ 101 ، ومسلم 4/ 2075",
          },
          {
            name: "أذكار الصباح",
            repTime: "عشر مرات",
            count: 10,
            subItemName: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ",
            subItemDescription:
              "من صلى علي حين يُصبح عشراً ، وحين يُمسي عشراً أدركتهُ شفاعتي يوم القيامة رواه الطبراني بإسنادين أحدهما جيد ، انظر الزائد 10/ 120 وصحيح الترغيب والترهيب 1/273",
          },
        ],
      },
      {
        name: "أذكار المساء",
        description: "البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.",
        title: "الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.",
        subItems: [
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ\n ﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾",
            subItemDescription:
              "سورة البقرة ، آية 255 من قالها حين يمسي أجير منهم حتى يصبح أخرجه الحاكم 1/ 562وصححه الألباني في صحيح الترغيب والترهيب 1/ 273 وعزاه إلى النسائي والطبراني وقال : وإسناد الطبراني جيد",
          },
          {
            name: "أذكار المساء",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "بسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾.\nبسم الله الرحمن الرحيم \n﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾",
            subItemDescription:
              "ن قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء . أبو داود 4/ 322 والترمذي 5/ 567وانظر صحيح الترمذي 3/ 182",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أمسينا وأمسى الملك للَّه، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌرب أسألك خير ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة، وشر ما بعدها ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
            subItemDescription: " مسلم 4/ 2088",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهم بك أمسينا، وبك أصبحنا، وبك نحيا، وبك نموت، وإليك المصير",
            subItemDescription: "الترمذي 5/ 466 وانظر صحيح الترمذي 3/ 142",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ",
            subItemDescription:
              "من قالها موقناً بها حين يمسي فمات من ليلته دخل الجنة ، وكذلك إذا أصبح أخرجه البخاري 7/150",
          },
          {
            name: "أذكار المساء",
            repTime: "أربع مرات",
            count: 4,
            subItemName:
              "اللَّهم إني أمسيت أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ",
            subItemDescription:
              "من قالها حين يصبح وحين يمسي أربع مرات أعتقه الله من النار . أخرجه أبو داود 4/ 317 والبخاري في الأدب المفرد برقم 1201 والنسائي في عمل اليوم والليلة برقم 9، وابن السني برقم 70 وحسن سماحة الشيخ ابن باز إسناد النسائي وأبي داود في تحفة الأخيار ص 23",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهم ما أمسى بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ",
            subItemDescription:
              "من قالها حين يصبح فقد أدي شكر يومه ، ومن قالها حين يمسى فقد أدى شكر ليلته . أخرجه أبو داود 4/318 ، والنسائي في عمل اليوم والليلة برقم 7وابن السني برقم 41 وابن حبان (( موارد)) رقم 2361وحسن ابن باز إسناده في تحفة الأخيار ص24",
          },
          {
            name: "أذكار المساء",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ",
            subItemDescription:
              "أبو داود 4/ 324، وأحمد 5/ 42 والنسائي في عمل اليوم والليلة برقم 22وابن السني برقم 69والبخاري في الأدب المفرد وحسن العلامة ابن باز في تحفة الأخيار ص26",
          },
          {
            name: "أذكار المساء",
            repTime: "سبع مرات",
            count: 7,
            subItemName:
              "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
            subItemDescription:
              " من قالها حين يصبح ويمسي سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة .أخرجه ابن السني برقم 71مرفوعاً وأبو موقوف 4/321،وصحح إسناده شعيب وعبد القادر الأرناؤوط . انظر زاد المعاد 2/ 376",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي",
            subItemDescription: " أبو داود وابن ماجه وانظر صحيح ابن ماجه 2/332",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
            subItemDescription: " الترمذي وأبو داود .انظر :صحيح الترمذي3/ 142",
          },
          {
            name: "أذكار المساء",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
            subItemDescription:
              "من قالها ثلاثاً إذا أصبح وثلاثاً إذا أمسى لم يضره شيء أخرجه أبو داود 4/ 323 والترمذي 5/ 465 وابن ماجه وأحمد . انظر : صحيح ابن ماجه 2/332 وحسن إسناده العلامة ابن باز في تحفة الأخيار ص39",
          },
          {
            name: "أذكار المساء",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيّاً",
            subItemDescription:
              "من قالها ثلاثاً حين يصبح وحين يمسي كان حقاً على الله أن يرضيه يوم القيامة . أحمد 4/ 337 والنسائي في عمل اليوم والليلة برقم 4 وابن السني برقم 68 وأبو داود 4/418 والترمذي 5/465 وحسنه ابن باز في تحفة الأخيار ص 39",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
            subItemDescription:
              "الحاكم وصححه ووافقه الذهبي 1/ 545 وانظر صحيح الترغيب والترهيب 1/273",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أمسينا وأمسى الملك للَّه ربّ العالمين اللَّهم إني أسألك خير هذه الليلة: فتحها، ونصرها، ونورها، وبركتها، وهداها، وأعوذ بك من شر ما فيها، وشر ما بعدها",
            subItemDescription:
              "أبو داود 4/ 322 وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد 2/ 273",
          },
          {
            name: "أذكار المساء",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "أمسينا على فطرة الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صلى الله عليه وسلم، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ",
            subItemDescription:
              "أحمد 3/ 406و 407 وابن السني في عمل اليوم والليلة برقم 34 وانظر : صحيح الجامع 4/ 209",
          },
          {
            name: "أذكار المساء",
            repTime: "مائة مرة",
            count: 100,
            subItemName: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
            subItemDescription:
              "من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد رواه مسلم4 / 2071",
          },
          {
            name: "أذكار المساء",
            repTime: "عشر مرات",
            count: 10,
            subItemName:
              "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
            subItemDescription:
              "النسائي في عمل اليوم والليلة برقم 24 وانظر :صحيح الترغيب والترهيب 1/272 ،وتحفة الأخيار لابن باز ص44وانظر فضلها في ص146 ،حديث رقم 255",
          },
          {
            name: "أذكار المساء",
            repTime: "مائة مرة",
            count: 100,
            subItemName: "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ",
            subItemDescription: "البخاري مع الفتح 11/ 101 ، ومسلم 4/ 2075",
          },
          {
            name: "أذكار المساء",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
            subItemDescription:
              "من قالها حين يمسي ثلاث مرات لم تضره حمة تلك الليلة أخرجه أحمد 2/290 والنسائي في عمل اليوم والليلة برقم 590 وابن السني برقم 68وانظر : صحيح الترمذي 3/187، وصحيح ابن ماجه 2/266 وتحفة الأخيار ص45",
          },
          {
            name: "أذكار المساء",
            repTime: "عشر مرات",
            count: 10,
            subItemName: "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ",
            subItemDescription:
              "من صلى علي حين يُصبح عشراً ، وحين يُمسي عشراً أدركتهُ شفاعتي يوم القيامة رواه الطبراني بإسنادين أحدهما جيد ، انظر الزائد 10/ 120 وصحيح الترغيب والترهيب 1/273",
          },

        ],
      },
    
      {
        name: "أذكار النوم",
        description: "البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.",
        title: "الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.",
        subItems: [
          {
            name: "أذكار النوم",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName:
              "يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا:\nبسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾. \nبسم الله الرحمن الرحيم \n﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾ \n\nثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقبَلَ مِنْ جَسَدِهِ",
            subItemDescription: " البخاري مع الفتح 9/62ومسلم 4/1723",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْـــــــــــدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾.",
            subItemDescription:
              "من قرأها إذا أوى إلى فراشه فإنه لن يزال عليه من الله حافظ ولا يقربه شيطان حتى يصبح البخاري مع الفتح 4/487",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾.",
            subItemDescription:
              " من قرأها في ليلة كفتاه، البخاري مع الفتح 9/ 94 ومسلم 1/ 554 ، والآيتان من سورة البقرة 285-286",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
            subItemDescription: " البخاري 11/ 126 .ومسلم 4/ 2084",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْياهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ",
            subItemDescription: " رواه مسلم4/ 2083وأحمد بلفظه 2/79",
          },
          {
            name: "أذكار النوم",
            repTime: "ثلاث مرات",
            count: 3,
            subItemName: "اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ",
            subItemDescription: " أبو داود بلفظه 4/311 وانظر صحيح الترمذي3/ 143",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName: "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
            subItemDescription: "البخاري مع الفتح 11/113 ومسلم 4/ 2083",
          },
          {
            name: "أذكار النوم",
            repTime: "33 مرة",
            count: 33,
            subItemName: "سُبْحَانَ اللَّهِ ",
            subItemDescription:
              " من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم البخاري مع الفتح 7/71 ومسلم 4/ 2091",
          },
          {
            name: "أذكار النوم",
            repTime: "33 مرة",
            count: 33,
            subItemName: "وَالْحَمْدُ لِلَّهِ ",
            subItemDescription:
              " من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم البخاري مع الفتح 7/71 ومسلم 4/ 2091",
          },
          {
            name: "أذكار النوم",
            repTime: "34 مرة",
            count: 34,
            subItemName: " وَاللَّهُ أَكْبَرُ",
            subItemDescription:
              " من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم البخاري مع الفتح 7/71 ومسلم 4/ 2091",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ",
            subItemDescription: "مسلم 4/ 2084",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ",
            subItemDescription: " مسلم 4/ 2085",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ",
            subItemDescription: " أبو داود 4/ 317 وانظر صحيح سنن الترمذي3/ 142",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "يَقْرَأُ ﴿الم﴾ تَنْزِيلَ السَّجْدَة ِ، وَتَبَارَكَ الَّذي بِيَدِهِ الْمُلْكُ",
            subItemDescription: " الترمذي والنسائي وانظر صحيح الجامع4/ 255",
          },
          {
            name: "أذكار النوم",
            repTime: "مرة واحدة",
            count: 1,
            subItemName:
              "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
            subItemDescription:
              ' قال صلى الله عليه وسلم لمن قال ذلك : "فإن متَّ،متَّ على الفطرة " البخاري مع الفتح 11/113 ومسلم 4/ 2081',
          },
        ],
      },
    {
        name: "الدعاء إذا تقلب ليلا",
        subItems: [
            {
                name: "الدعاء إذا تقلب ليلا",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ الْوَاحِدُ الْقَهّارُ، رَبُّ السَّمَوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزيزُ الْغَفَّارُ",
                subItemDescription:
                    "يقول ذلك إذا تقلب من جنب إلى جنب في الليل . أخرجه الحاكم وصححه ووفقه الذهبي 1/ 540 والنسائي في اليوم والليلة وابن السني وانظر صحيح الجامع 4/213",
            },
        ],
    },
    {
        name: "دعاء الفزع في النوم و من بُلِيَ بالوحشة",
        subItems: [
            {
                name: "دعاء الفزع في النوم و من بُلِيَ بالوحشة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّياطِينِ وَأَنْ يَحْضُرُونِ",
                subItemDescription: "أبو داود 4/12 نظر صحيح الترمذي3/ 171",
            },
        ],
    },
    {
        name: "ما يفعل من رأى الرؤيا أو الحلم",
        subItems: [
            {
                name: "ما يفعل من رأى الرؤيا أو الحلم",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "يَنْفُثُ عَنْ يَسَارِهِ",
                subItemDescription: "مسلم4/1772",
            },
            {
                name: "ما يفعل من رأى الرؤيا أو الحلم",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName:
                    "يَسْتَعِيذُ بِاللَّهِ مِنَ الشَّيطَانِ وَمِنْ شَرِّ مَا رَأَى[1]- لاَ يُحَدِّثْ بِهَا أَحَداً[2] - يَــتَحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ[3]",
                subItemDescription: " مسلم4/1772- 1773[1].مسلم4/1772[2]. مسلم4/1773[3]",
            },
            {
                name: "ما يفعل من رأى الرؤيا أو الحلم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "ويَقُومُ يُصَلِّي إِنْ أَرَادَ ذَلِكَ",
                subItemDescription: "مسلم4/1773",
            },
        ],
    },
    {
        name: "دعاء قنوت الوتر",
        subItems: [
            {
                name: "دعاء قنوت الوتر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اهْدِنِي فِيمَنْ هَدَيْتَ، وَعَافِنِي فِيمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ؛ فَإِنَّكَ تَقْضِي وَلاَ يُقْضَى عَلَيْكَ، إِنَّهُ لاَ يَذِلُّ مَنْ وَالَيْتَ، [وَلاَ يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنا وَتَعَالَيْتَ",
                subItemDescription:
                    " أخرجه أصحاب السنن الأربعة وأحمد والدرامي والحاكم والبيهقي وما بين المعكوفين للبيهقي وانظر صحيح الترمذي 1/144وصحيح ابن ماجه 1/194 وإرواء الغليل للألباني 2/172",
            },
            {
                name: "دعاء قنوت الوتر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُــــوذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                subItemDescription:
                    " أخرجه أصحاب السنن الأربعة وأحمد. انظر صحيح الترمذي 3/180وصحيح ابن ماجه 1/194 والإرواء 2/175",
            },
            {
                name: "دعاء قنوت الوتر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِيَّاكَ نعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِينَ مُلْحَقٌ. اللَّهُمَّ إِنَّا نَسْتَعينُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الْخَيْرَ، وَلاَ نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفرُكَ",
                subItemDescription:
                    " أخرجه البيهقي في السنن الكبرى وصحح إسناده 2/211 وقال الشيخ الألباني في إرواء الغليل وهذا إسناد صحيح 2/170 .وهو موقوف على عمر . ",
            },
        ],
    },
    {
        name: "الذكر عقب السلام من الوتر",
        subItems: [
            {
                name: "الذكر عقب السلام من الوتر",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "سُبْحَانَ المَلِكِ القُدُّوسِ",
                subItemDescription:
                    " والثَّالِثَةُ يَجْهَرُ بها ويَمُدُّ بها صَوتَهُ يقولُ: [رَبِّ الْمَلاَئِكَةِ وَالرُّوحِ]\nرواه النسائي 3/244 والدار قطني وغيرهما وما بين المعكوفين زيادة للدار قطني 2/31 وإسناده صحيح .انظر زاد المعاد بتحقيق شعيب الأرناؤوط وعبد القادر الأرناؤوط 1/337",
            },
        ],
    },
    {
        name: "دعاء الهم والحزن",
        subItems: [
            {
                name: "دعاء الهم والحزن",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُــــلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي، وَنُورَ صَدْرِي، وَجَلاَءَ حُزْنِي، وَذَهَابَ هَمِّي",
                subItemDescription: " أحمد 1/391وصححه الألباني",
            },
            {
                name: "دعاء الهم والحزن",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
                subItemDescription: "البخاري 7/158 كان رسول الله ﷺ يكثر من هذا الدعاء.",
            },
        ],
    },
    {
        name: "دعاء الكرب",
        subItems: [
            {
                name: "دعاء الكرب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ الْعَظِيمُ الْحَلِيمُ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لاَ إِلَهَ إِلاَّ اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ",
                subItemDescription: " البخاري 7/154ومسلم 4/ 2092",
            },
            {
                name: "دعاء الكرب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ رَحْمَتَكَ أَرْجُو، فَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لاَ إِلَهَ إِلاَّ أَنْتَ",
                subItemDescription:
                    "أبو داود 4/324 وأحمد 5/42 وحسنه الألباني في صحيح أبو داود 3/ 959",
            },
            {
                name: "دعاء الكرب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظّالِمِينَ",
                subItemDescription:
                    " الترمذي 5/529 والحاكم وصححه ووفقه الذهبي 1/505 وانظر صحيح الترمذي3/ 168",
            },
            {
                name: "دعاء الكرب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "اللَّهُ اللَّهُ رَبِّي لاَ أُشْرِكُ بِهِ شَيْئاً",
                subItemDescription: " أخرجه أبو داود 2/87 وانظر صحيح ابن ماجه 2/335",
            },
        ],
    },
    {
        name: "دعاء لقاء العدو و ذي السلطان",
        subItems: [
            {
                name: "دعاء لقاء العدو و ذي السلطان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِم، وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ",
                subItemDescription: "أبو داود 2/89 وصححه الحاكم ووافقه الذهبي 2/142",
            },
            {
                name: "دعاء لقاء العدو و ذي السلطان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيرِي، بِكَ أَحُولُ وَبِكَ أَصُولُ، وَبِكَ أُقاتِلُ",
                subItemDescription:
                    " أبو داود 3/42 والترمذي 5/572 ،وانظر صحيح الترمذي3/183",
            },
            {
                name: "دعاء لقاء العدو و ذي السلطان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "حَسْبُنا اللَّهُ وَنِعْمَ الْوَكِيلُ",
                subItemDescription: "البخاري 5/172",
            },
        ],
    },
    {
        name: "دعاء من خاف ظلم السلطان",
        subItems: [
            {
                name: "دعاء من خاف ظلم السلطان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ ربَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، كُنْ لِي جَاراً مِنْ فُلاَنِ بْنِ فُلاَنٍ، وَأَحْزَابِهِ مِنْ خَلاَئِقِكَ، أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى، عَزَّ جَارُكَ، وَجَلَّ ثَنَاؤُكَ، وَلاَ إِلَهَ إِلاَّ أَنْتَ",
                subItemDescription:
                    " البخاري في الأدب المفرد برقم 707 وصححه الألباني وفي صحيح الأدب المفرد برقم 545",
            },
            {
                name: "دعاء من خاف ظلم السلطان",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName:
                    "اللَّهُ أَكْبَرُ، اللَّهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيعاً، اللَّهُ أَعَزُّ مِمَّا أَخَافُ وَأَحْذَرُ، أَعُوذُ بِاللَّهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الْأَرْضِ إِلاَّ بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وَجُنُودِهِ وَأَتْبَاعِهِ وَأَشْيَاعِهِ، مِنْ الْجِنِّ وَالإِنْسِ، اللَّهُمَّ كُنْ لِي جَاراً مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُكَ وَعَزَّ جَارُكَ، وَتَبَارَكَ اسْمُكَ، وَلاَ إِلَهَ غَيْرُكَ",
                subItemDescription:
                    " البخاري في الأدب المفرد برقم 708 وصححه الألباني وفي صحيح الأدب المفرد برقم 546",
            },
        ],
    },
    {
        name: "الدعاء على العدو",
        subItems: [
            {
                name: "الدعاء على العدو",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيعَ الْحِسَابِ، اهْزِمِ الأَحْزَابَ، اللَّهُمَّ اهزِمْهُمْ وَزَلْزِلْهُمْ",
                subItemDescription: "مسلم 3/1362",
            },
        ],
    },
    {
        name: "ما يقول من خاف قوما",
        subItems: [
            {
                name: "ما يقول من خاف قوما",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "اللَّهُمَّ اكْفِنِيهِمْ بِمَا شِئْتَ",
                subItemDescription: "مسلم 4/2300",
            },
        ],
    },
    {
        name: "دعاء من أصابه وسوسة في الإيمان",
        subItems: [
            {
                name: "دعاء من أصابه وسوسة في الإيمان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "يَسْتَعِيذُ بِاللَّهِ و يَنْتَهِي عَمَّا شك فِيهِ",
                subItemDescription: "البخاري مع الفتح 6/336 ومسلم 1/120",
            },
            {
                name: "دعاء من أصابه وسوسة في الإيمان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "يَقُولُ: آمَنْتُ بِاللَّهِ وَرُسُلِهِ",
                subItemDescription: "مسلم 1/ 119- 120",
            },
            {
                name: "دعاء من أصابه وسوسة في الإيمان",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "يَقْرَأُ قَوْلَهُ تَعَالَى: ﴿هُوَ الْأوَّلُ وَالْآخِرُ وَالظّاهِرُ وَالْباطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴾",
                subItemDescription:
                    " سورة الحديد ، الآية :3 .أبو داود 4/329 وحسنه الألباني في صحيح أبو داود 3/962",
            },
        ],
    },
    {
        name: "دعاء قضاء الدين",
        subItems: [
            {
                name: "دعاء قضاء الدين",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكِ عَمَّنْ سِوَاكَ",
                subItemDescription: "الترمذي 5/560 وانظر صحيح الترمذي3/ 180",
            },
            {
                name: "دعاء قضاء الدين",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
                subItemDescription: "البخاري7/ 158",
            },
        ],
    },
    {
        name: "دعاء الوسوسة في الصلاة و القراءة",
        subItems: [
            {
                name: "دعاء الوسوسة في الصلاة و القراءة",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName:
                    "أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ، وَاتْفُلْ عَلَى يَسَارِكَ",
                subItemDescription:
                    "مسلم 4/1729 من حديث عثمان بن العاص رضي الله عنه وفيه ففعلت ذلك فأذهبه الله عني",
            },
        ],
    },
    {
        name: "دعاء من استصعب عليه أمر",
        subItems: [
            {
                name: "دعاء من استصعب عليه أمر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لاَ سَهْلَ إِلاَّ مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلاً",
                subItemDescription:
                    "رواة ابن حبان في صحيحه برقم 2427 (موارد) وابن السني برقم 351 وقال الحافظ هذا حديث صحيح وصححه عبد القادر الأرناؤوط في تخريج الأذكار للنووي ص106",
            },
        ],
    },
    {
        name: "ما يقول ويفعل من أذنب ذنبا",
        subItems: [
            {
                name: "ما يقول ويفعل من أذنب ذنبا",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "مَا مِنْ عَبْدٍ يُذنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُ اللَّهَ إِلاَّ غَفَرَ اللَّهُ لَهُ",
                subItemDescription:
                    "أبو داود 2/86 والترمذي 2/257 وصححه الألباني في صحيح أبي داود 1/ 283",
            },
        ],
    },
    {
        name: "دعاء طرد الشيطان و وساوسه",
        subItems: [
            {
                name: "دعاء طرد الشيطان و وساوسه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "الْاسْتِعَاذَةُ بِاللَّهِ مِنْهُ",
                subItemDescription:
                    "أبو داود 1/206 والترمذي وانظر صحيح الترمذي 1/77 وانظر سورة المؤمنون آية 98-99",
            },
            {
                name: "دعاء طرد الشيطان و وساوسه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "الْأَذَانُ",
                subItemDescription: "مسلم 1/ 291 والبخاري 1/151",
            },
            {
                name: "دعاء طرد الشيطان و وساوسه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "الْأَذْكَارُ وَقِرَاءَةُ الْقُرْآنِ",
                subItemDescription:
                    '" لاتجعلوا بيوتكم مقابر إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة " رواه مسلم 1/539 ومما يطرد الشيطان أذكار الصباح والمساء ، والنوم والاستيقاظ ، وأذكار دخول المنزل والخروج منه وأذكار دخول المسجد والخروج منه وغير ذلك من الأذكار المشروعة مثل قراءة آية الكرسي عند النوم ، والآيتين الأخيرتين من سورة البقرة ، ومن قال لا إله إلا الله وحده لا شريك له ،له الملك وله الحمد وهو على كل شيء قدير مائة مرة كانت له حرزاً من الشيطان يومه كله ،وكذا الأذان يطرد الشيطان',
            },
        ],
    },
    {
        name: "الدعاء حينما يقع ما لا يرضاه أو ُ غلب على أمره",
        subItems: [
            {
                name: "الدعاء حينما يقع ما لا يرضاه أو ُ غلب على أمره",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "قَدَرُ اللَّهُ وَمَا شَاءَ فَعَلَ",
                subItemDescription:
                    ' " المؤمن القوي خير وأحب إلى الله من المؤمن الضعف وفي كل خير ،احرص على ما ينفعك واستعن بالله ولا تعجز وإن أصابك شيء فلا تقل لو أني فعلت كذا وكذا ولكن قل قدر الله وما شاء فعل فإن لو تفتح عمل الشيطان " .مسلم 4/2052.',
            },
        ],
    },
    {
        name: "ﺗﻬنئة المولود له وجوابه",
        subItems: [
            {
                name: "ﺗﻬنئة المولود له وجوابه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بَارَكَ اللَّهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَشَكَرْتَ الْوَاهِبَ، وَبَلَغَ أَشُدَّهُ، وَرُزِقْتَ بِرَّهُ. وَيَرُدُّ عَلَيْهِ الْمُهَــــــنَّأُ فَيَقُولُ: بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ، وَجَزَاكَ اللَّهُ خَيْراً، وَرَزَقَكَ اللَّهُ مِثْلَهُ، وَأَجْزَلَ ثَوَابَكَ.",
                subItemDescription:
                    "انظر الأذكار للنووي ص349 وصحيح الأذكار للنووي ، لسليم الهلالي 2/713.",
            },
        ],
    },
    {
        name: "ما يعوذ به الأولاد",
        subItems: [
            {
                name: "ما يعوذ به الأولاد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "كَانَ رَسُولُ اللَّهِ ﷺ يُعَوِّذُ الحَسَنَ وَالحُسَينَ رضي الله عنهما أُعِيذُكُمَا بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ.",
                subItemDescription: "البخاري 4/119 من حديث ابن عباس رضي الله عنهما",
            },
        ],
    },
    {
        name: "الدعاء للمريض في عيادته",
        subItems: [
            {
                name: "الدعاء للمريض في عيادته",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "لاَ بأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ",
                subItemDescription: "البخاري مع الفتح 10/ 118",
            },
            {
                name: "الدعاء للمريض في عيادته",
                repTime: "سبع مرات",
                count: 7,
                subItemName:
                    "أَسْأَلُ اللَّهَ الْعَظيمَ رَبَّ الْعَرْشِ الْعَظِيمِ أَنْ يَشْفيَكَ",
                subItemDescription:
                    'ما من عبد مسلم يعود مريضاً لم يحضر أجله فيقول: سبع مرات....."الحديث إلا عوفي . أخرجه الترمذي وأبو داود وانظر صحيح الترمذي2/ 210 وصحيح الجامع 5/180',
            },
        ],
    },
    {
        name: "فضل عيادة المريض",
        subItems: [
            {
                name: "فضل عيادة المريض",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "قَالَ النَّبِيُّ ﷺ: إِذَا عَادَ الرَّجُلُ أَخَاهُ الْمُسْلِمَ مَشَى فِي خِرَافَةِ الْجَنَّةِ حَتَّى يَجْلِسَ، فَإِذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ، فَإِنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُمْسِيَ، وَإِنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ أَلْفَ مَلَكٍ حَتَّى يُصْبِحَ.",
                subItemDescription:
                    "رواه الترمذي وابن ماجه وأحمد وانظر صحيح ابن ماجه 1/244 وصحيح الترمذي 1/286 وصححه أيضاً أحمد شاكر",
            },
        ],
    },
    {
        name: "دعاء المريض الذي يئس من حياته",
        subItems: [
            {
                name: "دعاء المريض الذي يئس من حياته",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيقِ الْأَعْلَى",
                subItemDescription: "البخاري 7/10 ومسلم 4/1893",
            },
            {
                name: "دعاء المريض الذي يئس من حياته",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "جَعَلَ النَّبِيُّ ﷺ عِنْدَ مَوْتِهِ يُدْخِلُ يَدَيْهِ فِي الْمَاءِ فَيَمْسَحُ بِهِمَا وَجْهَهُ، وَيَقُولُ: لاَ إِلَهَ إِلاَّ اللَّهُ إِنَّ لِلْمَوْتِ سَكَرَاتٍ",
                subItemDescription: "البخاري مع الفتح 8/144وفي الحديث السواك",
            },
            {
                name: "دعاء المريض الذي يئس من حياته",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لاَ إِلَهَ إِلاَّ اللَّهُ لَهُ المُلْكُ وَلَهُ الْحَمْدُ، لاَ إِلَهَ إِلاَّ اللَّهُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
                subItemDescription:
                    "أخرجه الترمذي وابن ماجه وصححه الألباني ، وانظر صحيح الترمذي 3/152وصحيح ابن ماجه 2/317",
            },
        ],
    },
    {
        name: "تلقين المحتضر",
        subItems: [
            {
                name: "تلقين المحتضر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "مَنْ كَانَ آخِرُ كَلاَمِهِ لاَ إِلَهَ إِلاَّ اللَّهُ دَخَلَ الْجَنَّةَ",
                subItemDescription: "أبو داود 3/190 وانظر صحيح الجامع 5/432",
            },
        ],
    },
    {
        name: "دعاء من أصيب بمصيبة",
        subItems: [
            {
                name: "دعاء من أصيب بمصيبة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي، وَأَخْلِفْ لِي خَيْرَاً مِنْهَا",
                subItemDescription: "مسلم 2/632",
            },
        ],
    },
    {
        name: "الدعاء عند إغماض الميت",
        subItems: [
            {
                name: "الدعاء عند إغماض الميت",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اغْفِرْ لِفُلاَنٍ (بِاسْمِهِ) وَارْفَعْ دَرَجَتَهُ فِي الْمَهْدِيِّينَ، وَاخْلُفْهُ فِي عَقِبِهِ فِي الْغَابِرِينَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ الْعَالَمِينَ، وَافْسَحْ لَهُ فِي قَبْرِهِ، وَنَوِّرْ لَهُ فِيهِ",
                subItemDescription: "مسلم 2/634",
            },
        ],
    },
    {
        name: "الدعاء للميت في الصلاة عليه",
        subItems: [
            {
                name: "الدعاء للميت في الصلاة عليه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعَافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ [وَعَذَابِ النَّارِ]",
                subItemDescription: "مسلم 2/663",
            },
            {
                name: "الدعاء للميت في الصلاة عليه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا، وَشَاهِدِنَا وَغَائِبِنَا، وَصَغِيرِنَا وَكَبيرِنَا، وَذَكَرِنَا وَأُنْثَانَا. اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الْإِسْلاَمِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيمَانِ، اللَّهُمَّ لاَ تَحْرِمْنَا أَجْرَهُ، وَلاَ تُضِلَّنَا بَعْدَهُ",
                subItemDescription:
                    "ابن ماجه 1/480 وأحمد 2/368 وانظر صحيح ابن ماجة1/ 251",
            },
            {
                name: "الدعاء للميت في الصلاة عليه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنَّ فُلاَنَ بْنَ فُلاَنٍ فِي ذِمَّتِكَ، وَحَبْلِ جِوَارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ، وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفَاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ وَارْحَمْهُ إِنَّكَ أَنْتَ الغَفُورُ الرَّحيمُ",
                subItemDescription:
                    "أخرجه ابن ماجه ، وانظر صحيح ابن ماجة1/ 251ورواه أبو داود 3/211",
            },
            {
                name: "الدعاء للميت في الصلاة عليه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ احْتَاجَ إِلَى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ فِي حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيئاً فَتَجَاوَزْ عَنْهُ",
                subItemDescription:
                    "أخرجه الحاكم وصححه ووافقه الذهبي 1/359 وانظر أحكام الجنائز للألباني ص125",
            },
        ],
    },
    {
        name: "الدعاء للفرط في الصلاة عليه",
        subItems: [
            {
                name: "الدعاء للفرط في الصلاة عليه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ أَعِذْهُ مِنْ عَذَابِ القَبْرِ[1]وإن قال:اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوَالِدَيْهِ، وَشَفِيعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِينَهُمَا، وَأَعْظِمْ بِهِ أُجورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ الْمُؤْمِنِينَ، وَاجْعَلْهُ فِي كَفَالَةِ إِبْرَاهِيمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيمِ، وَأَبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، اللَّهُمَّ اغْفِرْ لِأَسْلاَفِنَا، وَأَفْرَاطِنَا، وَمَنْ سَبَقَنَا بِالْإِيمَانِ. إن قال ذلك فَحَسَنٌ.[2]",
                subItemDescription:
                    'قال سعيد بن المسيب صليت وراء أبي هريرة على صبي لم يعمل خطيئة قط فسمعته يقول ..." الحديث .أخرجه مالك في الموطأ 1/288 وابن أبي شيبه في المصنف 3/ 217 والبيهقي 4/9، وصحح إسناده شعيب الأرناؤوط في تحقيقه لشرح السنة للبغوي 5/357.[1]انظر : المغني لابن قدامة 3/416 والدروس المهمة لعامة الأمة للشيخ عبد العزيز بن عبد الله بن باز حفظه الله ص15.[2]',
            },
            {
                name: "الدعاء للفرط في الصلاة عليه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً.",
                subItemDescription:
                    ' كان الحسن يقرأ على الطفل بفاتحة الكتاب ويقول .. " الحديث أخرجه البغوي في شرح السنة 5/357وعبد الرزاق برقم 6588، وعلقه البخاري في كتاب الجنائز ، 65باب قراءة فاتحة الكتاب على الجنازة 2/113',
            },
        ],
    },
    {
        name: "دعاء التعزية",
        subItems: [
            {
                name: "دعاء التعزية",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِنَّ للَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيْءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّى... فَلْتَصْبِرْ وَلْتَحْتَسِبْ[1]. وَإِنْ قَالَ: أَعْظَمَ اللَّهُ أَجْرَكَ، وَأَحْسَنَ عَزَاءَكَ، وَغَفَرَ لِمَيِّتِكَ, فَحَسَنٌ.[2]",
                subItemDescription:
                    " البخاري 2/80 ومسلم 2/636.[1]الأذكار للنووي ص126 .[2]",
            },
        ],
    },
    {
        name: "الدعاء عند إدخال الميت القبر",
        subItems: [
            {
                name: "الدعاء عند إدخال الميت القبر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "بِسْمِ اللَّهِ وَعَلَى سُنَّةِ رَسُولِ اللَّهِ",
                subItemDescription:
                    "أبو داود 3/314بسند صحيح وأحمد بلفظ بسم الله وعلى ملة رسول الله وسنده صحيح .",
            },
        ],
    },
    {
        name: "الدعاء بعد دفن الميت",
        subItems: [
            {
                name: "الدعاء بعد دفن الميت",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
                subItemDescription:
                    ' كان النبي ﷺ إذا فرغ من دفن الميت وقف عليه فقال :" استغفروا لأخيكم وسلوا له التثبيت فإنه الآن يُسأل" .أبو داود 3/315 والحاكم وصححه ووافقه الذهبي 1/370',
            },
        ],
    },
    {
        name: "دعاء زيارة القبور",
        subItems: [
            {
                name: "دعاء زيارة القبور",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "السَّلاَمُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لاَحِقُونَ، [وَيَرْحَمُ اللَّهُ الْمُسْتَقدِمِينَ مِنَّا وَالْمُسْتأْخِرِينَ] أَسْاَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ",
                subItemDescription:
                    "سلمم2/671 ،وابن ماجه واللفظ له 1/494 عن بريدة رضي الله عنه ، وما بين المعكوفين من حديث عائشة رضي الله عنها عند مسلم 2/671",
            },
        ],
    },
    {
        name: "دعاء الريح",
        subItems: [
            {
                name: "دعاء الريح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْــــــأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
                subItemDescription:
                    " أخرجه أبو داود 4/326وابن ماجه 2/1228 وانظر  صحيح ابن ماجة2/ 305",
            },
            {
                name: "دعاء الريح",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيهَا، وَخَيْرَ مَا أُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا فِيهَا، وَشَرِّ مَا أُرْسِلَتْ بِهِ",
                subItemDescription: "مسلم 2/616 والبخاري 4/76.",
            },
        ],
    },
    {
        name: "دعاء الرعد",
        subItems: [
            {
                name: "دعاء الرعد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلاَئِكةُ مِنْ خِيفَتِهِ",
                subItemDescription:
                    'كان عبد الله بن الزبير رضي الله عنهما إذا سمع الرعد ترك الحديث وقال :...." الموطأ 2/992 وقال الألباني صحيح الإسناد موقوفاً ',
            },
        ],
    },
    {
        name: "من أدعية الاستسقاء",
        subItems: [
            {
                name: "من أدعية الاستسقاء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اسْقِنَا غَيْثاً مُغِيثاً مَرِيئاً مَرِيعاً، نَافِعاً غَيْرَ ضَارٍّ، عَاجِلاً غَيْرَ آجِلٍ",
                subItemDescription:
                    "أبو داود 1/303 وصححه الألباني في صحيح أبي داود1/ 216",
            },
            {
                name: "من أدعية الاستسقاء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
                subItemDescription: "والبخاري 1/224 ،مسلم 2/613",
            },
            {
                name: "من أدعية الاستسقاء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِي بَلَدَكَ الْمَيِّتَ",
                subItemDescription:
                    "أبو داود 1/305 وحسنه الألباني في صحيح أبي داود1/ 218",
            },
        ],
    },
    {
        name: "الدعاء إذا نزل المطر",
        subItems: [
            {
                name: "الدعاء إذا نزل المطر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "اللَّهُمَّ صَيِّباً نَافِعاً",
                subItemDescription: "البخاري مع الفتح 2/518",
            },
        ],
    },
    {
        name: "الذكر بعد نزول المطر",
        subItems: [
            {
                name: "الذكر بعد نزول المطر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ",
                subItemDescription: " والبخاري 1/205 ،مسلم 1/83",
            },
        ],
    },
    {
        name: "من أدعية الاستصحاء",
        subItems: [
            {
                name: "من أدعية الاستصحاء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الْأَوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
                subItemDescription: " والبخاري 1/224 ،مسلم 2/614",
            },
        ],
    },
    {
        name: "دعاء رؤية الهلال",
        subItems: [
            {
                name: "دعاء رؤية الهلال",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلاَمَةِ وَالْإِسْلاَمِ، وَالتَّوْفِيقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللَّهُ",
                subItemDescription:
                    " الترمذي 5/504 والدارمي بلفظه 1/336 وانظر صحيح الترمذي3/ 157",
            },
        ],
    },
    {
        name: "الدعاء عند إفطار الصائم",
        subItems: [
            {
                name: "الدعاء عند إفطار الصائم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "ذَهَبَ الظَّمَأُ وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ",
                subItemDescription:
                    " أخرجه أبي داود 2/306 وغيره وانظر صحيح الجامع 4/209",
            },
            {
                name: "الدعاء عند إفطار الصائم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِي",
                subItemDescription:
                    " أخرجه ابن ماجه 1/557 من دعاء عبد الله بن عمرو رضي الله عنهما ،وحسنه الحافظ في تخريج الأذكار انظر شرح الأذكار 4/342",
            },
        ],
    },
    {
        name: "الدعاء قبل الطعام",
        subItems: [
            {
                name: "الدعاء قبل الطعام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِذَا أَكَلَ أَحَدُكُمْ طَعَاماً فَلْيَقُلْ بِسْمِ اللَّهِ، فَإِنْ نَسِيَ فِي أَوَّلِهِ فَلْيَقُلْ بسمِ اللَّهِ فِي أَوَّلِهِ وَآخِرِهِ",
                subItemDescription:
                    " أخرجه أبو داود 3/347 والترمذي 4/288 وانظر صحيح الترمذي2/ 167",
            },
            {
                name: "الدعاء قبل الطعام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "مَنْ أَطْعَمَهُ اللَّهُ الطَّعَامَ فَلْيَقُلْ: اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَأَطْعِمْنَا خَيْراً مِنْهُ، وَمَنْ سَقَاهُ اللَّهُ لَبَناً فَلْيَقُلْ اللَّهُمَّ بَارِكْ لَنَا فِيهِ وَزِدْنَا مِنْهُ",
                subItemDescription: "الترمذي 5/506 وانظر صحيح الترمذي3/ 158",
            },
        ],
    },
    {
        name: "الدعاء عند الفراغ من الطعام",
        subItems: [
            {
                name: "الدعاء عند الفراغ من الطعام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا، وَرَزَقَنِيهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلاَ قُوَّةٍ",
                subItemDescription:
                    " أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 3/159",
            },
            {
                name: "الدعاء عند الفراغ من الطعام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "الْحَمْدُ لِلَّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ، غَيْرَ [مَكْفِيٍّ وَلاَ ] مُوَدَّعٍ، وَلاَ مُسْتَغْنَىً عَنْهُ رَبَّنَا",
                subItemDescription: "البخاري 6/\u200c214 والترمذي بلفظه 5/ 507",
            },
        ],
    },
    {
        name: "دعاء الضيف لصاحب الطعام",
        subItems: [
            {
                name: "دعاء الضيف لصاحب الطعام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ بَارِكْ لَهُمْ فِيمَا رَزَقْتَهُم، وَاغْفِرْ لَهُمْ وَارْحَمْهُمْ",
                subItemDescription: " مسلم3/ 1626",
            },
        ],
    },
    {
        name: "التعريض بالدعاء لطلب الطعام أو الشراب",
        subItems: [
            {
                name: "التعريض بالدعاء لطلب الطعام أو الشراب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
                subItemDescription: " مسلم3/ 26",
            },
        ],
    },
    {
        name: "الدعاء إذا أفطر عند أهل بيت",
        subItems: [
            {
                name: "الدعاء إذا أفطر عند أهل بيت",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الْأَبْرَارُ، وَصَلَّتْ عَلَيْكُمُ الْمَلاَئِكَةُ",
                subItemDescription:
                    " سنن أبي داود 3/367، وابن ماجه 1/556 ،والنسائي في عمل اليوم والليلة برقم 296- 298 ،ونص على أنه ﷺ يقوله إذا أفطر عند أهل بيت ،وصححه الألباني في صحيح أبي داود 2/730",
            },
        ],
    },
    {
        name: "دعاء الصائم إذا حضر الطعام ولم يفطر",
        subItems: [
            {
                name: "دعاء الصائم إذا حضر الطعام ولم يفطر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ، فَإِنْ كَانَ صَائِماً فَلْيُصَلِّ، وَإِنْ كَانَ مُفْطِراً فَلْيَطْعَمْ",
                subItemDescription:
                    " وَمَعْنَى فَلْيُصَلِّ أَيْ فَلْيَدْعُ.\n   مسلم 2/1054",
            },
        ],
    },
    {
        name: "ما يقول الصائم إذا سابه أحد",
        subItems: [
            {
                name: "ما يقول الصائم إذا سابه أحد",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "إِنِّي صَائِمٌ، إِنِّي صَائِ",
                subItemDescription: "البخاري مع الفتح 4/103 ،ومسلم 2/ 806",
            },
        ],
    },
    {
        name: "الدعاء عند رؤية باكورة الثمر",
        subItems: [
            {
                name: "الدعاء عند رؤية باكورة الثمر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِينَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
                subItemDescription: " مسلم 2/1000",
            },
        ],
    },
    {
        name: "دعاء العطاس",
        subItems: [
            {
                name: "دعاء العطاس",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِذَا عَطَسَ أَحَدُكُم فَلْيَقُلِ الْحَمْدُ لِلَّهِ، وَلْيَقُلْ لَهُ أَخُوهُ أَوْ صَاحِبُهُ: يَرْحَمُكَ اللَّهُ، فَإِذَا قَالَ لَهُ: يَرحَمُكَ اللَّهُ، فَلْيَقُلْ: يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ",
                subItemDescription: " البخاري 7/125",
            },
        ],
    },
    {
        name: "ما يقال للكافر إذا عطس فحمد الله",
        subItems: [
            {
                name: "ما يقال للكافر إذا عطس فحمد الله",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ",
                subItemDescription:
                    " الترمذي 5/82 وأحمد 4/400 وأبو داود 4/308، وانظر صحيح الترمذي 2/354",
            },
        ],
    },
    {
        name: "الدعاء للمتزوج",
        subItems: [
            {
                name: "الدعاء للمتزوج",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
                subItemDescription:
                    " أخرجه أصحاب السنن إلا النسائي وانظر صحيح الترمذي 1/316",
            },
        ],
    },
    {
        name: "دعاء المتزوج و شراء الدابة",
        subItems: [
            {
                name: "دعاء المتزوج و شراء الدابة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " إِذَا تَزَوَّجَ أَحَدُكُمُ امْرَأَةً، أَوْ إِذَا اشْتَرَى خَادِماً فَلْيَقُلْ:اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ، وَإِذَا اشْتَرَى بَعِيراً فَلْيَأْخُذْ بِذِرْوَةِ سَنَامِهِ وَلْيَقُلْ مِثْلَ ذَلِكَ.",
                subItemDescription:
                    " أبو داود 2/248 وابن ماجه 1/617 وانظر صحيح ابن ماجه 1/324",
            },
        ],
    },
    {
        name: "الدعاء قبل إتيان الزوجة",
        subItems: [
            {
                name: "الدعاء قبل إتيان الزوجة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بِسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا",
                subItemDescription: " البخاري 6/141 ومسلم 2/1028",
            },
        ],
    },
    {
        name: "دعاء الغضب",
        subItems: [
            {
                name: "دعاء الغضب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
                subItemDescription: " البخاري 6/99 ومسلم4/2015",
            },
        ],
    },
    {
        name: "دعاء من رأى مبتلى",
        subItems: [
            {
                name: "دعاء من رأى مبتلى",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلاَكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلاً",
                subItemDescription: " الترمذي 5/494 و5/493 وانظر  صحيح الترمذي3/ 153",
            },
        ],
    },
    {
        name: "ما يقال في اﻟﻤﺠلس",
        subItems: [
            {
                name: "ما يقال في اﻟﻤﺠلس",
                repTime: "مئة مرة",
                count: 100,
                subItemName:
                    "عَنِ ابْنِ عُمَرَ رضي الله عنه قَاَلَ: كَانَ يُعَدُّ لِرَسُولِ اللَّهِ ﷺ فِي الْمَجْلِسِ الوَاحِدِ مِائَةُ مَرَّةٍ مِنْ قَبْلِ أَنْ يَقُومَ: رَبِّ اغْفِرْ لِي، وَتُبْ عَلَيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ.",
                subItemDescription:
                    " الترمذي وغيره وانظر صحيح الترمذي 3/153 وصحيح ابن ماجه 2/321 ولفظه للترمذي",
            },
        ],
    },
    {
        name: "كفارة اﻟﻤﺠلس",
        subItems: [
            {
                name: "كفارة اﻟﻤﺠلس",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
                subItemDescription:
                    ' أخرجه أصحاب السنن وانظر صحيح الترمذي 3/153، وقد ثبت عن عائشة رضي الله عنها قالت :ما جلس رسول الله ﷺ مجلساً ، ولاتلى قرآناً ، ولا صلاة إلا ختم ذلك بكلمات...." الحديث أخرجه النسائي في عمل اليوم والليلة برقم 308 ، وأحمد 6/77 وصححه الدكتور فاروق حمادة في تحقيقه لعمل اليوم والليلة للنسائي ص273',
            },
        ],
    },
    {
        name: "الدعاء لمن قال غفر الله لك",
        subItems: [
            {
                name: "الدعاء لمن قال غفر الله لك",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "وَلَكَ",
                subItemDescription:
                    " أحمد 5/28 والنسائي في عمل اليوم والليلة ص218برقم 421 تحقيق الدكتور فاروق حمادة",
            },
        ],
    },
    {
        name: "الدعاء لمن صنع إليك معروفا",
        subItems: [
            {
                name: "الدعاء لمن صنع إليك معروفا",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "جَزَاكَ اللَّهُ خَيْراً",
                subItemDescription:
                    " أخرجه الترمذي رقم 2035 وانظر صحيح الجامع 6244 وصحيح الترمذي2/ 200",
            },
        ],
    },
    {
        name: "ما يعصم الله به من الدجال",
        subItems: [
            {
                name: "ما يعصم الله به من الدجال",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "مَنْ حَفِظَ عَشْرَ آيَاتٍ مِنْ أَوَّلِ سُورَةِ الْكَهْفِ عُصِمَ مِنَ الدَّجَّالِ، وَالْاسْتِعَاذَةُ بِاللَّهِ مِنْ فِتْنَتِهِ عَقِبَ التَّشَهُّدِ الْأَخِيرِ مِنْ كُلِّ صَلاَةٍ.",
                subItemDescription:
                    "مسلم 1/555 وفي رواية من آخر الكهف 1/556 \nانظر حديث رقم 55 وحديث 56",
            },
        ],
    },
    {
        name: "الدعاء لمن قال إني أحبك في الله",
        subItems: [
            {
                name: "الدعاء لمن قال إني أحبك في الله",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "أَحَبَّكَ الَّذِي أَحْبَبْتَنِي لَهُ",
                subItemDescription:
                    "أخرجه أبو داود 4/333، وحسنه الألباني في صحيح سنن أبي داود 3/965",
            },
        ],
    },
    {
        name: " الدعاء لمن عرض عليك ماله",
        subItems: [
            {
                name: " الدعاء لمن عرض عليك ماله",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ",
                subItemDescription: " البخاري الفتح4/ 88",
            },
        ],
    },
    {
        name: " الدعاء لمن أقرض عند القضاء",
        subItems: [
            {
                name: " الدعاء لمن أقرض عند القضاء",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ وَالأَدَاءُ",
                subItemDescription:
                    " أخرجه النسائي في عمل اليوم والليلة ص 300 وابن ماجه 2/ 809 وانظر صحيح ابن ماجه 2/809 وانظر صحيح ابن ماجه 2/55",
            },
        ],
    },
    {
        name: "دعاء الخوف من الشرك",
        subItems: [
            {
                name: "دعاء الخوف من الشرك",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لاَ أَعْلَمُ",
                subItemDescription:
                    " أحمد 4/403 وغيره وانظر صحيح الجامع 3/333 وصحيح الترغيب والترهيب للألباني",
            },
        ],
    },
    {
        name: "الدعاء لمن قال بارك الله فيك",
        subItems: [
            {
                name: "الدعاء لمن قال بارك الله فيك",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "وَفِيكَ بَارَكَ اللَّهُ",
                subItemDescription:
                    " أخرجه ابن السني ص138 برقم 278 وانظر الوابل الصيب لابن القيم 304 تحقيق بشير محمد عيون",
            },
        ],
    },
    {
        name: " دعاء كراهية الطيرة",
        subItems: [
            {
                name: " دعاء كراهية الطيرة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لاَ طَيْرَ إِلاَّ طَيْرُكَ، وَلاَ خَيْرَ إِلاَّ خَيْرُكَ، وَلاَ إِلَهَ غَيْرُكَ",
                subItemDescription:
                    ' أحمد 2/220 وابن السني برقم 292 وصححه الألباني في الأحاديث الصحيحة 3/54 رقم 1065 ، أما الفأل فكان يعجب النبي ﷺ ؛ ولهذا سمع من رجل كلمة طيبة فأعجبته فقال : "أخذنا فألك من فيك " أبو داود وأحمد ،وصححه الألباني في الصحيحة2/363 عند أبي الشيخ في أخلاق النبي',
            },
        ],
    },
    {
        name: " دعاء ركوب الدابة",
        subItems: [
            {
                name: " دعاء ركوب الدابة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "بِسْمِ اللَّهِ",
                subItemDescription:
                    "أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 156",
            },
            {
                name: " دعاء ركوب الدابة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "وَالْحَمْدُ للَّهِ",
                subItemDescription:
                    "أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 157",
            },
            {
                name: " دعاء ركوب الدابة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾",
                subItemDescription:
                    "أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 158",
            },
            {
                name: " دعاء ركوب الدابة",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "الْحَمْدُ لِلَّهِ",
                subItemDescription:
                    "أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 159",
            },
            {
                name: " دعاء ركوب الدابة",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "اللَّهُ أَكْبَرُ",
                subItemDescription:
                    "أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 160",
            },
            {
                name: " دعاء ركوب الدابة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي؛ فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
                subItemDescription:
                    "أبو داود 3/34 والترمذي 5/501 وانظر صحيح الترمذي3/ 161",
            },
        ],
    },
    {
        name: " دعاء السفر",
        subItems: [
            {
                name: " دعاء السفر",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: " اللَّهُ أَكْبَرُ",
                subItemDescription: "رواه مسلم2/ 978",
            },
            {
                name: " دعاء السفر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "﴿سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنقَلِبُونَ﴾",
                subItemDescription: "رواه مسلم2/ 979",
            },
            {
                name: " دعاء السفر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ إِنّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَليفَةُ فِي الْأَهْلِ، اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ، وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ",
                subItemDescription:
                    " وإذا رَجَعَ قَالَهُنَّ وَزَادَ فِيهِنَّ: ((آيِبُونَ، تائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ)).\nرواه مسلم2/ 979",
            },
        ],
    },
    {
        name: "دعاء دخول القرية أو البلدة",
        subItems: [
            {
                name: "دعاء دخول القرية أو البلدة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرَضِينَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّياطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ، وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيهَا",
                subItemDescription:
                    " الحاكم وصححه ووافقه الذهبي 2/100 وابن السني برقم 524وحسنه الحافظ في تخريج الأذكار 5/154 قال ابن باز:ورواه النسائي بإسناد حسن . انظر تحفة الأخيار ص 37",
            },
        ],
    },
    {
        name: " دعاء دخول السوق",
        subItems: [
            {
                name: " دعاء دخول السوق",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، يُحْيِي وَيُمِيتُ، وَهُوَ حَيٌّ لاِ يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                subItemDescription:
                    " الترمذي 5/491 والحاكم 1/538 وحسنه الألباني في صحيح ابن ماجه 2/21 وفي صحيح الترمذي3/ 152",
            },
        ],
    },
    {
        name: " الدعاء إذا تعس المركوب",
        subItems: [
            {
                name: " الدعاء إذا تعس المركوب",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "بِسْمِ اللَّهِ",
                subItemDescription:
                    " أبو داود 4/296 وصححه الألباني في صحيح أبي داود 3/941",
            },
        ],
    },
    {
        name: " دعاء المسافر للمقيم",
        subItems: [
            {
                name: " دعاء المسافر للمقيم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "أَسْتَوْدِعُكُمُ اللَّهَ الَّذِي لاَ تَضِيعُ وَدَائِعُهُ",
                subItemDescription:
                    " أحمد 2/403 وابن ماجه 2/943 وانظر صحيح ابن ماجة2/ 133",
            },
        ],
    },
    {
        name: "دعاء المقيم للمسافر",
        subItems: [
            {
                name: "دعاء المقيم للمسافر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أَسْتَوْدِعُ اللَّهَ دِينَكَ، وَأَمَانَتَكَ، وَخَوَاتِيمَ عَمَلِكَ",
                subItemDescription: " أحمد 2/7 الترمذي5/499  وانظر صحيح الترمذي3/ 155",
            },
            {
                name: "دعاء المقيم للمسافر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَ ذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُ ما كُنْتَ",
                subItemDescription: " الترمذي وانظر صحيح الترمذي3/ 155",
            },
        ],
    },
    {
        name: " التكبير والتسبيح في سير السفر",
        subItems: [
            {
                name: " التكبير والتسبيح في سير السفر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "قَالَ جَابِرٌ رضي الله عنه: كُنَّا إِذَا صَعَدْنَا كَبَّرْنَا، وَإِذَا نَزَلْنَا سَبَّحْنَا.",
                subItemDescription: " البخاري الفتح6/ 135",
            },
        ],
    },
    {
        name: "دعاء المسافر إذا أسحر",
        subItems: [
            {
                name: "دعاء المسافر إذا أسحر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "سَمَّعَ سَامِعٌ بِحَمْدِ اللَّهِ، وَحُسْنِ بَلاَئِهِ عَلَيْنَا، رَبَّنَا صاحِبْنَا، وَأَفْضِلْ عَلَيْنَا، عَائِذاً بِاللَّهِ مِنَ النَّارِ",
                subItemDescription:
                    "ومعني سمع سامع : أي شهد شاهد على حمدنا لله تعالى على نعمه وحسن بلائه . ومعني سمع سامع : بلغ سامع قولي هذا لغيره وقال مثله تنبيهاً على الذكر في السحر والدعاء . وقوله : ربنا صاحبنا وأفضل علينا : أي احفظنا وحطنا واكلأنا وأفضل علينا بجزيل نعمك واصرف عنا كل مكروه ، شرح النووي 17/39\n مسلم4/ 2086",
            },
        ],
    },
    {
        name: " الدعاء إذا نزل منزلا في سفر أو غيره",
        subItems: [
            {
                name: " الدعاء إذا نزل منزلا في سفر أو غيره",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
                subItemDescription: "رواه مسلم4/2080",
            },
        ],
    },
    {
        name: " ذكر الرجوع من السفر",
        subItems: [
            {
                name: " ذكر الرجوع من السفر",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName: "((يُكَبِّرُ عَلَى كُلِّ شَرَفٍ ثَلاَثَ تَكْبِيرَاتٍ,",
                subItemDescription:
                    " كان النبي ﷺ يقوله إذا قفل من غزو أو حج \nالبخاري 7/163 ومسلم 2/ 980",
            },
            {
                name: " ذكر الرجوع من السفر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "ثُمَّ يَقُولُ: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنا حَامِدُونَ، صَدَقَ اللَّهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزابَ وَحْدَهُ)).",
                subItemDescription:
                    " كان النبي ﷺ يقوله إذا قفل من غزو أو حج \nالبخاري 7/163 ومسلم 2/ 980",
            },
        ],
    },
    {
        name: " ما يقول ويفعل من أتاه أمر يسره أو يكرهه",
        subItems: [
            {
                name: " ما يقول ويفعل من أتاه أمر يسره أو يكرهه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " كَانَ النَّبِيُّ ﷺ إِذَا أَتَاهُ الْأَمْرُ يَسُرُّهُ قَالَ: الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ وَإِذَا أَتَاهُ الْأَمْرُ يَكْرَهُهُ قَالَ: الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ.",
                subItemDescription:
                    " أخرجه ابن السني في عمل اليوم والليلة والحاكم وصححه 1/499 وصححه الألباني في صحيح الجامع 4/ 201",
            },
        ],
    },
    {
        name: " فضل الصلاة على النبي ﷺ",
        subItems: [
            {
                name: " فضل الصلاة على النبي ﷺ",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " قَالَ النَّبِيُّ ﷺ: مَنْ صَلَّى عَلَيَّ صَلاَةً صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْراً.",
                subItemDescription: " أخرجه مسلم 1/288",
            },
            {
                name: " فضل الصلاة على النبي ﷺ",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: لاَ تَجْعَلُوا قَبْرِي عِيداً وَصَلُّوا عَلَيَّ؛ فَإِنَّ صَلاَتَكُم تَبْلُغُنِي حَيْثُ كُنْتُمْ.",
                subItemDescription:
                    " أبو داود 2/218 وأحمد 2/367 وصححه الألباني في صحيح أبي داود 2/ 383",
            },
            {
                name: " فضل الصلاة على النبي ﷺ",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: الْبَخِيلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ.",
                subItemDescription:
                    "الترمذي 5/551 وغيره وانظر صحيح الجامع 3/ 25 وصحيح الترمذي 3/ 177",
            },
            {
                name: " فضل الصلاة على النبي ﷺ",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَقَالَ ﷺ:إِنَّ لِلَّهِ مَلاَئِكَةً سَيَّاحِينَ فِي الْأَرْضِ يُبَلِّغُونِي مِنْ أُمَّتِي السَّلاَمَ.",
                subItemDescription:
                    "النسائي ،والحاكم 2/421 وصححه الألباني في صحيح النسائي 1/274",
            },
            {
                name: " فضل الصلاة على النبي ﷺ",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَيَّ إِلاَّ رَدَّ اللَّهُ عَلَيَّ رُوحِيَ حَتَّى أَرُدَّ عَلَيْهِ السَّلاَمَ.",
                subItemDescription:
                    " أبو داود برقم 2041وحسنه الألباني في صحيح أبي داود 1/ 383",
            },
        ],
    },
    {
        name: " إفشاء السلام",
        subItems: [
            {
                name: " إفشاء السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    ' قال رسول الله ﷺ :" لا تدخلوا الجنة حتى تؤمنوا ، ولا تؤمنوا حتى تحابوا ، أو لا أدلكم على شيءٍ إذا فعلتموه تحاببتم ، أفشوا السلام بينكم "',
                subItemDescription: "مسلم 1/74 وغيره",
            },
            {
                name: " إفشاء السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "ثَلاَثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الْإِيمَانَ: الْإِنْصَافُ مِنْ نَفْسِكَ، وَبَذْلُ السَّلاَمِ لِلْعَالَمِ، وَالْإِنْفَاقُ مِنَ الإِقْتَارِ.",
                subItemDescription:
                    " البخاري مع الفتح 1/ 82 عن عمار رضي الله عنه موقوفاً معلقاً",
            },
            {
                name: " إفشاء السلام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَعَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ رَضِيَ اللَّهُ عَنْهُمَا: أنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ أيُّ الْإِسْلاَمِ خَيْرٌ قَالَ: تُطْعِمُ الطَّعَامَ، وَتَقْرأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ.",
                subItemDescription: " البخاري مع الفتح 1/55 ومسلم 1/65.",
            },
        ],
    },
    {
        name: " كيف يرد السلام على الكافر إذا سلم",
        subItems: [
            {
                name: " كيف يرد السلام على الكافر إذا سلم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إذَا سَلَّمَ عَلَيْكُمْ أَهْلُ الْكِتَابِ فَقُولُوا: وَعَلَيْكُمْ",
                subItemDescription: " البخاري مع الفتح11/42 ،ومسلم 4/1705",
            },
        ],
    },
    {
        name: "دعاء صياح الديك ونهيق الحمار",
        subItems: [
            {
                name: "دعاء صياح الديك ونهيق الحمار",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ؛ فَإِنَّهَا رَأَتْ مَلَكاً وَإِذَا سَمِعْتُمْ نَهِيقَ الْحِمَارِ فَتَعَوَّذُوا بِاللَّهِ مِنَ الشَّيطَانِ؛ فَإِنَّهُ رَأَى شَيْطَاناً",
                subItemDescription: " البخاري مع الفتح6/350 ،ومسلم 4/2092",
            },
        ],
    },
    {
        name: " دعاء نباح الكلاب بالليل",
        subItems: [
            {
                name: " دعاء نباح الكلاب بالليل",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِذَا سَمِعْتُمْ نُبَاحَ الْكِلاَبِ وَنَهِيقَ الْحَمِيرِ بِاللَّيْلِ فَتَعَوَّذُوا بِاللَّهِ مِنْهُنَّ؛ فَإِنَّهُنَّ يَرَيْنَ مَا لاَ تَرَوْنَ",
                subItemDescription:
                    " أبو داود 4/ 327 وأحمد 3/ 306 وصححه الألباني في صحيح أبي داود3/ 961",
            },
        ],
    },
    {
        name: "الدعاء لمن سببته",
        subItems: [
            {
                name: "الدعاء لمن سببته",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " قَالَ النَّبِيُّ ﷺ: اللَّهُمَّ فَأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إِلَيْكَ يَوْمَ الْقِيَامَةِ.",
                subItemDescription:
                    " البخاري مع الفتح 11/ 171 و مسلم4/ 2007 ولفظه فاجعلها له زكاة ورحمة",
            },
        ],
    },
    {
        name: "ما يقول المسلم إذا مدح المسلم",
        subItems: [
            {
                name: "ما يقول المسلم إذا مدح المسلم",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " قَالَ النَّبِيُّ ﷺ: إِذَا كَانَ أَحَدُكُم مَادِحاً صَاحِبَهُ لاَ مَحَالَةَ فَلْيَقُلْ: أَحْسِبُ فُلاَناً وَاللَّهُ حَسِيبُهُ، وَلاَ أُزَكِّي عَلَى اللَّهِ أَحَداً، أَحْسِبُهُ – إِنْ كَانَ يَعْلَمُ ذَاكَ – كَذَا وَكَذَا.",
                subItemDescription: "رواه مسلم 4/2296",
            },
        ],
    },
    {
        name: " ما يقول المسلم إذا زكي",
        subItems: [
            {
                name: " ما يقول المسلم إذا زكي",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "اللَّهُمَّ لاَ تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَاغْفِرْ لِي مَا لاَ يَعْلَمُونَ، [وَاجْعَلْنِي خَيْراً مِمَّا يَظُّنُّونَ]",
                subItemDescription:
                    " البخاري في الأدب المفرد برقم 761 ، وصحح إسناده الألباني في صحيح الأدب المفرد برقم 585 ، وما بين المعكوفين زيادة للبيهقي في شعب الإيمان 4/ 228 من طريق آخر .",
            },
        ],
    },
    {
        name: " كيف يلبي المحرم في الحج أو العمرة",
        subItems: [
            {
                name: " كيف يلبي المحرم في الحج أو العمرة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ، وَالنِّعْمَةَ، لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ",
                subItemDescription: "البخاري مع الفتح 3/ 408 ، ومسلم 2/841",
            },
        ],
    },
    {
        name: "التكبيرة إذا أتي الركن الأسود",
        subItems: [
            {
                name: "التكبيرة إذا أتي الركن الأسود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "طَافَ النَّبيُّ ﷺ بِالْبَيْتِ عَلَى بَعِيرٍ كُلَّمَا أَتَى الرُّكْنَ أَشَارَ إِلَيْهِ بِشَيْءٍ عِنْدَهُ وَكَبَّرَ",
                subItemDescription:
                    " البخاري مع الفتح 3/476 ،والمراد بالشيء المحجن انظر : البخاري مع الفتح 3/472.",
            },
        ],
    },
    {
        name: "الدعاء بين الركن اليماني والحجر الأسود",
        subItems: [
            {
                name: "الدعاء بين الركن اليماني والحجر الأسود",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "﴿رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ﴾",
                subItemDescription:
                    " أبو داود 2/ 179 وأحمد 3/411 والبغوي في شرح السنة 7/128 ،وحسنه الألباني في صحيح أبي داود 1/ 354 ، والآية من سورة البقرة ، 201",
            },
        ],
    },
    {
        name: "دعاء الوقوف على الصفا والمروة",
        subItems: [
            {
                name: "دعاء الوقوف على الصفا والمروة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأَ: ﴿إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَآئِرِ اللَّهِ﴾ أَبْدَأُ بِمَا بَدَأَ اللَّهُ بِهِ فَبَدَأَ بِالصَّفَا فَرَقِيَ عَلَيْهِ حَتَّى رَأَى الْبَيْتَ، فَاسْتَقْبَلَ الْقِبْلَةَ، فَوَحَّدَ اللَّهَ وَكبَّرَهُ وَقَالَ: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذلكَ. قَالَ مِثْلَ هَذَا ثَلاَثَ مَرَّاتٍ الْحَدِيثُ. وَفِيهِ: فَفَعَلَ عَلَى الْمَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا.",
                subItemDescription:
                    ' قال مثل هذا ثلاث مرات " الحديث وفيه " ففعل على المروة كما فعل على الصفا\n2/888',
            },
        ],
    },
    {
        name: "الدعاء يوم عرفة",
        subItems: [
            {
                name: "الدعاء يوم عرفة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " قَالَ النَّبِيُّ ﷺ: خَيْرُ الدُّعَاءِ دُعَاءُ يَوْمِ عَرَفَةَ، وَخَيْرُ مَا قُلْتُ أَنَا وَالنَّبيُّونَ مِنْ قَبْلِي: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.",
                subItemDescription:
                    " الترمذي وحسنه الألباني في صحيح الترمذي 3/184، وفي الحديث الصحيحة 4/6",
            },
        ],
    },
    {
        name: "الذكر عند المشعر الحرام",
        subItems: [
            {
                name: "الذكر عند المشعر الحرام",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " رَكِبَ النَّبِيُّ ﷺ الْقَصْوَاءَ حَتَّى أَتَى الْمَشْعَرَ الْحَرَامَ فَاسْتَقْبَلَ الْقِبْلَةَ فَدَعَاهُ، وَكَبَّرَهُ، وَهَللَّهُ، وَوَحَّدَهُ فَلَمْ يَزَلْ وَاقِفاً حَتَّى أَسْفَرَ جِدَّاً فَدَفَعَ قَبْلَ أَنْ تَطْلُعَ الشَّمسُ.",
                subItemDescription: " مسلم 2/891",
            },
        ],
    },
    {
        name: "التكبيرة عند رمي الجمار مع كل حصاة",
        subItems: [
            {
                name: "التكبيرة عند رمي الجمار مع كل حصاة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الْجِمَارِ الثَّلاَثِ، ثُمَّ يَتَقَدَّمُ، ويَقِفُ يَدْعُو مُسْتَقْبِلَ الْقِبلَةِ، رَافِعاً يَدَيْهِ بَعْدَ الْجَمْرَةِ الْأُولَى وَالثَّانِيَةِ. أَمَّا جَمْرَةُ الْعَقَبَةِ فَيَرْمِيهَا وَيُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ وَيَنْصَرِفُ وَلاَ يَقِفُ عِنْدَهَا",
                subItemDescription:
                    " البخاري مع الفتح 3/583 و3/584 وانظر لفظه هناك . والبخاري مع الفتح 3/581 ورواه مسلم أيضاً",
            },
        ],
    },
    {
        name: "ما يقول عند التعجب والأمر السار",
        subItems: [
            {
                name: "ما يقول عند التعجب والأمر السار",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "سُبْحَانَ اللَّهِ",
                subItemDescription: " البخاري مع الفتح 1/210 و390 و414 ومسلم 4/ 1857.",
            },
            {
                name: "ما يقول عند التعجب والأمر السار",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "اللَّهُ أَكْبَرُ",
                subItemDescription:
                    "البخاري الفتح8/ 441 وانظر صحيح الترمذي 2/103 و2/235 ومسند أحمد 5/ 218",
            },
        ],
    },
    {
        name: "ما يفعل من أتاه أمر يسره",
        subItems: [
            {
                name: "ما يفعل من أتاه أمر يسره",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "كَانَ النَّبيُّ ﷺ إِذَا أَتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ خَرَّ سَاجِداً شُكْراً لِلَّهِ تَبَارَكَ وَتَعَالَى",
                subItemDescription:
                    " رواه أهل السنن إلا النسائي . انظر صحيح ابن ماجه 1/ 233 وإرواء الغليل 2/226",
            },
        ],
    },
    {
        name: " ما يقول من أحس وجعاً في جسده",
        subItems: [
            {
                name: " ما يقول من أحس وجعاً في جسده",
                repTime: "ثلاث مرات",
                count: 3,
                subItemName:
                    "ضَعْ يَدَكَ عَلَى الَّذِي تَألَّمَ مِنْ جَسَدِكَ وَقُلْ: بِسْمِ اللَّهِ، ثَلاَثاً،",
                subItemDescription: "مسلم 4/1727",
            },
            {
                name: " ما يقول من أحس وجعاً في جسده",
                repTime: "سبع مرات",
                count: 7,
                subItemName:
                    "وَقُلْ سَبْعَ مَرَّاتٍ: أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ",
                subItemDescription: "مسلم 4/1728",
            },
        ],
    },
    {
        name: "دعاء من خشي أن يصيب شيئاً بعينه",
        subItems: [
            {
                name: "دعاء من خشي أن يصيب شيئاً بعينه",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِذَا رَأَى أَحَدُكُم مِنْ أَخِيهِ، أَوْ مِنْ نَفْسِهِ، أَوْ مِنْ مَالِهِ مَا يُعْجِبُهُ [فَلْيَدْعُ لَهُ بِالْبَرَكَةِ] فَإِنَّ الْعَيْنَ حَقٌّ",
                subItemDescription:
                    "مسند أحمد 4/447 وابن ماجه ومالك ، وصححه الألباني في صحيح الجامع 1/212 وانظر تحقيق زاد المعاد للأرناؤوط 4/170",
            },
        ],
    },
    {
        name: "ما يقال عند الفزع",
        subItems: [
            {
                name: "ما يقال عند الفزع",
                repTime: "مرة واحدة",
                count: 1,
                subItemName: "لاَ إِلَهَ إِلاَّ اللَّهُ",
                subItemDescription: "البخاري مع الفتح 6/ 181 ، ومسلم 4/ 2208 .",
            },
        ],
    },
    {
        name: "ما يقول عند الذبح أو النحر",
        subItems: [
            {
                name: "ما يقول عند الذبح أو النحر",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "بِسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ وَلَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
                subItemDescription:
                    "مسلم 3/1557 والبيهقي 9/287 وما بين المعكوفين للبيهقي 9/287 وغيره والجملة الأخيرة سقتها بالمعنى من رواية مسلم .",
            },
        ],
    },
    {
        name: " ما يقول لرد كيد مردة الشياطين",
        subItems: [
            {
                name: " ما يقول لرد كيد مردة الشياطين",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "أَعُوذُ بكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لاَ يُجَاوِزُهُنَّ بَرٌّ وَلاَ فَاجِرٌ: مِنْ شَرِّ مَا خَلَقَ، وَبَرَأَ وَذَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلاَّ طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
                subItemDescription:
                    " أحمد 3/419 بإسناد صحيح وابن السني برقم 637 وصحح إسناده الأرناؤوط في تخريجه للطحاوية ص 133 وانظر مجمع الزوائد 10/ 127.",
            },
        ],
    },
    {
        name: " الاستغفار والتوبة",
        subItems: [
            {
                name: " الاستغفار والتوبة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " قَالَ رَسُولُ اللَّهِ ﷺ: وَاللَّهِ إِنِّي لأَسْتَغفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ أَكْثَرَ مِنْ سَبْعِينَ مَرَّةٍ.",
                subItemDescription: " البخاري مع الفتح 11/101",
            },
            {
                name: " الاستغفار والتوبة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَقَالَ ﷺ: يَا أَيُّهَا النَّاسُ تُوبُوا إِلَى اللَّهِ فَإِنِّي أَتُوبُ فِي الْيَوْمِ إِلَيْهِ مِائَةَ مَرَّةٍ.",
                subItemDescription: "مسلم 4/2076",
            },
            {
                name: " الاستغفار والتوبة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَقَالَ ﷺ: مَنْ قَالَ أَسْتَغْفِرُ اللَّهَ الْعَظيمَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيّوُمُ وَأَتُوبُ إِلَيهِ، غَفَرَ اللَّهُ لَهُ وَإِنْ كَانَ فَرَّ مِنَ الزَّحْفِ.",
                subItemDescription:
                    "أخرجه أبو داود 2/85 والترمذي 5/569 والحاكم وصححه ووافقه الذهبي 1/511 وصححه الألباني . انظر صحيح الترمذي 3/182 وجامع الأصول لأحاديث الرسول صلى الله عيه وسلم 4/389 ï¿½ 390 بتحقيق الأرناؤوط",
            },
            {
                name: " الاستغفار والتوبة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: أَقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ الْعَبْدِ فِي جَوْفِ اللَّيْلِ الآخِرِ فَإِنِ اسْتَطَعْتَ أَنْ تَكُونَ مِمَّنْ يَذْكُرُ اللَّهَ فِي تِلْكَ السَّاعَةِ فَكُنْ.",
                subItemDescription:
                    " أخرجه الترمذي والنسائي 1/279 والحاكم وانظر صحيح الترمذي 3/183 وجامع الأصول بتحقيق الأرناؤوط 4/144",
            },
            {
                name: " الاستغفار والتوبة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَقَالَ ﷺ: أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكثِرُوا الدُّعَاءَ.",
                subItemDescription: "مسلم 1/350 .",
            },
            {
                name: " الاستغفار والتوبة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَقَالَ ﷺ: إِنَّهُ لَيُغَانُ عَلَى قَلْبِي وَإِنِّي لأَسْتَغْفِرُ اللَّهَ فِي الْيَوْمِ مِائَةَ مَرَّةٍ.",
                subItemDescription:
                    " أخرجه مسلم 4/2075 قال ابن الأثير : ( ليُغان على قلبي ) أي ليغطى ويغشى والمراد : السهو ؛ لأنه كان صلى الله عيه وسلم لا يزال في مزيد من الذكر والقربة ودوام المراقبة فإذا سها عن شيء منها في بعض الأوقات ،أو نسي ،عدهُ ذنباً على نفسه ففزع إلى الاستغفار . انظر جامع الأصول 4/386",
            },
        ],
    },
    {
        name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
        subItems: [
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "قَالَ ﷺ مَنْ قَالَ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْر.",
                subItemDescription:
                    " البخاري 7/168 ومسلم 4/ 2071 ، وانظر :فضل من قالها مائة مرة إذا أصبح وإذا أمسى  ",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَقَالَ ﷺ: مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أَعْتَقَ أَرْبَعَةَ أَنْفُسٍ مِنْ وَلَدِ إِسْمَاعِيلَ.",
                subItemDescription:
                    "بخاري 7/67 ومسلم بلفظه 4/2071 وانظر فضل من قالها في اليوم مائة مرة",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الْمِيزَانِ، حَبِيبَتَانِ إِلَى الرَّحْمَنِ: سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحانَ اللَّهِ الْعَظِيمِ.",
                subItemDescription: " البخاري 7/167ومسلم 4/2072",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "وَقَالَ ﷺ: لَأَنْ أَقُولَ سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ، أَحَبُّ إِلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمسُ.",
                subItemDescription: "مسلم 4/2072",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: أَيَعْجِزُ أَحَدُكُم أَنْ يَكْسِبَ كُلَّ يَوْمٍ أَلْفَ حَسَنَةٍ فَسَأَلَهُ سَائِلٌ مِنْ جُلَسَائِهِ كَيْفَ يَكْسِبُ أَحَدُنَا أَلْفَ حَسَنَةٍ؟ قَالَ: يُسَبِّحُ مِائَةَ تَسْبِيحَةٍ، فَيُكتَبُ لَهُ أَلْفُ حَسَنَةٍ أَوْ يُحَطُّ عَنْهُ أَلْفُ خَطِيئَةٍ.",
                subItemDescription: " مسلم 4/2073",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "مَنْ قَالَ: سُبْحَانَ اللَّهِ الْعَظِيمِ وَبِحَمْدِهِ غُرِسَتْ لَهُ نَخْلَةٌ فِي الْجَنَّةِ",
                subItemDescription:
                    "أخرجه الترمذي 5/511 والحاكم 1/501 وصححه ووافقه الذهبي ، وانظر صحيح الجامع 5/531 وصحيح الترمذي 3/160 .",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ أَلاَ أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ؟ فَقُلْتُ: بَلَى يَا رَسُولَ اللَّهِ، قَالَ: قُلْ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ.",
                subItemDescription: " البخاري مع الفتح 11/ 213 ومسلم 4/2076",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " وَقَالَ ﷺ: أَحَبُّ الْكَلاَمِ إِلَى اللَّهِ أَرْبَعٌ: سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكْبَرُ، لاَ يَضُرُّكَ بِأَيِّهِنَّ بَدَأتَ.",
                subItemDescription: " مسلم 3/1685",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ ﷺ فَقَالَ: عَلِّمْنِي كَلاماً أَقُولُهُ: قَالَ: قُلْ: لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، اللَّهُ أَكْبَرُ كَبِيراً، وَالْحَمْدُ لِلَّهِ كَثِيراً، سُبْحَانَ اللَّهِ رَبِّ العَالَمِينَ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَزِيزِ الْحَكِيمِ قَالَ: فَهَؤُلاَءِ لِرَبِّي، فَمَا لِي؟ قَالَ: قُلْ: اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَارْزُقْنِي.",
                subItemDescription:
                    'مسلم 4/ 2072 وزاد أبو داود : فلما ولى الأعرابي قال النبي ﷺ :" لقد ملأ يديه من الخير "1/ 220 .',
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "كَانَ الرَّجُلُ إِذَا أَسْلَمَ عَلَّمَهُ النَّبيُّ ﷺ الصَّلاَةَ ثُمَّ أَمَرَهُ أَنْ يَدْعُوَ بِهَؤُلاَءِ الْكَلِمَاتِ: اللَّهُمَّ اغْفِرِ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَعَافِنِي وَارْزُقْنِي.",
                subItemDescription:
                    ' مسلم 4/2073 وفي رواية لمسلم " فإن هؤلاء تجمع لك ديناك وآخرتك "',
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "إِنَّ أَفْضَلَ الدُّعَاءِ الْحَمْدُ لِلَّهِ، وَأَفْضَلَ الذِّكْرِ لاَ إِلَهَ إِلاَّ اللَّهُ.",
                subItemDescription:
                    "الترمذي 5/462 وابن ماجه 2/1249 والحاكم 1/503 وصححه ووافقه الذهبي وانظر صحيح الجامع 1/ 362",
            },
            {
                name: " فضل التسبيح والتحميد ، والتهليل ، والتكبير",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " الباقيات الصالحات : سبحان الله والحمد لله ، ولا إله إلا الله ،والله أكبر ،و لا حول ولا قوة إلا بالله",
                subItemDescription:
                    " أحمد برقم 513 بترتيب أحمد شاكر وإسناده صحيح وانظر مجمع الزوائد 1/297، وعزاه ابن حجر في بلوغ المرام من رواية أبي سعيد إلىالنسائي وقال :صححه ابن حبان والحاكم",
            },
        ],
    },
    {
        name: " كيف كان النبي ﷺ يسبح ؟",
        subItems: [
            {
                name: " كيف كان النبي ﷺ يسبح ؟",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    " عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو رضي الله عنه قَالَ: رَأَيْتُ النَّبيَّ ﷺ يَعْقِدُ التَّسْبِيحَ وفي زيادةٍ: بِيَمِينِهِ.",
                subItemDescription:
                    "أخرجه أبو داود بلفظه 2/81 والترمذي 5/521 وانظر صحيح الجامع 4/271 برقم 4865",
            },
        ],
    },
    {
        name: "من أنواع الخير والآداب الجامعة",
        subItems: [
            {
                name: "من أنواع الخير والآداب الجامعة",
                repTime: "مرة واحدة",
                count: 1,
                subItemName:
                    "قَالَ النَّبِيُّ ﷺ إِذَا كَانَ جُنْحُ اللَّيْلِ – أَوْ أَمْسَيْتُم – فَـكُفُّوا صِبْيانَـكُم، فَإِنَّ الشَّيَاطِينَ تَنْتَشِرُ حِينَئِذٍ، فَإِذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيلِ فَخَلُّوهُمْ، وَأَغْلِقُوا الأَبْوَابَ وَاذْكُرُوا اسْمَ اللَّهِ؛ فَإِنَّ الشَّيطَانَ لاَ يَفْتَحُ بَاباً مُغلَقاً، وَأَوْكُوا قِرَبَكُمْ، وَاذْكُرُوا اسْمَ اللَّهِ، وَخَمِّرُوا آنِيَتَكُم، وَاذْكُرُوا اسْمَ اللَّهِ، وَلَوْ أَنْ تَعْرُضُوا عَلَيْهَا شَيْئاً، وَأَطْفِئُوا مَصَابِيحَكُمْ.",
                subItemDescription: "البخاري مع الفتح 10/ 88 ومسلم 3/1595.",
            },
        ],
    },
];
export const getItems = () => {
    return items;
  };
  