// ⚠️ AUTO-GENERATED FILE — DO NOT EDIT
export const names = [
  {
    "id": 1,
    "name": "الله ",
    "referer": "هو أكبر الأسماء وأجمع معانيها، وبه ابتدأ الله كتابه الكريم، فقال { بسم الله }",
    "description": "أنه أول أسماء الله، وأعظمها، وأعمها مدلولاً، وأنه لم يتسم به أحد من البشر، وأنه الذي يُفتتح به أمور الخير، تبركاً وتيمناً، وأنه إذا ارتفع من الأرض قامت الساعة .",
    "SuraName": "الفاتحة",
    "AyaNumber": 1
  },
  {
    "id": 2,
    "name": "الأحد ",
    "referer": "ورد في قوله تعالى: { قل هو الله أحد }",
    "description": " ومعناه: هو الذي لا شبيه له، ولا نظير، فهو المتفرد في ذاته وصفاته وأفعاله.",
    "SuraName": "الإخلاص",
    "AyaNumber": 1
  },
  {
    "id": 3,
    "name": "الآخر ",
    "referer": " ورد في قوله تعالى: { هو الأول والآخر }.وفي الحديث: ( وأنت الآخر فليس بعدك شيء ) رواه مسلم ",
    "description": "ومعناه: الذي ليس لوجوده نهاية، بل له الخلود المطلق، والبقاء الدائم، لا يفنى ولا يبيد .",
    "SuraName": "الحديد",
    "AyaNumber": 3
  },
  {
    "id": 4,
    "name": "الأعلى ",
    "referer": "ورد أن النبي - صلى الله عليه وسلم – كان يقول في سجوده: ( سبحان ربي الأعلى ).",
    "description": "ومعناه: الذي علا على كل شيء، فمهما تصور العبد عالياً فالله أعلى منه، فله العلو المطلق في ذاته وصفاته .",
    "SuraName": "رواه مسلم.",
    "AyaNumber": null
  },
  {
    "id": 5,
    "name": "الأكرم",
    "referer": " ورد في قوله تعالى: { اقرأ وربك الأكرم }",
    "description": "ومعناه: الذي لا يوازي كرمه كرم، ولا يعادله في كرمه كريم.",
    "SuraName": "العلق",
    "AyaNumber": 3
  },
  {
    "id": 6,
    "name": "الأول",
    "referer": "ورد في قوله تعالى: { هو الأول }.وفي الحديث: ( أنت الأول فليس قبلك شيء ) رواه مسلم .",
    "description": "ومعناه: الذي ليس لوجوده بداية، فكل ما سواه كائن بعد أن لم يكن .",
    "SuraName": "الحديد",
    "AyaNumber": 3
  },
  {
    "id": 7,
    "name": "البارئ",
    "referer": " ورد في قوله تعالى: { هو الله الخالق البارئ }",
    "description": "وهو في معنى الخالق إلا أنه يدل على مطلق الخلق من غير تقدير .",
    "SuraName": "الحشر",
    "AyaNumber": 24
  },
  {
    "id": 8,
    "name": "الباسط",
    "referer": " ورد في قوله صلى الله عليه وسلم: ( إن الله المسعر القابض الباسط ) رواه الترمذي وصححه .كما قال تعالى: { والله يقبض ويبسط }",
    "description": "ومعناه: الذي يوسع رزقه على من يشاء من عباده",
    "SuraName": "البقرة",
    "AyaNumber": 245
  },
  {
    "id": 9,
    "name": "الباطن",
    "referer": "ورد في قوله تعالى: { هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم }. وورد في قوله – صلى الله عليه وسلم -: ( وأنت الباطن فليس دونك شيء ) رواه مسلم",
    "description": "ومعناه: المحتجب عن خلقه فلا يرى في الدنيا، وإنما يُعلم وجوده بدلائل خلقه وآثار صنعه.",
    "SuraName": "الحديد",
    "AyaNumber": 3
  },
  {
    "id": 10,
    "name": "البديع",
    "referer": "ورد في قوله تعالى: { بديع السموات والأرض }",
    "description": "ومعناه: الذي خلق الخلق على غير مثال سابق",
    "SuraName": "البقرة",
    "AyaNumber": 117
  },
  {
    "id": 11,
    "name": "البصير",
    "referer": " ورد في قوله تعالى: { وهو السميع البصير }",
    "description": "ومعناه الذي يرى المبصرات، لا يخفى عليه خافية في الأرض ولا في السماء.",
    "SuraName": "الشورى",
    "AyaNumber": 11
  },
  {
    "id": 12,
    "name": "البَرّ ",
    "referer": "ورد في قوله تعالى: { إنا كنا من قبل ندعوه إنه هو البر الرحيم }",
    "description": "ومعناه: العطوف على عباده المحسن إليهم، الذي عم بره وإحسانه جميع خلقه.",
    "SuraName": "الطور",
    "AyaNumber": 28
  },
  {
    "id": 13,
    "name": "التوّاب",
    "referer": " ورد في قوله تعالى: { فتلقى آدم من ربه كلمات فتاب عليه إنه هو التواب الرحيم }",
    "description": "ومعناه: الذي يقبل توبة عباده، وكلما تكررت التوبة تكرر القبول.",
    "SuraName": "البقرة",
    "AyaNumber": 37
  },
  {
    "id": 14,
    "name": "الجبار",
    "referer": "ورد في قوله تعالى: { هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن المهيمن العزيز الجبار }",
    "description": "ومعناه: مأخوذ من الجبر والقهر والتعالي فهو سبحانه: المستعلي المتعاظم الذي لا يخرج أحد عن أمره الكوني وسلطانه القدري، فهو الذي يحيي ويميت، ويرزق ويفقر، ويعز ويذل، ويفعل ما يشاء في خلقه لا راد لأمره، ولا ناقض لقضائه .",
    "SuraName": "الحشر",
    "AyaNumber": 23
  },
  {
    "id": 15,
    "name": "الجليل",
    "referer": "أخذ من قوله تعالى: { ويبقى وجه ربك ذو الجلال والإكرام }",
    "description": "ومعناه: العظيم القدر الرفيع الشأن، الذي يصغر كل جليل دون جلاله وعظمته، ويتضع كل عظيم دون شرفه ومنزلته .",
    "SuraName": "الرحمن",
    "AyaNumber": 27
  },
  {
    "id": 16,
    "name": "الحسيب",
    "referer": "ورد في قوله تعالى: { وكفى بالله حسيباً }",
    "description": " ومعناه: أنه الشريف الذي فاق شرفه كل شرف، والعالم الذي يعلم مقادير الأشياء وأعدادها، والكافي الذي يحفظ ويرزق.",
    "SuraName": "النساء",
    "AyaNumber": 6
  },
  {
    "id": 17,
    "name": "الحافظ",
    "referer": "ورد في قوله تعالى: { فالله خير حافظا }",
    "description": " ومعناه الصائن عبده عن أسباب الهلكة في أمور دينه ودنياه .",
    "SuraName": "يوسف",
    "AyaNumber": 64
  },
  {
    "id": 18,
    "name": "الحفيظ",
    "referer": "ورد في قوله تعالى: { إن ربي على كل شيء حفيظ }",
    "description": "ومعناه: الحافظ، فهو الذي يحفظ السماء أن تقع على الأرض، ويحفظ الأرض أن تهوي، ويحفظ الكواكب أن تصطدم ببعضها، ويحفظ للحياة نظامها، ويحفظ على عباده ما عملوه من خير وشر وطاعة ومعصية .",
    "SuraName": "هود",
    "AyaNumber": 57
  },
  {
    "id": 19,
    "name": "الحق",
    "referer": "ورد في قوله تعالى: { ويعلمون أن الله هو الحق المبين }",
    "description": "ومعناه: الذي لا يسع أحد إنكاره، بل يجب إثباته والاعتراف به، لتظاهر الأدلة على وجوده سبحانه ",
    "SuraName": "النور",
    "AyaNumber": 25
  },
  {
    "id": 20,
    "name": "الحكم",
    "referer": "ورد في الكتاب في قوله تعالى: { حتى يحكم الله بيننا وهو خير   الحاكمين }. وقال - صلى الله عليه وسلم -: ( إن الله هو الحكم وإليه الحكم ) رواه أبو داود.",
    "description": "ومعناه: الذي يفصل بين المتخاصمين بالعدل، ويقضي بين المختلفين بالقسط، ويشرّع الشرائع، ويضع الأحكام .",
    "SuraName": "الأعراف",
    "AyaNumber": 78
  },
  {
    "id": 21,
    "name": "الحكيم",
    "referer": " ورد في قوله تعالى: { قالوا سبحانك لا علم لنا إلا ما علمتنا إنك أنت العليم الحكيم }",
    "description": "ومعناه: الذي يضع الأمور مواضعها، ولا يفعل إلا الصواب، ولا يقول إلا الحق، وأفعاله سديدة، وصنعه متقن .",
    "SuraName": "البقرة",
    "AyaNumber": 32
  },
  {
    "id": 22,
    "name": "الحليم",
    "referer": " ورد في قوله تعالى: { والله غفور حليم }",
    "description": "ومعناه: الذي لا يحبس إنعامه وأفضاله عن عباده لأجل ذنوبهم، بل يرزقهم ويحفظهم ويرشدهم حتى يعودوا إليه ويتوبوا  .",
    "SuraName": "البقرة",
    "AyaNumber": 225
  },
  {
    "id": 23,
    "name": "الحميد",
    "referer": " ورد في قوله تعالى: { وإن الله لهو الغني الحميد }",
    "description": "ومعناه: المحمود الذي استحق الحمد بفعاله، فهو الذي يحمد في السراء والضراء، وفي الشدة والرخاء، وأفعاله لا تخرج عن مقتضى الحكمة والرحمة والعدل . ",
    "SuraName": "الحج",
    "AyaNumber": 64
  },
  {
    "id": 24,
    "name": "الحي",
    "referer": "ورد في قوله تعالى: { الله لا إله إلا هو الحي القيوم }",
    "description": "ومعناه: أنه ذو الحياة التامة الكاملة – سبحانه - فحياته ذاتية أزلية، لم يسبقها موت ولا عدم، على خلاف سائر الأحياء . واسم الحي يتضمن جميع الصفات الذاتية كالعلم والقدرة والإرادة وغيرها.",
    "SuraName": "البقرة",
    "AyaNumber": 255
  },
  {
    "id": 25,
    "name": "الخالق",
    "referer": "ورد في قوله تعالى: { هو الله الخالق البارئ المصور }",
    "description": "ومعناه: مأخوذ من الخلق وهو الإيجاد والتقدير فالله سبحانه هو الذي قدّر الأشياء قبل وجودها، وأخرجها من العدم إلى الوجود .",
    "SuraName": "الحشر",
    "AyaNumber": 24
  },
  {
    "id": 26,
    "name": "الخبير",
    "referer": "ورد في قوله تعالى: { وهو الحكيم الخبير }",
    "description": "ومعناه: الذي انتهى علمه إلى الإحاطة ببواطن الأشياء وخفاياها كما أحاط بظواهرها .",
    "SuraName": "الأنعام",
    "AyaNumber": 18
  },
  {
    "id": 27,
    "name": "الخلاّق ",
    "referer": "ورد في قوله تعالى: { إن ربك هو الخلاق العليم }",
    "description": "وهو في معنى الخالق ويزيد عليه في دلالته على كثرة خلق الله واتساعه.",
    "SuraName": "الحجر",
    "AyaNumber": 86
  },
  {
    "id": 28,
    "name": "الديّان ",
    "referer": "ورد في قوله - صلى الله عليه وسلم - أن الله ينادي يوم القيامة: ( أنا الملك، أنا الديان ) ",
    "description": "ومعناه: الذي يحاسب عباده ويجازيهم، ولا يضيع عمل عامل منهم.",
    "SuraName": "رواه أحمد.",
    "AyaNumber": null
  },
  {
    "id": 29,
    "name": "ذو الجلال والإكرام",
    "referer": " ورد في قوله تعالى: { تبارك اسم ربك ذي الجلال والإكرام }.وكان من دعاء النبي - صلى الله عليه وسلم - قوله: ( اللهم أنت السلام، ومنك السلام، تباركت يا ذا الجلال والإكرام ) رواه أحمد .",
    "description": "ومعناه: أنه صاحب العظمة والكبرياء والشرف، وأهل الكرم والسعة والجود. ",
    "SuraName": "الرحمن",
    "AyaNumber": 78
  },
  {
    "id": 30,
    "name": "الرؤوف ",
    "referer": "ورد في قوله تعالى: { إن الله بالناس لرءوف رحيم }",
    "description": "ومعناه: مريد التخفيف عن عباده.",
    "SuraName": "البقرة",
    "AyaNumber": 143
  },
  {
    "id": 31,
    "name": "الرّازق ",
    "referer": "ورد في قوله تعالى: { وإن الله لهو خير الرازقين }",
    "description": "ومعناه: المتفضل على عباده بما يحتاجون إليه لقوام حياتهم.",
    "SuraName": "الحج",
    "AyaNumber": 58
  },
  {
    "id": 32,
    "name": "الرب",
    "referer": " ورد في قوله تعالى: { الحمد لله رب العالمين }",
    "description": "ومعناه: أنه الذي خلق الخلق، ونشّأهم، ويسر لهم أسباب الرزق والحياة.",
    "SuraName": "الفاتحة",
    "AyaNumber": 2
  },
  {
    "id": 33,
    "name": "الرحمن ",
    "referer": " ورد في قوله تعالى: { وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم }",
    "description": "وهو اسم اختص به سبحانه فلا يجوز أن يتسمى به غيره، وهو مشتق من الرحمة على صيغة المبالغة، ومعناه: ذو الرحمة التي لا نظير له فيها، فرحمته وسعت كل شيء من كافر، ومؤمن، وحجر، وشجر، وجميع خلقه .",
    "SuraName": "البقرة",
    "AyaNumber": 168
  },
  {
    "id": 34,
    "name": "الرحيم ",
    "referer": " ورد في قوله تعالى: { وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم }",
    "description": "و\"الرحيم\" في اللغة من صيغ المبالغة، فعيل بمعنى فاعلٍ كسَمِيعٌ بمعنى سامِع، وهو يدلَّ على صفة الرحمة الخاصة التي ينالها المؤمنون، والرحمة الخاصة التي دلّ عليها اسمه الرحيم شملت عباده المؤمنين في الدنيا والآخرة فقد هداهم إلى توحيده وعبوديته في الدنيا، وأكرمهم في الآخرة بجنته، ومنَّ عليهم في النعيم برؤيته.",
    "SuraName": "البقرة",
    "AyaNumber": 169
  },
  {
    "id": 35,
    "name": "الرزاق ",
    "referer": "ورد في قوله تعالى: { إن الله هو الرزاق ذو القوة المتين }",
    "description": "ومعناه: المتكفل بالرزق، والقائم على كل نفس بما يقيمها من قوتها . والفرق بين اسم ( الرازق ) و ( الرزاق ) أن الثاني على صيغة المبالغة التي تقتضي تكرار الرزق وكثرته ودوامه.",
    "SuraName": "الذاريات",
    "AyaNumber": 58
  },
  {
    "id": 36,
    "name": "الرقيب",
    "referer": " ورد في قوله تعالى: { فلما توفيتني كنت أنت الرقيب عليهم }",
    "description": "ومعناه: الذي لا يغفل عما خلق بل يحفظ خلقه ولا يغيب عنه منهم شيء.",
    "SuraName": "المائدة",
    "AyaNumber": 117
  },
  {
    "id": 37,
    "name": "السبوح",
    "referer": " ورد عن النبي - صلى الله عليه وسلم - أنه كان يقول في ركوعه : ( سبوح قدوس رب الملائكة والروح ).",
    "description": "ومعناه: تنزيه الله عن كل ما لا يليق به من العيوب والنقائص.",
    "SuraName": " رواه مسلم.",
    "AyaNumber": null
  },
  {
    "id": 38,
    "name": "السلام",
    "referer": "ورد في قوله تعالى: { هو الله الذي لا إله إلا هو الملك القدوس السلام }",
    "description": "واسم السلام يحمل معنيين: الأول: أنه ذو السلامة أي: البراءة من العيوب والنقائص. والثاني: أن العباد سلموا من ظلمه فهو – سبحانه - الحكم العدل الذي حرّم الظلم على نفسه، وجعله بين عباده محرماً .",
    "SuraName": "الحشر",
    "AyaNumber": 23
  },
  {
    "id": 39,
    "name": "السميع ",
    "referer": "ورد في قوله تعالى: { إن الله هو السميع البصير }",
    "description": "ومعناه: الذي يسمع كل الأصوات صغيرها وكبيرها، سرّها وجهرها، فيسمع دبيب النملة السوداء في الصخرة الصماء في الليلة الظلماء لا يخفى عليه شيء في الأرض ولا في السماء .",
    "SuraName": "غافر",
    "AyaNumber": 20
  },
  {
    "id": 40,
    "name": "الشافي ",
    "referer": "ورد في قوله - صلى الله عليه وسلم - : ( اللهم رب الناس، مذهب البأس، اشف أنت الشافي ).",
    "description": "ومعناه: المبريء من الأمراض كلها، وأن كل ما يقع من الدواء والتداوي هو من قبيل التسبب، وأن الشافي على الحقيقة هو الله.",
    "SuraName": " متفق عليه .",
    "AyaNumber": null
  },
  {
    "id": 41,
    "name": "الشاكر ",
    "referer": " ورد في قوله تعالى: {وكان الله شاكراً عليماً }",
    "description": "ومعناه: المادح والمثني لمن يطيعه، والمثيب على الطاعة بأكثر منها.",
    "SuraName": "النساء",
    "AyaNumber": 147
  },
  {
    "id": 42,
    "name": "الشكور ",
    "referer": "ورد في قوله تعالى: { إنه غفور شكور }",
    "description": "ومعناه: الذي يشكر على يسير الطاعة، ويثيب عليها بأضعافها.",
    "SuraName": "فاطر",
    "AyaNumber": 30
  },
  {
    "id": 43,
    "name": "الشهيد ",
    "referer": "ورد في قوله تعالى: { وكفى بالله شهيدا }",
    "description": "ومعناه: المطلع على ما لا يعلمه المخلوقون إلا بالحضور.",
    "SuraName": "النساء",
    "AyaNumber": 79
  },
  {
    "id": 44,
    "name": "الصمد ",
    "referer": "ورد في قوله تعالى: { الله الصمد }",
    "description": " ومعناه: الذي بلغ الغاية في سؤدده وشرفه، وهو الذي تقبل إليه الخلائق لقضاء حاجاتها.",
    "SuraName": "الإخلاص",
    "AyaNumber": 2
  },
  {
    "id": 45,
    "name": "الظاهر ",
    "referer": "ورد في قوله تعالى: { هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم }.وورد في الحديث: ( وأنت الظاهر فليس فوقك شيء ) رواه مسلم.",
    "description": "ومعناه: الذي استعلى على خلقه بذاته، واستعلى عليهم بحججه وآياته، وقهرهم بقوته وسلطانه .",
    "SuraName": "الحديد",
    "AyaNumber": 3
  },
  {
    "id": 46,
    "name": "العزيز ",
    "referer": "ورد في آيات منها قوله تعالى: { وهو العزيز الحكيم }",
    "description": "ومعناه: مأخوذ من المنعة والقوة والشرف فهو سبحانه المنيع الذي لا يغلب، والقوي الذي لا يقهر، والشريف الذي لا يُذَل .",
    "SuraName": "إبراهيم",
    "AyaNumber": 4
  },
  {
    "id": 47,
    "name": "العظيم ",
    "referer": "ورد في قوله تعالى: { له ما في السماوات وما في الأرض وهو العلي العظيم }",
    "description": "ومعناه: ذو العظمة في ذاته وصفاته، فذاته أعظم من كل ذات، وصفاته أعلى من كل الصفات.",
    "SuraName": "الشورى",
    "AyaNumber": 4
  },
  {
    "id": 48,
    "name": "العفو ",
    "referer": " ورد في قوله تعالى: { إن الله كان عفوا غفوراً }. وفي قوله – صلى الله عليه وسلم -: ( اللهم إنك عفو تحب العفو فاعف عنا ) رواه أحمد .",
    "description": "ومعناه: الذي يتجاوز عن الذنوب ويصفح عن فاعليها.",
    "SuraName": "النساء",
    "AyaNumber": 43
  },
  {
    "id": 49,
    "name": "العلي ",
    "referer": "ورد في قوله تعالى: { له ما في السماوات وما في الأرض وهو العلي العظيم }",
    "description": "ومعناه: الذي ليس فوقه أحد فله العلو المطلق في ذاته وصفاته، لا يشاركه فيه أحد .",
    "SuraName": "الشورى",
    "AyaNumber": 4
  },
  {
    "id": 50,
    "name": "العليم ",
    "referer": "ورد في قوله تعالى: { قالوا سبحانك لا علم لنا إلا ما علمتنا إنك أنت العليم الحكيم }",
    "description": "ومعنى العليم أي العالم بكل شيء، لا تخفى عليه خافية في الأرض ولا في السماء.",
    "SuraName": "البقرة",
    "AyaNumber": 32
  },
  {
    "id": 51,
    "name": "الغفّار ",
    "referer": "ورد في قوله تعالى: { رب السماوات والأرض وما بينهما العزيز الغفار }",
    "description": "ومعناه: مأخوذ من الغَفْرِ وهو التغطية فهو سبحانه كثير الستر والتجاوز عن ذنوب عباده وزلاتهم .",
    "SuraName": "ص",
    "AyaNumber": 66
  },
  {
    "id": 52,
    "name": "الغفور ",
    "referer": "ورد في قوله تعالى: { نبئ عبادي أني أنا الغفور الرحيم }",
    "description": "ومعناه: الذي يستر ذنوب خلقه ويتجاوز عنها، فلا يؤاخذ بها، ولا يعاقب عليها.",
    "SuraName": "الحجر",
    "AyaNumber": 49
  },
  {
    "id": 53,
    "name": "الغني ",
    "referer": "ورد في قوله تعالى: { والله هو الغني الحميد }. ومن دعاء النبي: ( اللهم أنت الله لا إله إلا أنت، الغني ونحن الفقراء، أنزل علينا الغيث، واجعل ما أنزلت لنا قوةً وبلاغاً إلى حين ) رواه أبو داود .",
    "description": "هو الكامل الذي لا يحتاج إلى غيره، بل غيره محتاج إليه.",
    "SuraName": "لقمان",
    "AyaNumber": 26
  },
  {
    "id": 54,
    "name": "الفاطر ",
    "referer": " ورد في قوله تعالى: { قل أغير الله أتخذ وليا فاطر السماوات والأرض }",
    "description": "ومعناه: الخالق الذي ابتدع خلق الأشياء وابتدأها وأنشأها وأبتدعها من غير شيء ولا مثال سابق .",
    "SuraName": "الأنعام",
    "AyaNumber": 14
  },
  {
    "id": 55,
    "name": "الفتّاح ",
    "referer": "ورد في قوله تعالى: { قل يجمع بيننا ربنا ثم يفتح بيننا بالحق وهو الفتاح العليم }",
    "description": " ومعناه: الذي يفتح أبواب رحمته على عباده، ويحكم بينهم فيما هم فيه يختلفون.",
    "SuraName": "سبأ",
    "AyaNumber": 26
  },
  {
    "id": 56,
    "name": "القابض",
    "referer": "ورد في قوله صلى الله عليه وسلم: ( إن الله المسعر القابض الباسط ) رواه الترمذي وصححه .",
    "description": "ومعناه: الذي يضيّق الرزق على من يشاء ويقترّه كما قال تعالى: { والله يقبض ويبسط }.",
    "SuraName": "البقرة",
    "AyaNumber": 245
  },
  {
    "id": 57,
    "name": "القادر ",
    "referer": " ورد في قوله تعالى: { قل هو القادر على أن يبعث عليكم عذابا من فوقكم }",
    "description": "ومعناه: المتصف بالقدرة المطلقة فلا يعجزه شيء، ولا يكون في ملكه إلا ما يريد سبحانه .",
    "SuraName": "الأنعام",
    "AyaNumber": 65
  },
  {
    "id": 58,
    "name": "القاهر",
    "referer": " ورد في قوله تعالى: { وهو القاهر فوق عباده وهو الحكيم الخبير }",
    "description": "ومعناه: أنه الذي قهر عباده بما خلقهم عليه من المرض والموت والفقر والذل، فلا يستطيع أحد رد تدبيره والخروج من تقديره.",
    "SuraName": "الأنعام",
    "AyaNumber": 18
  },
  {
    "id": 59,
    "name": "القدوس ",
    "referer": "ورد في قوله تعالى: { يسبح لله ما في السماوات وما في الأرض الملك القدوس العزيز الحكيم }.وكان النبي – صلى الله عليه وسلم - يقول عقب فراغه من صلاة الوتر: ( سبحان الملك القدوس ) رواه النسائي .",
    "description": "والقدوس مأخوذ من الطهارة، وهو اسم يتضمن جميع صفات الكمال، ونفي كل نقيصة لا تليق بجلاله، فالتقديس هو إثبات الفضائل، ونفي الرذائل، فهو – سبحانه - طاهر في نفسه، مطهّر لغيره، وهو المنـزَّه والمنـزِّه.",
    "SuraName": "الجمعة",
    "AyaNumber": 1
  },
  {
    "id": 60,
    "name": "القدير",
    "referer": " ورد في قوله تعالى: { وهو العليم القدير }",
    "description": "ومعناه: الكامل القدرة لا يلابس قدرته عجز بوجه من الوجوه فلا يعجزه شيء .",
    "SuraName": "الروم",
    "AyaNumber": 54
  },
  {
    "id": 61,
    "name": "القريب ",
    "referer": " ورد في قوله تعالى: {إن ربي قريب مجيب}.قال - صلى الله عليه وسلم - : ( لستم تدعون أصمَّ ولا غائباً ولكن إنكم تدعون سميعا قريبا وهو معكم ) رواه مسلم .",
    "description": "ومعناه: أنه سبحانه وإن علا على خلقه واستوى على عرشه إلا أن قريب منهم بعلمه وقدرته، لا يخفى عليه شيء، ولا يعجزه شيء .",
    "SuraName": "هود",
    "AyaNumber": 61
  },
  {
    "id": 62,
    "name": "القهار ",
    "referer": "ورد في قوله تعالى: { قل الله خالق كل شيء وهو الواحد القهار }",
    "description": "ومعناه: الذي قهر الجبابرة من عتاة خلقه بالعقوبة، وقهر الخلق كلهم بالموت.",
    "SuraName": "الرعد",
    "AyaNumber": 16
  },
  {
    "id": 63,
    "name": "القوي ",
    "referer": "ورد في قوله تعالى: { إن ربك هو القوي العزيز }",
    "description": "ومعناه: ذو القوة التامة الذي لا يلحقه العجز في حال من الأحوال.",
    "SuraName": "هود",
    "AyaNumber": 66
  },
  {
    "id": 64,
    "name": "القيّوم ",
    "referer": " ورد في قوله تعالى: { الله لا إله إلا هو الحي القيوم }",
    "description": "ومعناه: أنه قائم على كل شيء بالحفظ والرعاية والتدبير.",
    "SuraName": "البقرة",
    "AyaNumber": 255
  },
  {
    "id": 65,
    "name": "الكافي ",
    "referer": "ورد في قوله تعالى: { أليس الله بكاف عبده }",
    "description": "ومعناه: الذي كفا خلقه شؤونهم، فهو الذي خلقهم، ورزقهم، وهو الذي يحييهم ويميتهم، فلا كافي على الإطلاق في جميع الأمور إلا هو سبحانه .",
    "SuraName": "الزمر",
    "AyaNumber": 36
  },
  {
    "id": 66,
    "name": "الكبير ",
    "referer": "ورد في قوله تعالى: { عالم الغيب والشهادة الكبير المتعال }",
    "description": "ومعناه: أنه أكبر من كل شيء، وكل شيء دونه، وأنه أعظم من كل شيء، وكل عظيم دونه .",
    "SuraName": "الرعد",
    "AyaNumber": 9
  },
  {
    "id": 67,
    "name": "الكريم ",
    "referer": " ورد في قوله تعالى: { يا أيها الإنسان ما غرّك بربك الكريم }",
    "description": "ومعناه: ذو النفع العظيم لعباده فهو الذي خلقهم ورزقهم، وهو الذي يعفو عن مسيئهم، ويتجاوز عن مذنبهم .",
    "SuraName": "الانفطار",
    "AyaNumber": 6
  },
  {
    "id": 68,
    "name": "اللطيف",
    "referer": " ورد في قوله تعالى: { وهو اللطيف الخبير }",
    "description": "ومعناه الذي يتلطف بعباده فييسر لهم سبل الخير واليسر، وأسباب الصلاح والبر.",
    "SuraName": "الأنعام",
    "AyaNumber": 103
  },
  {
    "id": 69,
    "name": "المبديء المعيد",
    "referer": " ورد في قوله تعالى: { إنه هو يبدئ ويعيد }",
    "description": "ومعناهما الذي أبدأ الخلق فأوجدهم عن عدم، والمعيد الذي يعيد الخلق بعد الحياة إلى الممات، ثم يعيدهم بعد الموت إلى الحياة.",
    "SuraName": "البروج",
    "AyaNumber": 13
  },
  {
    "id": 70,
    "name": "المقدم والمؤخر",
    "referer": "وهما اسمان لم يردا في القرآن، ولكن وردا في حديث النبي حيث قال - عليه الصلاة والسلام - : ( اللهم اغفر لي ما قدمت وما أخرت، وما أسررت وما أعلنت، وما أسرفت وما أنت أعلم به مني، أنت المقدم وأنت المؤخر، لا إله إلا أنت ).",
    "description": "ومعناه:ما أن الله هو المُنزل للأشياء منازلها، يقدّم ما شاء منها، ويؤخر ما شاء، قدم من أحب من أوليائه على غيرهم من عبيده، وأخر من شاء بذنوبهم وأوزارهم، لا مقدم لما أخر، ولا مؤخر لما قدم .",
    "SuraName": "متفق عليه .",
    "AyaNumber": null
  },
  {
    "id": 71,
    "name": "المؤمن ",
    "referer": "ورد في قوله تعالى: { هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن } ",
    "description": "ومعناه: أنه الذي صدّق المؤمنين في إيمانهم، وصَدَقَ في وعده لهم،  وآمنهم من عذابه . ",
    "SuraName": "الحشر",
    "AyaNumber": 23
  },
  {
    "id": 72,
    "name": "المبين ",
    "referer": "ورد في قوله تعالى: { ويعلمون أن الله هو الحق المبين }",
    "description": "ومعناه: الذي لا يخفى، لظهور دلائل وجوده وآثار صنعه . كما أنه المبين لعباده سبل الرشاد، والموضح لهم طرق الغواية .",
    "SuraName": "النور",
    "AyaNumber": 25
  },
  {
    "id": 73,
    "name": "المتعالي ",
    "referer": "ورد في قوله تعالى: { عالم الغيب والشهادة الكبير المتعال }",
    "description": "ومعناه: الذي ترفّع عما نسبه إليه أهل الكفر والإلحاد من النظراء والأنداد . واستعلى على كل شيء بقدرته.",
    "SuraName": "الرعد",
    "AyaNumber": 9
  },
  {
    "id": 74,
    "name": "المتكبر ",
    "referer": " ورد في قوله تعالى: { هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن المهيمن العزيز الجبار المتكبر }",
    "description": " ومعناه: مأخوذ من الكبرياء الذي هو عظمة الله تعالى، وتعاليه عن صفات الخلق، لا من الكبر الذي هو مذموم عند الخلق والذي يعني احتقار الناس وغمطهم حقوقهم .",
    "SuraName": "الحشر",
    "AyaNumber": 23
  },
  {
    "id": 75,
    "name": "المتين ",
    "referer": " ورد في قوله تعالى: { إن الله هو الرزاق ذو القوة المتين }",
    "description": " ومعناه: المتصف بالشدة والصلابة.",
    "SuraName": "الذاريات",
    "AyaNumber": 58
  },
  {
    "id": 76,
    "name": "المجيب ",
    "referer": " ورد في قوله تعالى: { إن ربي قريب مجيب }",
    "description": "ومعناه: الذي يجيب دعاء الداعين، وسؤال السائلين.",
    "SuraName": "هود",
    "AyaNumber": 61
  },
  {
    "id": 77,
    "name": "المجيد ",
    "referer": " قال تعالى: {ذو العرش المجيد }",
    "description": "ومعنى المجيد أي: الواسع الكريم، وأصل المجد في كلام العرب السعة، يقال: رجل ماجد إذا كان سخيا واسع العطاء.",
    "SuraName": "البروج",
    "AyaNumber": 15
  },
  {
    "id": 78,
    "name": "المحصي ",
    "referer": " ورد في قوله تعالى: { وأحصى كل شيء عددا }",
    "description": " ومعناه: العالم بمقادير الحوادث مهما كثرت وتعددت ما أحاط به العباد، وما لم يحيطوا به، كالأنفاس وعدد القطر والرمل والحصا والنبات، وأصناف الحيوان والموات وعامة الموجودات.",
    "SuraName": "الجن",
    "AyaNumber": 28
  },
  {
    "id": 79,
    "name": "المحيط ",
    "referer": "ورد في آيات منها قوله تعالى: {  إن الله بما يعملون محيط }",
    "description": "ومعناه: الذي أحاطت قدرته بجميع خلقه، ووسعهم علمه.",
    "SuraName": "آل عمران",
    "AyaNumber": 120
  },
  {
    "id": 80,
    "name": "المصوِّر ",
    "referer": "ورد في قوله تعالى: { هو الله الخالق البارئ المصور }",
    "description": " ومعناه: أنه الذي أنشأ خلقه على صور مختلفة ليتعارفوا بها .",
    "SuraName": "الحشر",
    "AyaNumber": 24
  },
  {
    "id": 81,
    "name": "المعطي ",
    "referer": "ورد في قوله - صلى الله عليه وسلم -: ( من يرد الله به خيرا يفقه في الدين، والله المعطي، وأنا القاسم ).",
    "description": "ومعناه: الذي أعطى كل شيء خلقه، وتولى رزقه.",
    "SuraName": " رواه البخاري.",
    "AyaNumber": null
  },
  {
    "id": 82,
    "name": "المقتدر ",
    "referer": " ورد في قوله تعالى: { فأخذناهم أخذ عزيز مقتدر }",
    "description": " ومعناه: الكامل القدرة، الذي لا يمتنع عليه شيء.",
    "SuraName": "القمر",
    "AyaNumber": 42
  },
  {
    "id": 83,
    "name": "المقيت ",
    "referer": " ورد في قوله تعالى: { وكان الله على كل شيء مقيتا }",
    "description": " ومعناه: الذي دبّر قوت الحيوانات ورزقها، وصرّفه كيف يشاء بحكمته.",
    "SuraName": "النساء",
    "AyaNumber": 85
  },
  {
    "id": 84,
    "name": "المَلِك ",
    "referer": "ورد في قوله تعالى:  { فتعالى الله الملك الحق }. وكان من دعاء النبي - صلى الله عليه وسلم - : ( اللهم أنت الملك، لا إله إلا أنت، أنت ربي، وأنا عبدك، ظلمت نفسي، واعترفت بذنبي، فاغفر لي ذنوبي جميعاً، إنه لا يغفر الذنوب إلا أنت ) رواه الترمذي وغيره .",
    "description": "ومعنى الملك أي: الذي ملك خلقه، ونفذ أمره فيهم، ويتميز ملك الله عن ملك غيره أن ملكه مفتقر إليه في إيجاده وإمداده، وأنه تسمى بالملك قبل خلق الممالك، وأنه مستغنٍ عن الأعوان، وأن ملكه عام وممتد في الدنيا والآخرة، وأنه جنده لا يحصون، وأن ملكه لا يبيد، وأنه سبحانه محيط بملكه إحاطة من لا يغيب عنه دقيق ولا جليل.",
    "SuraName": "طه",
    "AyaNumber": 114
  },
  {
    "id": 85,
    "name": "المليك ",
    "referer": " ورد في قوله تعالى في وصف أهل الجنة: { في مقعد صدق عند مليك مقتدر }",
    "description": " وهو صيغة مبالغة يدل على كمال ملك الله سبحانه لخلقه حيث يشمل الملك بمعنى الحكم، والملك بمعنى التملك والحيازة فالله هو حاكم الخلق ومالكهم .",
    "SuraName": "القمر",
    "AyaNumber": 55
  },
  {
    "id": 86,
    "name": "المنّان ",
    "referer": " ورد في قوله - صلى الله عليه وسلم - في دعائه: ( اللهم إني أسألك بأن لك الحمد لا إله إلا أنت المنان بديع السماوات والأرض ).",
    "description": " ومعناه: المتفضل بعطاياه على عباده .",
    "SuraName": " رواه أبو داود.",
    "AyaNumber": null
  },
  {
    "id": 87,
    "name": "المهيمن ",
    "referer": "ورد في قوله تعالى: { هو الله الذي لا إله إلا هو الملك القدوس السلام المؤمن المهيمن }",
    "description": " ومعناه: مأخوذ من الهيمنة، وهي السيطرة على الشيء بقهره، فالله قاهر لخلقه لا يخرج أحد عن إرادته الكونية، وسلطانه القدري فما شاء الله كان، وما لم يشأ لم يكن.",
    "SuraName": "الحشر",
    "AyaNumber": 23
  },
  {
    "id": 88,
    "name": "المولى ",
    "referer": " ورد في قوله تعالى: { واعتصموا بالله هو مولاكم فنعم المولى ونعم النصير }",
    "description": "ومعناه: الذي يركن إليه الموحدون، ويعتمد عليه المؤمنون في الشدة والرخاء، والسراء والضراء فينصرهم ويغيثهم ويوفقهم .",
    "SuraName": "الحج",
    "AyaNumber": 78
  },
  {
    "id": 89,
    "name": "النصير ",
    "referer": " ورد في قوله تعالى: { واعتصموا بالله هو مولاكم فنعم المولى ونعم النصير }. وفي الحديث: كان النبي - صلى الله عليه وسلم - إذا غزا قوماً قال: ( اللهم أنت عضدي وأنت نصيري وبك أقاتل )",
    "description": " ومعناه: الناصر لرسله وأولياءه والمؤمنين .",
    "SuraName": "الحج",
    "AyaNumber": 78
  },
  {
    "id": 90,
    "name": "الهادي",
    "referer": " ورد في قوله تعالى: { وإن الله لهادي الذين آمنوا إلى صراط مستقيم }. وقال صلى الله عليه وسلم: ( من يهده الله فلا مضل له ومن يضلل فلا هادي له ) رواه مسلم .",
    "description": " ومعناه: الذي يسر لعباده سبل النجاه، وبين لهم طرق الهلاك، ووفق من شاء لاتباع نهجه، وهو الذي هدى سائر الخلق من الحيوان إلى مصالحها، وألهمها كيف تطلب الرزق، وكيف تتقي المضار والمهالك .",
    "SuraName": "الحج",
    "AyaNumber": 54
  },
  {
    "id": 91,
    "name": "الواحد ",
    "referer": " ورد في قوله تعالى: { إنما الله إله واحد }",
    "description": "ومعناه: المتفرد الذي لا ثاني ولا شريك ولا مثل ولا نظير له.",
    "SuraName": "النساء",
    "AyaNumber": 171
  },
  {
    "id": 92,
    "name": "الوارث ",
    "referer": " ورد في قوله تعالى: { وكنا نحن الوارثين }",
    "description": "ومعناه: الباقي بعد ذهاب غيره، فهو يبقى – سبحانه - بعد ذهاب الخلق وهلاكهم، لأن وجودهم كان به، ووجوده ليس بغيره .",
    "SuraName": "القصص",
    "AyaNumber": 58
  },
  {
    "id": 93,
    "name": "الواسع",
    "referer": "ورد في قوله تعالى: { والله واسع عليم }",
    "description": "ومعناه: الغني الذي وسع غناه فقر عباده، ووسع رزقه جميع خلقه.",
    "SuraName": "البقرة",
    "AyaNumber": 247
  },
  {
    "id": 94,
    "name": "الودود ",
    "referer": " ورد في قوله تعالى: { وهو الغفور الودود }",
    "description": "ومعناه: الذي يُحِب رسله والمؤمنين، ويحبه رسله والمؤمنون.",
    "SuraName": "البروج",
    "AyaNumber": 14
  },
  {
    "id": 95,
    "name": "الوكيل",
    "referer": "ورد في قوله تعالى: { وقالوا حسبنا الله ونعم الوكيل }",
    "description": " ومعناه: الذي توكل بأمر الخلائق فحفظها، وتكفل بأرزاقها، وقام بأمورها.",
    "SuraName": "آل عمران",
    "AyaNumber": 173
  },
  {
    "id": 96,
    "name": "الولي",
    "referer": "ورد في قوله تعالى: { وهو الولي الحميد }",
    "description": " ومعناه: القائم على أمور خلقه بالرعاية والحفظ والتدبير وهذه الولاية العامة لجميع خلقه، وهناك الولاية الخاصة والتي تقتضي مزيداً من الرعاية والحفظ والتدبير.",
    "SuraName": "الشورى",
    "AyaNumber": 28
  },
  {
    "id": 97,
    "name": "الوهاب ",
    "referer": " ورد في قوله تعالى: { أم عندهم خزائن رحمة ربك العزيز الوهاب }",
    "description": "ومعناه: المتفضل على خلقه بجزيل العطايا وعظيم المنن.",
    "SuraName": "ص",
    "AyaNumber": 9
  }
];
