const items = [
  {
    name: 'أذكار المساء',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ\n ﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾', subItemDescription: 'سورة البقرة ، آية 255 من قالها حين يمسي أجير منهم حتى يصبح أخرجه الحاكم 1/ 562وصححه الألباني في صحيح الترغيب والترهيب 1/ 273 وعزاه إلى النسائي والطبراني وقال : وإسناد الطبراني جيد' },
      {name: 'أذكار المساء',  repTime: 'ثلاث مرات', count: 3, subItemName: '\nبسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾.\nبسم الله الرحمن الرحيم \n﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾', subItemDescription: 'ن قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء . أبو داود 4/ 322 والترمذي 5/ 567وانظر صحيح الترمذي 3/ 182' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'أمسينا وأمسى الملك للَّه، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌرب أسألك خير ما في هذه الليلة، وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة، وشر ما بعدها ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ', subItemDescription: ' مسلم 4/ 2088' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهم بك أمسينا، وبك أصبحنا، وبك نحيا، وبك نموت، وإليك المصير', subItemDescription: 'الترمذي 5/ 466 وانظر صحيح الترمذي 3/ 142' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ', subItemDescription: 'من قالها موقناً بها حين يمسي فمات من ليلته دخل الجنة ، وكذلك إذا أصبح أخرجه البخاري 7/150' },
      {name: 'أذكار المساء',  repTime: 'أربع مرات', count: 4, subItemName: 'اللَّهم إني أمسيت أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ', subItemDescription: 'من قالها حين يصبح وحين يمسي أربع مرات أعتقه الله من النار . أخرجه أبو داود 4/ 317 والبخاري في الأدب المفرد برقم 1201 والنسائي في عمل اليوم والليلة برقم 9، وابن السني برقم 70 وحسن سماحة الشيخ ابن باز إسناد النسائي وأبي داود في تحفة الأخيار ص 23' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهم ما أمسى بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ', subItemDescription: 'من قالها حين يصبح فقد أدي شكر يومه ، ومن قالها حين يمسى فقد أدى شكر ليلته . أخرجه أبو داود 4/318 ، والنسائي في عمل اليوم والليلة برقم 7وابن السني برقم 41 وابن حبان (( موارد)) رقم 2361وحسن ابن باز إسناده في تحفة الأخيار ص24' },
      {name: 'أذكار المساء',  repTime: 'ثلاث مرات', count: 3, subItemName: 'اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ', subItemDescription: 'أبو داود 4/ 324، وأحمد 5/ 42 والنسائي في عمل اليوم والليلة برقم 22وابن السني برقم 69والبخاري في الأدب المفرد وحسن العلامة ابن باز في تحفة الأخيار ص26' },
      {name: 'أذكار المساء',  repTime: 'سبع مرات', count: 7, subItemName: 'حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ', subItemDescription: ' من قالها حين يصبح ويمسي سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة .أخرجه ابن السني برقم 71مرفوعاً وأبو موقوف 4/321،وصحح إسناده شعيب وعبد القادر الأرناؤوط . انظر زاد المعاد 2/ 376'  },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي', subItemDescription: ' أبو داود وابن ماجه وانظر صحيح ابن ماجه 2/332' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ', subItemDescription: ' الترمذي وأبو داود .انظر :صحيح الترمذي3/ 142' },
      {name: 'أذكار المساء',  repTime: 'ثلاث مرات', count: 3, subItemName: 'بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ', subItemDescription: 'من قالها ثلاثاً إذا أصبح وثلاثاً إذا أمسى لم يضره شيء أخرجه أبو داود 4/ 323 والترمذي 5/ 465 وابن ماجه وأحمد . انظر : صحيح ابن ماجه 2/332 وحسن إسناده العلامة ابن باز في تحفة الأخيار ص39' },
      {name: 'أذكار المساء',  repTime: 'ثلاث مرات', count: 3, subItemName: 'رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيّاً', subItemDescription: 'من قالها ثلاثاً حين يصبح وحين يمسي كان حقاً على الله أن يرضيه يوم القيامة . أحمد 4/ 337 والنسائي في عمل اليوم والليلة برقم 4 وابن السني برقم 68 وأبو داود 4/418 والترمذي 5/465 وحسنه ابن باز في تحفة الأخيار ص 39' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ', subItemDescription: 'الحاكم وصححه ووافقه الذهبي 1/ 545 وانظر صحيح الترغيب والترهيب 1/273' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'أمسينا وأمسى الملك للَّه ربّ العالمين اللَّهم إني أسألك خير هذه الليلة: فتحها، ونصرها، ونورها، وبركتها، وهداها، وأعوذ بك من شر ما فيها، وشر ما بعدها', subItemDescription: 'أبو داود 4/ 322 وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد 2/ 273' },
      {name: 'أذكار المساء',  repTime: 'مرة واحدة', count: 1, subItemName: 'أمسينا على فطرة الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صلى الله عليه وسلم، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ', subItemDescription: 'أحمد 3/ 406و 407 وابن السني في عمل اليوم والليلة برقم 34 وانظر : صحيح الجامع 4/ 209' },
      {name: 'أذكار المساء',  repTime: 'مائة مرة', count: 100, subItemName: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ', subItemDescription: 'من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد رواه مسلم4 / 2071' },
      {name: 'أذكار المساء',  repTime: 'عشر مرات', count: 10, subItemName: 'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ', subItemDescription: 'النسائي في عمل اليوم والليلة برقم 24 وانظر :صحيح الترغيب والترهيب 1/272 ،وتحفة الأخيار لابن باز ص44وانظر فضلها في ص146 ،حديث رقم 255' },
      {name: 'أذكار المساء',  repTime: 'مائة مرة', count: 100, subItemName: 'أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ', subItemDescription: 'البخاري مع الفتح 11/ 101 ، ومسلم 4/ 2075' },
      {name: 'أذكار المساء',  repTime: 'ثلاث مرات', count: 3, subItemName: 'أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ', subItemDescription: 'من قالها حين يمسي ثلاث مرات لم تضره حمة تلك الليلة أخرجه أحمد 2/290 والنسائي في عمل اليوم والليلة برقم 590 وابن السني برقم 68وانظر : صحيح الترمذي 3/187، وصحيح ابن ماجه 2/266 وتحفة الأخيار ص45' },
      {name: 'أذكار المساء',  repTime: 'عشر مرات', count: 10, subItemName: 'اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ', subItemDescription: 'من صلى علي حين يُصبح عشراً ، وحين يُمسي عشراً أدركتهُ شفاعتي يوم القيامة رواه الطبراني بإسنادين أحدهما جيد ، انظر الزائد 10/ 120 وصحيح الترغيب والترهيب 1/273' },

      // Add more sub-items as needed
    ],
  },
  {
    name: 'أذكار الصباح',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ\n ﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾', subItemDescription: 'سورة البقرة ، آية 255 '  },
      {  name: 'أذكار الصباح', repTime: 'ثلاث مرات', count: 3, subItemName: 'بسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.\n\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾. \n\nبسم الله الرحمن الرحيم \n ﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾', subItemDescription: 'من قالها ثلاث مرات حين يصبح وحين يمسي كفته من كل شيء . أبو داود 4/ 322 والترمذي 5/ 567وانظر صحيح الترمذي 3/ 182'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ ، وَالْحَمْدُ لِلَّهِ، لاَ إِلَهَ إلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَذَا الْيَوْمِ وَخَيرَ مَا بَعْدَهُ ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ', subItemDescription: 'مسلم 4/ 2088'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ بِكَ أَصْبَحْنَا، وَبِكَ أَمْسَيْنَا ، وَبِكَ نَحْيَا، وَبِكَ نَمُوتُ وَإِلَيْكَ النُّشُورُ', subItemDescription: 'الترمذي 5/ 466 وانظر صحيح الترمذي 3/ 142'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلاَّ أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ', subItemDescription: 'من قالها موقناً بها حين يمسي فمات من ليلته دخل الجنة ، وكذلك إذا أصبح أخرجه البخاري 7/150'  },
      {  name: 'أذكار الصباح', repTime: 'أربع مرات', count: 4, subItemName: 'اللَّهُمَّ إِنِّي أَصْبَحْتُ أُشْهِدُكَ، وَأُشْهِدُ حَمَلَةَ عَرْشِكَ، وَمَلاَئِكَتِكَ، وَجَمِيعَ خَلْقِكَ، أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، وَأَنَّ مُحَمَّداً عَبْدُكَ وَرَسُولُكَ', subItemDescription: 'من قالها حين يصبح وحين يمسي أربع مرات أعتقه الله من النار . أخرجه أبو داود 4/ 317 والبخاري في الأدب المفرد برقم 1201 والنسائي في عمل اليوم والليلة برقم 9، وابن السني برقم 70 وحسن سماحة الشيخ ابن باز إسناد النسائي وأبي داود في تحفة الأخيار ص 23'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ مَا أَصْبَحَ بِي مِنْ نِعْمَةٍ أَوْ بِأَحَدٍ مِنْ خَلْقِكَ فَمِنْكَ وَحْدَكَ لاَ شَرِيكَ لَكَ، فَلَكَ الْحَمْدُ وَلَكَ الشُّكْرُ', subItemDescription: 'من قالها حين يصبح فقد أدي شكر يومه ، ومن قالها حين يمسى فقد أدى شكر ليلته . أخرجه أبو داود 4/318 ، والنسائي في عمل اليوم والليلة برقم 7وابن السني برقم 41 وابن حبان (( موارد)) رقم 2361وحسن ابن باز إسناده في تحفة الأخيار ص24'  },
      {  name: 'أذكار الصباح', repTime: 'ثلاث مرات', count: 3, subItemName: 'اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لاَ إِلَهَ إِلاَّ أَنْتَ. اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْكُفْرِ، وَالفَقْرِ، وَأَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ، لاَ إِلَهَ إِلاَّ أَنْتَ', subItemDescription: 'أبو داود 4/ 324، وأحمد 5/ 42 والنسائي في عمل اليوم والليلة برقم 22وابن السني برقم 69والبخاري في الأدب المفرد وحسن العلامة ابن باز في تحفة الأخيار ص26'  },
      {  name: 'أذكار الصباح', repTime: 'سبع مرات', count: 7, subItemName: 'حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ', subItemDescription: ' من قالها حين يصبح ويمسي سبع مرات كفاه الله ما أهمه من أمر الدنيا والآخرة .أخرجه ابن السني برقم 71مرفوعاً وأبو موقوف 4/321،وصحح إسناده شعيب وعبد القادر الأرناؤوط . انظر زاد المعاد 2/ 376'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ فِي الدُّنْيَا وَالآخِرَةِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْعَفْوَ وَالْعَافِيَةَ: فِي دِينِي وَدُنْيَايَ وَأَهْلِي، وَمَالِي، اللَّهُمَّ اسْتُرْ عَوْرَاتِي، وَآمِنْ رَوْعَاتِي، اللَّهُمَّ احْفَظْنِي مِنْ بَينِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِينِي، وَعَنْ شِمَالِي، وَمِنْ فَوْقِي، وَأَعُوذُ بِعَظَمَتِكَ أَنْ أُغْتَالَ مِنْ تَحْتِي', subItemDescription: 'أبو داود وابن ماجه وانظر صحيح ابن ماجه 2/332'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشَرَكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ', subItemDescription: 'الترمذي وأبو داود .انظر :صحيح الترمذي3/ 142'  },
      {  name: 'أذكار الصباح', repTime: 'ثلاث مرات', count: 3, subItemName: 'بِسْمِ اللَّهِ الَّذِي لاَ يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلاَ فِي السّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ', subItemDescription: 'من قالها ثلاثاً إذا أصبح وثلاثاً إذا أمسى لم يضره شيء أخرجه أبو داود 4/ 323 والترمذي 5/ 465 وابن ماجه وأحمد . انظر : صحيح ابن ماجه 2/332 وحسن إسناده العلامة ابن باز في تحفة الأخيار ص39'  },
      {  name: 'أذكار الصباح', repTime: 'ثلاث مرات', count: 3, subItemName: 'رَضِيتُ بِاللَّهِ رَبَّاً، وَبِالْإِسْلاَمِ دِيناً، وَبِمُحَمَّدٍ صلى الله عليه وسلم نَبِيّاً', subItemDescription: ' من قالها ثلاثاً حين يصبح وحين يمسي كان حقاً على الله أن يرضيه يوم القيامة . أحمد 4/ 337 والنسائي في عمل اليوم والليلة برقم 4 وابن السني برقم 68 وأبو داود 4/418 والترمذي 5/465 وحسنه ابن باز في تحفة الأخيار ص 39'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغيثُ أَصْلِحْ لِي شَأْنِيَ كُلَّهُ وَلاَ تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ', subItemDescription: 'الحاكم وصححه ووافقه الذهبي 1/ 545 وانظر صحيح الترغيب والترهيب 1/273'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ رَبِّ الْعَالَمِينَ، اللَّهُـمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذَا الْيَوْمِ:فَتْحَهُ، وَنَصْرَهُ، وَنورَهُ، وَبَرَكَتَهُ، وَهُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيهِ وَشَرِّ مَا بَعْدَهُ', subItemDescription: ' أبو داود 4/ 322 وحسن إسناده شعيب وعبد القادر الأرناؤوط في تحقيق زاد المعاد 2/ 273'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'أَصْبَحْنا عَلَى فِطْرَةِ الْإِسْلاَمِ، وَعَلَى كَلِمَةِ الْإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صلى الله عليه وسلم، وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ، حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ الْمُشرِكِينَ', subItemDescription: ' أحمد 3/ 406و 407 وابن السني في عمل اليوم والليلة برقم 34 وانظر : صحيح الجامع 4/ 209'  },
      {  name: 'أذكار الصباح', repTime: 'مائة مرة', count: 100, subItemName: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ', subItemDescription: 'من قالها مائة مرة حين يصبح وحين يمسي لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد رواه مسلم4 / 2071'  },
      {  name: 'أذكار الصباح', repTime: 'عشر مرات', count: 10, subItemName: 'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ', subItemDescription: 'النسائي في عمل اليوم والليلة برقم 24 وانظر :صحيح الترغيب والترهيب 1/272 ،وتحفة الأخيار لابن باز ص44وانظر فضلها في ص146 ،حديث رقم 255'  },
      {  name: 'أذكار الصباح', repTime: 'ثلاث مرات', count: 3, subItemName: 'سُبْحَانَ اللَّهِ وَبِحَمْدِهِ: عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ، وَمِدَادَ كَلِمَاتِهِ', subItemDescription: 'مسلم 4/2090'  },
      {  name: 'أذكار الصباح', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً', subItemDescription: 'أخرجه ابن السني في عمل اليوم والليلة برقم 54وابن ماجه برقم 925وحسن إسناده عبد القادر وشعيب الأرناؤوط في تحقيق زاد المعاد 2/375'  },
      {  name: 'أذكار الصباح', repTime: 'مائة مرة', count: 100, subItemName: 'أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ', subItemDescription: 'البخاري مع الفتح 11/ 101 ، ومسلم 4/ 2075'  },
      {  name: 'أذكار الصباح', repTime: 'عشر مرات', count: 10, subItemName: 'اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى نَبَيِّنَا مُحَمَّدٍ', subItemDescription: 'من صلى علي حين يُصبح عشراً ، وحين يُمسي عشراً أدركتهُ شفاعتي يوم القيامة رواه الطبراني بإسنادين أحدهما جيد ، انظر الزائد 10/ 120 وصحيح الترغيب والترهيب 1/273'  }

      // Add more sub-items as needed
    ],
  },
  {
    name: ' أذكار بعد الصلاة',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { name: 'أذكار بعد الصلاة', repTime: 'مرة واحدة', count: 1, subItemName: 'أستغفر الله، أستغفر الله، أستغفر الله، اللهم أنت السلام، ومنك السلام، تباركت يا ذا الجلال والإكرام', subItemDescription: 'مسلم1/ 414' },
      { name: 'أذكار بعد الصلاة', repTime: 'مرة واحدة', count: 1, subItemName: 'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌاللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ، وَلاَ مُعْطِيَ لِمَا مَنَعْتَ، وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ', subItemDescription: 'البخاري 1 /255 ومسلم 1 / 414' },
      { name: 'أذكار بعد الصلاة', repTime: 'مرة واحدة', count: 1, subItemName: 'لَا إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ. لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ، لاَ إِلَهَ إِلاَّ اللَّهُ، وَلاَ نَعْبُدُ إِلاَّ إِيَّاهُ, لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلاَّ اللَّهُ مُخْلِصِينَ لَهُ الدِّينَ وَلَوْ كَرِهَ الكَافِرُونَ', subItemDescription: 'مسلم 1/ 415' },
      { name: 'أذكار بعد الصلاة', repTime: '33 مرة', count: 33, subItemName: 'سُبْحَانَ اللَّهِ', subItemDescription: 'مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418' },
      { name: 'أذكار بعد الصلاة', repTime: '33 مرة', count: 33, subItemName: 'وَالْحَمْدُ لِلَّهِ', subItemDescription: 'مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418' },
      { name: 'أذكار بعد الصلاة', repTime: '33 مرة', count: 33, subItemName: 'وَاللَّهُ أَكْبَرُ', subItemDescription: 'مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418' },
      { name: 'أذكار بعد الصلاة', repTime: 'مرة واحدة', count: 1, subItemName: 'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ', subItemDescription: 'مسلم 1/ 418من قال ذلك دبر كل صلاة غفرت خطاياه وإن كانت مثل زبد البحر مسلم 1/ 418' },
      { name: 'أذكار بعد الصلاة', repTime: 'مرة واحدة', count: 1, subItemName: '\nبسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾.\nبسم الله الرحمن الرحيم \n﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾', subItemDescription: 'أبو داود2 /86 والنسائي 3/ 68 وانظر صحيح الترمذي 2/8 والسور الثلاث يقال لها المعوذات وانظر فتح الباري 9 / 62' },
      { name: 'أذكار بعد الصلاة', repTime: 'مرة واحدة', count: 1, subItemName: 'أَعُوذُ بِاللَّهِ مِنَ الشَّيطَانِ الرَّجِيمِ\n ﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾', subItemDescription: 'من قرأها دبر كل صلاة لم يمنعه من دخول الجنة إلا أن يموت . والنسائي في عمل اليوم والليلة برقم 100 ، وابن السني برقم 121 وصححه الجامع 5/339 وسلسلة الأحاديث الصحيحة 2/697 برقم 972' },
      { name: 'أذكار بعد الصلاة', repTime: 'عشر مرات', count: 10, subItemName: 'لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n\n عَشْرَ مَرّاتٍ بَعْدَ صَلاةِ الْمَغْرِبِ وَالصُّبْحِ', subItemDescription: 'رواه الترمذي 5/515 وأحمد 4/ 227 وانظر تخريجه في زاد المعاد 1/300' },
      { name: 'أذكار بعد الصلاة', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نافِعاً، وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً \n\nبَعْدَ السّلامِ مِنْ صَلاَةِ الفَجْرِ ', subItemDescription: '' },

      // Add more sub-items as needed
    ],
  },
  {
    name: 'أذكار النوم',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      {
        name: 'أذكار النوم', repTime: 'ثلاث مرات', count: 3, subItemName: 'يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا:\n\nبسم الله الرحمن الرحيم\n ﴿قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ* لَمْ يَلِدْ وَلَمْ يُولَدْ* وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.\n\n بسم الله الرحمن الرحيم\n ﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ* مِن شَرِّ مَا خَلَقَ* وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ* وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ* وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾. \n\nبسم الله الرحمن الرحيم \n﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ* مَلِكِ النَّاسِ* إِلَهِ النَّاسِ* مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ* الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ* مِنَ الْجِنَّةِ وَ النَّاسِ﴾ \n\n\nثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقبَلَ مِنْ جَسَدِهِ'
        , subItemDescription: ' البخاري مع الفتح 9/62ومسلم 4/1723'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: '﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْـــــــــــدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾.'
        , subItemDescription: 'من قرأها إذا أوى إلى فراشه فإنه لن يزال عليه من الله حافظ ولا يقربه شيطان حتى يصبح البخاري مع الفتح 4/487'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: '﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾.'
        , subItemDescription: ' من قرأها في ليلة كفتاه، البخاري مع الفتح 9/ 94 ومسلم 1/ 554 ، والآيتان من سورة البقرة 285-286'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ'
        , subItemDescription: ' البخاري 11/ 126 .ومسلم 4/ 2084'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْياهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ'
        , subItemDescription: ' رواه مسلم4/ 2083وأحمد بلفظه 2/79'
      },
      {
        name: 'أذكار النوم', repTime: 'ثلاث مرات', count: 3, subItemName: 'اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ'
        , subItemDescription: ' أبو داود بلفظه 4/311 وانظر صحيح الترمذي3/ 143'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا'
        , subItemDescription: 'البخاري مع الفتح 11/113 ومسلم 4/ 2083'
      },
      {
        name: 'أذكار النوم', repTime: '33 مرة', count: 33, subItemName: 'سُبْحَانَ اللَّهِ '
        , subItemDescription: ' من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم البخاري مع الفتح 7/71 ومسلم 4/ 2091'
      },
      {
        name: 'أذكار النوم', repTime: '33 مرة', count: 33, subItemName: 'وَالْحَمْدُ لِلَّهِ '
        , subItemDescription: ' من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم البخاري مع الفتح 7/71 ومسلم 4/ 2091'
      },
      {
        name: 'أذكار النوم', repTime: '34 مرة', count: 34, subItemName: ' وَاللَّهُ أَكْبَرُ'
        , subItemDescription: ' من قال ذلك عندما يأوي إلى فراشه كان خيراً له من خادم البخاري مع الفتح 7/71 ومسلم 4/ 2091'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ'
        , subItemDescription: 'مسلم 4/ 2084'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لاَ كَافِيَ لَهُ وَلاَ مُؤْوِيَ'
        , subItemDescription: ' مسلم 4/ 2085'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ'
        , subItemDescription: ' أبو داود 4/ 317 وانظر صحيح سنن الترمذي3/ 142'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'يَقْرَأُ ﴿الم﴾ تَنْزِيلَ السَّجْدَة ِ، وَتَبَارَكَ الَّذي بِيَدِهِ الْمُلْكُ'
        , subItemDescription: ' الترمذي والنسائي وانظر صحيح الجامع4/ 255'
      },
      {
        name: 'أذكار النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأْتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لاَ مَلْجَأَ وَلاَ مَنْجَا مِنْكَ إِلاَّ إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ'
        , subItemDescription: ' قال صلى الله عليه وسلم لمن قال ذلك : "فإن متَّ،متَّ على الفطرة " البخاري مع الفتح 11/113 ومسلم 4/ 2081'
      },
      // Add more sub-items as needed
    ],
  },
  {
    name: 'أذكار الاستيقاظ من النوم',
    subItems: [
      { name: 'أذكار الاستيقاظ من النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.', subItemDescription: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.' },
      { name: 'أذكار الاستيقاظ من النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'لا إلَهَ إلاَّ الله وحْدَهُ لا شَرِيكَ لَهُ، لَهُ المُلْكُ ولَهُ الحَمْدُ وهُوَ على كلِّ شيءٍ قَدير،سُبْحانَ الله والحَمْدُ لله ولا إله إلا الله والله أكبر ولا حَولَ ولا قُوةَ إلا بالله العلي العظيم. رب اغفر لي.', subItemDescription: 'رواه البخاري مع الفتح 3/ 144 وغيرها واللفظ لابن ماجه انظر صحيح ابن ماجه 2/ 335 .' },
      { name: 'أذكار الاستيقاظ من النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'الحَمْدُ لله الذِي عَافَانِي في جَسَدِي ورَدَّ عَلَيَّ رُوحِي، وأَذِنَ لي بِذِكْرهِ.', subItemDescription: 'الترمذي 5/ 473 وانظر صحيح الترمذي3/144' },
      { name: 'أذكار الاستيقاظ من النوم', repTime: 'مرة واحدة', count: 1, subItemName: 'إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لآيَاتٍ لِّأُوْلِي الألْبَابِ *الَّذِينَ يَذْكُرُونَ اللّهَ قِيَاماً وَقُعُوداً وَعَلَىَ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ*رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ *رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِياً يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ * رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ *فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لاَ أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَى بَعْضُكُم مِّن بَعْضٍ فَالَّذِينَ هَاجَرُواْ وَأُخْرِجُواْ مِن دِيَارِهِمْ وَأُوذُواْ فِي سَبِيلِي وَقَاتَلُواْ وَقُتِلُواْ لأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ ثَوَاباً مِّن عِندِ اللّهِ وَاللّهُ عِندَهُ حُسْنُ الثَّوَابِ *لاَ يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُواْ فِي الْبِلاَدِ *مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ *لَكِنِ الَّذِينَ اتَّقَوْاْ رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا نُزُلاً مِّنْ عِندِ اللّهِ وَمَا عِندَ اللّهِ خَيْرٌ لِّلأَبْرَارِ * وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللّهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَا أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلّهِ لاَ يَشْتَرُونَ بِآيَاتِ اللّهِ ثَمَناً قَلِيلاً أُوْلَـئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ إِنَّ اللّهَ سَرِيعُ الْحِسَابِ *يَا أَيُّهَا الَّذِينَ آمَنُواْ اصْبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَاتَّقُواْ اللّهَ لَعَلَّكُمْ تُفْلِحُونَ ', subItemDescription: 'الآيات من سورة آل عمران ،190 - 200 ، البخاري مع الفتح 8/ 238 ومسلم 1/ 530' }
    ],
  },
  {
    name: 'دعاء دخول المسجد',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      {  name: 'دعاء دخول المسجد', repTime: 'مرة واحدة', count: 1, subItemName: 'يَبْدَأُ بِرِجْلِهِ الْيُمْنَى', subItemDescription: '' },
      {  name: 'دعاء دخول المسجد', repTime: 'مرة واحدة', count: 1, subItemName: 'عُوذُ بِاللَّهِ العَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ', subItemDescription: 'أبو داود وانظر صحيح الجامع برقم 4591' },
      {  name: 'دعاء دخول المسجد', repTime: 'مرة واحدة', count: 1, subItemName: 'بِسْمِ اللَّهِ، وَالصَّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ اللَّهُمَّ، افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ', subItemDescription: 'رواه ابن السني برقم 88 وحسنه الألباني\nأبو داود 1/ 126 وانظر صحيح الجامع 1/ 528\nرواه مسلم1/ 494. وفي سنن ابن ماجه من حديث فاطمة رضي الله عنها " اللهم اغفر لي ذنوبي وافتح لي أبواب رحمتك " وصححه الألباني لشواهده انظر صحيح ابن ماجه 1/ 128' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'الدعاء بعد التشهد الأخير وقبل السلام',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'للَّهُــمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ', subItemDescription: 'البخاري 2/ 102 ومسلم 1/ 412 واللفظ لمسلم' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ. اللَّهُمَّ إِنِّي أَعوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ', subItemDescription: 'البخاري 1/ 202 ومسلم 1/ 412' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلاَ يَغْفِرُ الذُّنوبَ إِلاَّ أَنْتَ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الغَفورُ الرَّحيمُ', subItemDescription: 'البخاري 8/168 ومسلم 4/ 2078' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي. أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لاَ إِلَهَ إِلاَّ أَنْتَ', subItemDescription: 'مسلم 1/ 534' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبادَتِكَ', subItemDescription: 'أبو داود 2/ 86والنسائي 3/ 53 وصححه الألباني في صحيح أبو داود 1/ 284' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبُخْلِ، وَأَعوذُ بِكَ مِنَ الْجُبْنِ، وَأَعُوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا وَعَذَابِ الْقَبْرِ', subItemDescription: 'البخاري 6/35' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ', subItemDescription: 'أبو داود وانظر صحيح ابن ماجه 2/ 328' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'للَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلقِ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأَسْــــأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِي غَيرِ ضَرَّاءَ مُضِرَّةٍ، وَلاَ فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيِّنَا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ', subItemDescription: 'النسائي 4/54،55وأحمد 4/364 وصححه الألباني في صحيح النسائي 1/ 281' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا أَللَّهُ بِأَنَّكَ الْوَاحِدُ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يولَدْ، وَلَمْ يَكنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِّيمُ', subItemDescription: ' أخرجه النسائي بلفظه 3/52وأحمد 4/338 وصححه الألباني في صحيح النسائي 1/ 280' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدَ لَا إِلَهَ إِلاَّ أَنْتَ وَحْدَكَ لاَ شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيعَ السَّمَوَاتِ وَالْأَرْضِ يَا ذَا الْجَلاَلِ وَالْإِكْرَامِ، يَا حَيُّ يَا قَيُّومُ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَأَعُوذُ بِكَ مِنَ النَّارِ', subItemDescription: 'رواه أهل السنن وانظر صحيح ابن ماجه 2/ 329' },
      {  name: 'الدعاء بعد التشهد الأخير وقبل السلام', repTime: 'مرة واحدة', count: 1, subItemName: 'للَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لاَ إِلَهَ إِلاَّ أَنْتَ الْأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ', subItemDescription: 'أبو داود2/62والترمذي 5/ 515 وابن ماجه 2/ 1267 وأحمد 5/360 وانظر صحيح ابن ماجه 2/ 329 وصحيح الترمذي 3/ 163' },
      // Add more sub-items as needed
    ],
  },





  {
    name: 'دعاء الخروج من المسجد',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      {  name: 'دعاء الخروج من المسجد', repTime: 'مرة واحدة', count: 1, subItemName: 'يَبْدَأُ بِرِجْلِهِ الْيُسْرَى', subItemDescription: '' },
      {  name: 'دعاء الخروج من المسجد', repTime: 'مرة واحدة', count: 1, subItemName: 'بِسْمِ اللَّهِ وَالصّلَاةُ وَالسَّلَامُ عَلَى رَسُولِ اللَّهِ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِك، اللَّهُمَّ اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيمِ', subItemDescription: 'انظر تخريج روايات الحديث السابق رقم 20 وزيادة (( اللهم اعصمني من الشيطان الرجيم )) لابن ماجه . انظر صحيح ابن ماجه 1/ 288' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'الدعاء عند إفطار الصائم',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      {   name: 'الدعاء عند إفطار الصائم', repTime: 'مرة واحدة', count: 1, subItemName: 'ذَهَبَ الظَّمَأُ وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الْأَجْرُ إِنْ شَاءَ اللَّهُ', subItemDescription: 'أخرجه أبي داود 2/306 وغيره وانظر صحيح الجامع 4/209' },
      {   name: 'الدعاء عند إفطار الصائم', repTime: 'مرة واحدة', count: 1, subItemName: 'اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ أَنْ تَغْفِرَ لِي', subItemDescription: 'أخرجه ابن ماجه 1/557 من دعاء عبد الله بن عمرو رضي الله عنهما ،وحسنه الحافظ في تخريج الأذكار انظر شرح الأذكار 4/342' },
      // Add more sub-items as needed
    ],
  },


  {
    name: ' الدعاء إذا نزل المطر',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: ' الذكر بعد نزول المطر',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء الريح',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: ' دعاء الرعد',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء الغضب',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء الهم والحزن',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء الكرب',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء دخول السوق',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء السفر',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'ذكر الرجوع من السفر',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'الدعاء إذا تقلب ليلاً',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'ما يفعل من رأى الرؤيا أو الحلم',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'الذكر عقب السلام من الوتر',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء من أصيب بمصيبة',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء طرد الشيطان ووساوسه',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'الدعاء للميت في الصلاة عليه',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: ' الدعاء بعد دفن الميت',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },


  {
    name: 'دعاء زيارة القبور',
    description: 'البخاري مع الفتح 11/ 113 ومسلم 4/ 2083.',
    title: 'الحمـد لله الذي أحـيانا بعـد ما أماتـنا وإليه النـشور.',
    subItems: [
      { subItemName: 'Subitem 1', subItemDescription: 'Description 1' },
      { subItemName: 'Subitem 2', subItemDescription: 'Description 2' },
      // Add more sub-items as needed
    ],
  },



];

export const getItems = () => {
  return items;
};


